Address 0030.A3EA.11BC
Cost 19
Port 3(FastEthernet0/3)
Hello Time 2 sec Max Age 20 sec Forward Delay 15 sec
Bridge ID Priority 32769 (priority 32768 sys-id-ext 1) \--我自己桥ID
Address 00D0.BC73.86A2
Hello Time 2 sec Max Age 20 sec Forward Delay 15 sec
Aging Time 20
Interface Role Sts Cost Prio.Nbr Type
\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-- \-\-\-- \-\-- \-\-\-\-\-\-\-\--
\-\-\-\-\-\-\--
\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\--
Fa0/2 Altn BLK 19 128.2 P2p \-\-\--BLK阻塞接口
Fa0/3 Root FWD 19 128.3 P2p \-\-\--FWD转发接口
两种方法更改优先级，不更改默认比较交换机的网卡MAC比较
1修改网桥ID，使其最小（默认为32768）变成主根，值越小越优先
Switch(config)#spanning-tree vlan 1 priority 2 \-\-\--priority
后面随便输入数字，弹出下面的可选数字
\% Bridge Priority must be in increments of 4096.
\% Allowed values are:
0 4096 8192 12288 16384 20480 24576 28672
32768 36864 40960 45056 49152 53248 57344 61440
Switch(config)#spanning-tree vlan 1 priority 28672
2直接指定主根
Switch(config)#spanning-tree vlan 1 root primary \-\--设置主根
Switch(config)#spanning-tree vlan 1 root secondary \-\--设置次根
## PVST
![C:\\Users\\Administrator\\Desktop\\tu\\LINUXNSD_V01PROJECT1DAY05_015.png](media/image27.png){width="5.358333333333333in"
height="3.6305555555555555in"}
配置PVST+实现负载均衡 PVST+ 每Vlan 生成树 STP 生成树协议
![C:\\Users\\Administrator\\Desktop\\tu\\image003.png](media/image28.png){width="2.9625in"
height="1.9430555555555555in"}
所有交换机之间都配置trunk 中继链路，
三层交换先封装 switchport trunk encapsulation dot1q
Ms1
Switch(config)#spanning-tree vlan 1 root primary
Switch(config)#spanning-tree vlan 2 root secondary
Switch#show spanning-tree vlan 1
Ms2
Switch(config)#spanning-tree vlan 1 root secondary
Switch(config)#spanning-tree vlan 2 root primary
Switch#show spanning-tree vlan 1
给Switch1与switch2配上vlan2则所有灯会亮绿
## HSRP
![C:\\Users\\Administrator\\Desktop\\tu\\LINUXNSD_V01PROJECT1DAY05_021.png](media/image29.png){width="5.763888888888889in"
height="3.9145833333333333in"}
**HSRP**:热备份路由选择协议，由虚拟路由器来分配走哪路路由,
活跃路由器与备份路由器由人工指定，必须进入vlan接口模式中，必须有两台设备成一个组
Group-numberip(HSRP备份组号) virtual-ip-address（备份组虚拟IP地址）
Switch(config-if)#standby group-numberip virtual-ip-address
\-\--配置HSRP的成员
例如：Switch(config-if)#standby 1 ip 192.168.1.254
Switch(config-if)#standby group-number priority-value
\--配置HSRP的优先级
> priority-value的范围0\~255，默认为100
Switch#show standby brief \-\-\-\--查看HSRP摘要信息
Switch(config-if)#standby group-number preempt \-\-\-\--HSRP占先权配置
![C:\\Users\\Administrator\\Desktop\\tu\\image004.png](media/image30.png){width="4.134722222222222in"
height="2.3in"}
按图配置，且路由器与三层交换机使用OSPF动态路由协议使所有网路互通
Router(config)#router ospf 1
Router(config-router)#network 192.168.4.0 0.0.0.255 area 0
Router(config-router)#network 192.168.3.0 0.0.0.255 area 0
Router(config-router)#network 192.168.2.0 0.0.0.255 area 0
交换机MS1:（端口配IP记得no switch）
Switch(config)#ip routing \-\-\--开启路由功能
Switch(config)#router ospf 1
Switch(config-router)#network 192.168.1.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.2.0 0.0.0.255 area 0
交换机MS2:（端口配IP记得no switch）
Switch(config)#ip routing \-\-\--开启路由功能
Switch(config)#router ospf 1
Switch(config-router)#network 192.168.1.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.3.0 0.0.0.255 area 0
交换机MS1配置HSRP
Switch(config)#int vlan 1
Switch(config-if)#standby 1 ip 192.168.1.254
Switch(config-if)#
%HSRP-6-STATECHANGE: Vlan1 Grp 1 state Speak -\> Standby
%HSRP-6-STATECHANGE: Vlan1 Grp 1 state Standby -\> Active \--活跃
\-\-\--最终定格在Active 表示为活跃路由器
交换机MS2配置HSRP
Switch(config)#int vlan 1
Switch(config-if)#standby 1 ip 192.168.1.254
%HSRP-6-STATECHANGE: Vlan1 Grp 1 state Speak -\> Standby \--备用
\-\-\-\--最终定格在Standby表示为备用路由器
在MS2中修改优先级，配置占先权，是自己立即成为活跃
Switch(config-if)#standby 1 priority 105 \--修改优先级为105
Switch(config-if)#standby 1 preempt \-\--配置占先权
%HSRP-6-STATECHANGE: Vlan1 Grp 1 state Standby -\> Active --变成活跃
案例1：STP的基本配置
案例2：配置阻塞端口
案例3：STP配置
案例4：三层交换配置HSRP
案例5：完善网络负载均衡
## 1 案例1：STP的基本配置
1.1 问题
按照图-1所示拓扑结构，将S1配置成vlan1的主根，将S2配置成vlan2的次根
![image001](media/image31.png){width="2.716666666666667in"
height="1.9166666666666667in"}
图-1
1.2 步骤
1，在Switch1中配置
Switch(config)#spanning-tree vlan 1 priority 24576
或
Switch(config)#spanning-tree vlan 1 root primary
2，在Switch2中配置
Switch(config)#spanning-tree vlan 1 priority 28672
或
Switch(config)#spanning-tree vlan 1 root secondary
## 2 案例2：配置阻塞端口
2.1 问题
按照图-2拓扑结构所示，通过配置生成树协议，按照拓扑需求阻塞相应端口
![image002](media/image32.png){width="2.525in"
height="1.9583333333333333in"}
图-2
2.2 步骤
1，在Switch3中配置
Switch(config)#spanning-tree vlan 1 root primary
2，在Switch1中配置
Switch(config)#spanning-tree vlan 1 root secondary
## 3 案例3：STP配置
3.1 问题
通过配置PVST+实现MS1负责转发VLAN1的数据，MS2负责转发VLAN2的数据
按照图-3所示拓扑结构，配置MS1为vlan1的主根，vlan2的次根，配置SM2位vlan1的次根，vlan2的主根
![image003 3](media/image28.png){width="2.9583333333333335in"
height="1.9416666666666667in"}
图-3
3.2 步骤
1，在所有交换机中创建vlan2
Switch(config)#vlan 2
2，将拓扑中所有交换机之间都配置为中继链路
MS1
Switch(config)#interface range fastEthernet 0/1-3
Switch(config-if-range)#switchport trunk encapsulation dot1q
Switch(config-if-range)#switchport mode trunk
MS2
Switch(config)#interface range fastEthernet 0/1-3
Switch(config-if-range)#switchport trunk encapsulation dot1q
Switch(config-if-range)#switchport mode trunk
Switch1
Switch(config)#interface range fastEthernet 0/1-2
Switch(config-if-range)#switchport mode trunk
Switch2
Switch(config)#interface range fastEthernet 0/1-2
Switch(config-if-range)#switchport mode trunk
3，在MS1中配置
Switch(config)#spanning-tree vlan 1 root primary
Switch(config)#spanning-tree vlan 2 root secondary
4，在MS2中配置
Switch(config)#spanning-tree vlan 2 root primary
Switch(config)#spanning-tree vlan 1 root secondary
## 4 案例4：三层交换配置HSRP
4.1 问题
按照图-4所示拓扑结构，在三层交换机配置热备份路由协议使组内两个出口设备共享一个虚拟ip地址192.168.1.254为内网主机的网关
![image004 2](media/image30.png){width="4.617361111111111in"
height="2.566666666666667in"}
图-4
4.2 步骤
本实验暂不考虑NAT问题。
1，为所有pc设备配置ip与网关，内网主机网关为192.168.1.254
外网主机网关为192.168.4.1
2，为所有网络设备配置接口的ip地址
路由器
Router(config)#interface gigabitEthernet 0/0
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#no shutdown
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#ip address 192.168.3.1 255.255.255.0
Router(config-if)#no shutdown
Router(config)#interface gigabitEthernet 0/2
Router(config-if)#ip address 192.168.4.1 255.255.255.0
Router(config-if)#no shutdown
MS1
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#no switchport
Switch(config-if)#ip address 192.168.2.2 255.255.255.0
Switch(config)#interface vlan 1
Switch(config-if)#ip address 192.168.1.252 255.255.255.0
Switch(config-if)#no shutdown
MS2
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#no switchport
Switch(config-if)#ip address 192.168.3.2 255.255.255.0
Switch(config)#interface vlan 1
Switch(config-if)#ip address 192.168.1.253 255.255.255.0
Switch(config-if)#no shutdown
3，配置动态路由技术使全网互通
路由器
Router(config)#router ospf 1
Router(config-router)#network 192.168.4.0 0.0.0.255 area 0
Router(config-router)#network 192.168.3.0 0.0.0.255 area 0
Router(config-router)#network 192.168.2.0 0.0.0.255 area 0
MS1
Switch(config)#ip routing
Switch(config)#router ospf 1
Switch(config-router)#network 192.168.1.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.2.0 0.0.0.255 area 0
MS2
Switch(config)#ip routing
Switch(config)#router ospf 1
Switch(config-router)#network 192.168.1.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.3.0 0.0.0.255 area 0
此时可以让服务器的网关临时设置为192.168.1.252，检测网络是否联通。
4，配置HSRP
MS1
Switch(config)#interface vlan 1
Switch(config-if)#standby 1 ip 192.168.1.254
MS2
Switch(config)#interface vlan 1
Switch(config-if)#standby 1 ip 192.168.1.254
HSRP配置好后将服务器的网关设置为192.168.1.254，检测网络状态。
## 5 案例5：完善网络负载均衡
5.1 问题
通过之前配置的STP加上HSRP完善网络的负载均衡功能。
按照图-5所示拓扑结构，配置MS1为vlan1的活跃路由器、vlan2的备份路由器，MS为vlan1的备份路由器、vlan2的备份路由器，实现负载均衡的效果
![image005](media/image33.png){width="4.617361111111111in"
height="2.0416666666666665in"}
图-5
5.2 步骤
注意：此实验需要在 练习3 的基础之上进行配置
1，先配置两台三层交换机的ip地址
MS1
Switch(config)#interface vlan 1
Switch(config-if)#ip address 192.168.1.252 255.255.255.0
Switch(config-if)#no shutdown
Switch(config)#interface vlan 2
Switch(config-if)#ip address 192.168.2.252 255.255.255.0
MS2
Switch(config)#interface vlan 1
Switch(config-if)#ip address 192.168.1.253 255.255.255.0
Switch(config-if)#no shutdown
Switch(config)#interface vlan 2
Switch(config-if)#ip address 192.168.2.253 255.255.255.0
2，开启热备份功能
MS1
Switch(config)#interface vlan 1
Switch(config-if)#standby 1 ip 192.168.1.254
Switch(config-if)#standby 1 priority 105
Switch(config-if)#standby 1 preempt