SW-3L(config)#interface f0/24
SW-3L(config-if)#switchport trunk encapsulation dot1q \-\--先封装
SW-3L(config-if)#switchport mode trunk \-\-\--在配trunk
SW-3L (config-if)#no shutdown
二层交换机配置
SW-2L(config)#interface f0/24
SW-2L(config-if)#switchport mode trunk \-\--直接配trunk
SW-2L(config)#interface f0/2
SW-2L(config-if)#switchport accescc vlan 2
SW-2L(config)#interface f0/2
SW-2L(config-if)#switchport accescc vlan 3
新增192.168.5.0 模仿外网
三层交换的f0/23物理端口上配置一个地址：192.168.4.1有两种方法
第一种：新建一个vlanA 将f0/23划入vlanA 再给vlanA配置IP192.168.4.1
第二种：取消三层交换f0/23口的交换端口，转换为路由接口no switchport
SW-3L(config)#interface f0/23
SW-3L(config-if)#no switchport
SW-3L(config-if)#ip address 192.168.4.1 255.255.255.0
SW-3L(config-if)#no shutdown
路由配置：给两个端口配好相应的IP之后，添加路由表
Router(config)#ip route 192.168.1.0 255.255.255.0 192.168.4.1
Router(config)#ip route 192.168.2.0 255.255.255.0 192.168.4.1
Router(config)#ip route 192.168.3.0 255.255.255.0 192.168.4.1
默认路由：是一种特殊的静态路由，可以达到允许设备访问任意网段的效果
给三层交换配置默认路由，下一跳为192.168.4.2
SW-3L(config)#ip route 0.0.0.0 0.0.0.0 192.168.4.2
路由环路：默认路由应一致对外，一外一内，将形成路由环路，
动态路由：基于某种动态路由协议的配置，可以自动学习路由条目。
Ospf：开放式最短路径优先，适合大中型网络使用，
对外宣告自己的直连路由，
SW-3L(config)#router ospf 1 \-\-\-\-\-\-\-\-\-\--开启ospf ，1为进程号
SW-3L(config-router)#network 192.168.1.0 0.0.0.255 area 0 \-\--0.0.0.255
为反掩码
\-\--area 0 所有设备宣告的都是0区域，ospf区域以0开始
SW-3L(config-router)#network 192.168.2.0 0.0.0.255 area 0
SW-3L(config-router)#network 192.168.3.0 0.0.0.255 area 0
SW-3L(config-router)#network 192.168.4.0 0.0.0.255 area 0
路由器上配置动态ospf路由
Router(config)#router ospf 1
Router(config-router)#network 192.168.4.0 0.0.0.255 area 0
Router#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B -
BGP
D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
\* - candidate default, U - per-user static route, o - ODR
P - periodic downloaded static route
Gateway of last resort is not set
O 192.168.1.0/24 \[110/2\] via 192.168.4.1, 00:01:01, GigabitEthernet0/0
O 192.168.2.0/24 \[110/2\] via 192.168.4.1, 00:01:01, GigabitEthernet0/0
O 192.168.3.0/24 \[110/2\] via 192.168.4.1, 00:01:01, GigabitEthernet0/0
192.168.4.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.4.0/24 is directly connected, GigabitEthernet0/0
L 192.168.4.2/32 is directly connected, GigabitEthernet0/0
192.168.5.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.5.0/24 is directly connected, GigabitEthernet0/1
L 192.168.5.254/32 is directly connected, GigabitEthernet0/1
Router#
案例1：配置静态路由
案例2：配置多路由环境网络
案例3：三层交换机基本配置
案例4：三层交换机实现VLAN互通
案例5：搭建小型办公网络
案例6：动态路由
## 1 案例1：配置静态路由
1.1 问题
按照图-1的拓扑结构配置接口ip地址并通过静态路由实现全网互通
![image001 2](media/image14.png){width="4.184027777777778in"
height="2.1166666666666667in"}
图-1
1.2 步骤
R1配置
Router\>enable
Router#configure terminal
Router(config)#interface gigabitEthernet 0/0
Router(config-if)#ip address 192.168.1.254 255.255.255.0 //配置ip地址
Router(config-if)#no shutdown //开启接口
Router(config-if)#exit
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#ip route 192.168.3.0 255.255.255.0 192.168.2.2
//配置静态路由
R2配置
Router\>enable
Router#configure terminal
Router(config)#interface gigabitEthernet 0/0
Router(config-if)#ip address 192.168.3.254 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#ip address 192.168.2.2 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#ip route 192.168.1.0 255.255.255.0 192.168.2.1
## 2 案例2：配置多路由环境网络
2.1 问题
按照图-2拓扑结构配置接口ip地址并通过静态路由实现全网互通
![image002](media/image15.png){width="4.617361111111111in"
height="1.7416666666666667in"}
图-2
2.2 步骤
注：以下配置需要在案例1的基础上完成
R1配置
Router(config)#ip route 192.168.4.0 255.255.255.0 192.168.2.2
Router(config)#ip route 192.168.5.0 255.255.255.0 192.168.2.2
R2配置
Router(config)#interface gigabitEthernet 0/2
Router(config-if)#ip address 192.168.4.1 255.255.255.0
Router(config-if)#no shutdown
Router(config)#ip route 192.168.5.0 255.255.255.0 192.168.4.2
R3配置
Router\>enable
Router#configure terminal
Router(config)#interface gigabitEthernet 0/0
Router(config-if)#ip address 192.168.5.254 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#ip address 192.168.4.2 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#ip route 192.168.1.0 255.255.255.0 192.168.4.1
Router(config)#ip route 192.168.2.0 255.255.255.0 192.168.4.1
Router(config)#ip route 192.168.3.0 255.255.255.0 192.168.4.1
3
## 4 案例3：三层交换机基本配置
4.1 问题
按照图-3的拓扑结构配置ip地址并通过三层交换实现VLAN间通信
![image003 2](media/image16.png){width="4.492361111111111in"
height="2.566666666666667in"}
图-3
4.2 步骤
三层交换机配置
Switch\>enable
Switch#configure terminal
Switch(config)#interface vlan 1
Switch(config-if)#ip address 192.168.1.254 255.255.255.0
Switch(config-if)#no shutdown
Switch(config-if)#vlan 2
Switch(config-vlan)#vlan 3
Switch(config-vlan)#exit
Switch(config)#interface vlan 2
Switch(config-if)#ip address 192.168.2.254 255.255.255.0
Switch(config-vlan)#exit
Switch(config)#interface vlan 3
Switch(config-if)#ip address 192.168.3.254 255.255.255.0
Switch(config-vlan)#exit
Switch(config)#ip routing //开启路由功能
Switch(config)#interface fastEthernet 0/2
Switch(config-if)#switchport access vlan 2 //将f0/2接口加入vlan2
Switch(config-if)#interface fastEthernet 0/3
Switch(config-if)#switchport access vlan 3
## 5 案例4：三层交换机实现VLAN互通
5.1 问题
按照图-5拓扑图配置ip地址并实现vlan间通信，二层交换机与三层交换机之间只有一条链路，为了在一条链路中传递不同VLAN的数据，需要将这条链路配置为TRUNK
![image004 2](media/image17.png){width="3.325in"
height="2.1083333333333334in"}
图-4
5.2 步骤
注：以下配置需要在案例3的基础上完成
三层交换机配置
Switch(config)#interface fastEthernet 0/24
Switch(config-if)#switchport trunk encapsulation dot1q //打封装
Switch(config-if)#switchport mode trunk //配置中继链路
二层交换机配置
Switch\>enable
Switch#configure terminal
Switch(config)#interface fastEthernet 0/2
Switch(config-if-range)#switchport access vlan 2
Switch(config-if-range)#exit
Switch(config)#interface fastEthernet 0/3
Switch(config-if-range)#switchport access vlan 3
Switch(config)#interface fastEthernet 0/24
Switch(config-if)#switchport mode trunk
## 6 案例5：搭建小型办公网络
6.1 问题
按照图-5规划配置实现全网互通
这里的192.168.5.0网段模拟为外网网段，需要使用默认路由才能到达。
![image005](media/image18.png){width="4.617361111111111in"
height="1.975in"}
图-5
6.2 步骤
注：以下配置需要在案例4的基础上完成
三层交换机配置
Switch(config)#interface fastEthernet 0/23
Switch(config-if)#no switchport
Switch(config-if)#ip address 192.168.4.1 255.255.255.0
Switch(config-if)#exit
Switch(config)#ip route 0.0.0.0 0.0.0.0 192.168.4.2
//配置默认路由前往外网
路由器配置
Router\>enable
Router#configure terminal
Router(config)#interface gigabitEthernet 0/0
Router(config-if)#ip address 192.168.4.2 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#ip address 192.168.5.254 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#ip route 192.168.1.0 255.255.255.0 192.168.4.1
Router(config)#ip route 192.168.2.0 255.255.255.0 192.168.4.1
Router(config)#ip route 192.168.3.0 255.255.255.0 192.168.4.1
## 7 案例6：动态路由
7.1 问题
通过配置静态路由协议ospf实现全网互通，可以先将静态路由删除
![image006](media/image18.png){width="4.617361111111111in"
height="1.975in"}
图-6
7.2 步骤
注：以下配置需要在案例5的基础上完成
三层交换机配置
Switch(config)#router ospf 1
Switch(config-router)#network 192.168.1.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.2.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.3.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.4.0 0.0.0.255 area 0
路由器配置
Router(config)#no ip route 192.168.1.0 255.255.255.0 192.168.4.1
Router(config)#no ip route 192.168.2.0 255.255.255.0 192.168.4.1
Router(config)#no ip route 192.168.3.0 255.255.255.0 192.168.4.1
Router(config)#router ospf 1
Router(config-router)#network 192.168.4.0 0.0.0.255 area 0
# NSD PROJECT1 DAY04
## 传输成协议TCP/udp
![C:\\Users\\Administrator\\Desktop\\tu\\LINUXNSD_V01PROJECT1DAY04_006.png](media/image19.png){width="5.792361111111111in"
height="3.4520833333333334in"}
## TCP封装格式
![C:\\Users\\Administrator\\Desktop\\tu\\LINUXNSD_V01PROJECT1DAY04_008.png](media/image20.png){width="5.763194444444444in"
height="3.3291666666666666in"}
TCP的面向连接过程，TCP的连接---三次握手
SYN作用：想与对方建立连接 FINF作用：想与对方断开连接
ACK作用：确认对方信息