Switch(config)#interface vlan 2
Switch(config-if)#standby 2 ip 192.168.2.254
MS2
Switch(config)#interface vlan 1
Switch(config-if)#standby 1 ip 192.168.1.254
Switch(config)#interface vlan 2
Switch(config-if)#standby 2 ip 192.168.2.254
Switch(config-if)#standby 2 priority 105
Switch(config-if)#standby 2 preempt
# NSD PROJECT1 DAY06
## Vlan ：
虚拟局域网，是物理设备上连接的不受物理位置限制的用户的一个逻辑组。
Vlan的作用：广播控制 增加安全性 提高宽带利用 降低延迟
## Trunk 中继链路，
承载多个Vlan
text1(config)#interface f0/7
text1(config-if)#switchport mode trunk
## VLAN标识种类
以太网实现中继可用两种封装类型1、ISL(Cisco 私有协议) 2、IEEE 802.1Q
以太通道：也称为接口捆绑、以太链路聚集，提高更高的带宽和可靠性
test1(config)#interface range f0/1-2
test1(config-if-range)#channel-group 1 mode on
test2(config)#interface range f0/1-2
test2(config-if-range)#channel-group 1 mode on
test1#show running-config \-\--查看配置记录
test1#show etherchannel summary \-\--专门查看以太通道配置
## S 静态路由，
由管理员手动配置，要实现数据互通，需要配置来回两个方向，否则有去无回。
Router(config)#ip route 192.168.3.0 255.255.255.0 192.168.2.2
Router(config)#ip route 192.168.1.0 255.255.255.0 192.168.2.1
## 默认路由：
是一种特殊的静态路由，可以达到允许设备访问任意网段的效果
给三层交换配置默认路由，下一跳为192.168.4.2
SW-3L(config)#ip route 0.0.0.0 0.0.0.0 192.168.4.2
## 路由环路：
默认路由应一致对外，一外一内，将形成路由环路，
## 动态路由：
基于某种动态路由协议的配置，可以自动学习路由条目。
## O Ospf：
开放式最短路径优先，适合大中型网络使用，
对外宣告自己的直连路由，
SW-3L(config)#router ospf 1 \-\-\-\-\-\-\-\-\-\--开启ospf ，1为进程号
SW-3L(config-router)#network 192.168.1.0 0.0.0.255 area 0 \-\--0.0.0.255
为反掩码
\--area 0 所有设备宣告的都是0区域，ospf区域以0开始
SW-3L(config-router)#network 192.168.2.0 0.0.0.255 area 0
SW-3L(config-router)#network 192.168.3.0 0.0.0.255 area 0
SW-3L(config-router)#network 192.168.4.0 0.0.0.255 area 0
STP、PVST+ 配置PVST+实现负载均衡 PVST+:每Vlan 生成树 STP:生成树协议
Ms1 使MS1成为vlan1的主根，vlan2的次根
Switch(config)#spanning-tree vlan 1 root primary
Switch(config)#spanning-tree vlan 2 root secondary
Switch#show spanning-tree vlan 1
Ms2 使MS2成为vlan2的主根，vlan1的次根
Switch(config)#spanning-tree vlan 1 root secondary
Switch(config)#spanning-tree vlan 2 root primary
Switch#show spanning-tree vlan 1
给Switch1与switch2配上vlan2则所有灯会亮绿
## HSRP:
热备份路由选择协议，由虚拟路由器来分配走哪路路由,
活跃路由器与备份路由器由人工指定，必须进入vlan接口模式中，必须有两台设备成一个组
Group-numberip(HSRP备份组号) virtual-ip-address（备份组虚拟IP地址）
Switch(config-if)#standby group-numberip virtual-ip-address
\-\--配置HSRP的成员
例如：Switch(config-if)#standby 1 ip 192.168.1.254
Switch(config-if)#standby group-number priority-value
\--配置HSRP的优先级
priority-value的范围0\~255，默认为100
Switch#show standby brief \-\-\-\--查看HSRP摘要信息
Switch(config-if)#standby group-number preempt \-\-\-\--HSRP占先权配置
交换机MS1配置HSRP
Switch(config)#int vlan 1
Switch(config-if)#standby 1 ip 192.168.1.254
交换机MS2配置HSRP
Switch(config)#int vlan 1
Switch(config-if)#standby 1 ip 192.168.1.254
在MS2中修改优先级，配置占先权，是自己立即成为活跃
Switch(config-if)#standby 1 priority 105 \--修改优先级为105
Switch(config-if)#standby 1 preempt \-\--配置占先权
静态NAT配置步骤：
接口IP地址配置，决定需要转换的主机地址，决定采用什么公有地址，在内部和外部接口上启用NAT
Router(config)#ip nat inside source static local-ip global-ip
Router(config)#ip nat inside source static 192.168.1.1 100.0.0.2
配置静态IP
Router(config)#int g0/0
Router(config-if)#ip nat inside 进入g0/0 设置为nat 进口
Router(config-if)#int g0/1
Router(config-if)#ip nat outside 进入g0/1 设置为nat 出口
Router(config)#ip nat inside source static 192.168.1.2 100.0.0.3
再设置1.2地址，进出口不需再配进出口
Router#debug ip nat //开启NAT检测功能，
IP NAT debugging is on
Router#undebug ip nat //关闭NAT检测功能
## 以太通道：
也称为接口捆绑、以太链路聚集，提高更高的带宽和可靠性
每台二层交换的1-2口捆绑为1,3-4口捆绑为2
SW4(config)#int range f0/1-2
SW4(config-if-range)#channel-group 1 mode on
Creating a port-channel interface Port-channel 1
SW4(config-if-range)#int range f0/3-4
SW4(config-if-range)#channel-group 2 mode on
Creating a port-channel interface Port-channel 2
SW4#show etherchannel summary \-\-\--查看以太通道
1 Po1(SD) - Fa0/1(D) Fa0/2(D)
2 Po2(SD) - Fa0/3(D) Fa0/4(D)
Trunk:中继链路，承载多个Vlan
所有二层交换的以太通道组配置trunk
SW4(config)#int port-channel 1
SW4(config-if)#switchport mode trunk
SW4(config-if)#int port-channel 2
SW4(config-if)#switchport mode trunk
所有三层交换机两两配置以太通道，并配置trunk
MS2(config)#int range f0/9-10
MS2(config-if-range)#channel-group 5 mode on
MS2(config)#int port-channel 5
MS2(config-if)#switchport trunk encapsulation dot1q
MS2(config-if)#switchport mode trunk
配置好相应的IP地址。
配置STP、PVST+，优化网络使
MS1#reload \-\-\-\-\--重启设备
MS1#show spanning-tree vlan 10
Po1 Desg FWD 9 128.27 Shr
Po3 Desg FWD 9 128.29 Shr
Po2 Root FWD 9 128.28 Shr
Po4 Desg FWD 9 128.30 Shr
Po5 Altn BLK 9 128.31 Shr
MS2配置：使vlan10/vlan20为主根，vlan30/vlan40为次根
MS1(config)#spanning-tree vlan 10 root primary
MS1(config)#spanning-tree vlan 20 root primary
MS1(config)#spanning-tree vlan 30 root secondary
MS1(config)#spanning-tree vlan 40 root secondary
MS2配置：使vlan30/vlan40为主根，vlan10/vlan20为次根
MS2(config)#spanning-tree vlan 10 root secondary
MS2(config)#spanning-tree vlan 20 root secondary
MS2(config)#spanning-tree vlan 30 root primary
MS2(config)#spanning-tree vlan 40 root primary
HSRP:热备份路由选择协议，由虚拟路由器来分配走哪路路由,
活跃路由器与备份路由器
MS1配置HSRP
MS1(config)#int vlan 10
MS1(config-if)#standby 10 ip 192.168.10.254
MS1(config-if)#standby 10 priority 105
MS1(config-if)#standby 10 preempt
MS1(config-if)#int vlan 20
MS1(config-if)#standby 20 ip 192.168.20.254
MS1(config-if)#standby 20 priority 105
MS1(config-if)#standby 20 preempt
MS1(config-if)#int vlan 30
MS1(config-if)#standby 30 ip 192.168.30.254
MS1(config-if)#int vlan 40
MS1(config-if)#standby 40 ip 192.168.40.254
MS2配置HSRP
MS2(config)#int vlan 10
MS2(config-if)#standby 10 ip 192.168.10.254
MS2(config-if)#int vlan 20
MS2(config-if)#standby 20 ip 192.168.20.254
MS2(config-if)#int vlan 30
MS2(config-if)#standby 30 ip 192.168.20.254
MS2(config-if)#standby 30 priority 105
MS2(config-if)#standby 30 preempt
MS2(config-if)#int vlan 40
MS2(config-if)#standby 40 ip 192.168.40.254
MS2(config-if)#standby 40 priority 105
MS2(config-if)#standby 40 preempt
MS1(config)#line console 0
MS1(config-line)#logging synchronou \-\-\--弹出状态改变,不打断命令输入
MS（config-line)#exec-timeout 0 30 \-\-\--设置0分30秒之后琐住配置终端
动态路由：基于某种动态路由协议的配置，可以自动学习路由条目。
OSPF开放式最短路径优先，适合大中型网络使用，
MS1配置动态路由OSPF
MS1(config)#router ospf 1
MS1(config-router)#network 192.168.10.0 0.0.0.255 area 0
MS1(config-router)#network 192.168.20.0 0.0.0.255 area 0
MS1(config-router)#network 192.168.30.0 0.0.0.255 area 0
MS1(config-router)#network 192.168.40.0 0.0.0.255 area 0
MS1(config-router)#network 192.168.50.0 0.0.0.255 area 0
MS1(config-router)#network 192.168.60.0 0.0.0.255 area 0
MS2配置动态路由OSPF
MS2(config)#router ospf 1
MS2(config-router)#network 192.168.10.0 0.0.0.255 area 0
MS2(config-router)#network 192.168.20.0 0.0.0.255 area 0
MS2(config-router)#network 192.168.30.0 0.0.0.255 area 0
MS2(config-router)#network 192.168.40.0 0.0.0.255 area 0
MS2(config-router)#network 192.168.70.0 0.0.0.255 area 0
MS2(config-router)#network 192.168.80.0 0.0.0.255 area 0
R1配置动态路由OSPF
R1(config)#router ospf 1
R1(config-router)#network 192.168.50.0 0.0.0.255 area 0
R1(config-router)#network 192.168.70.0 0.0.0.255 area 0
R2配置动态路由OSPF
R2(config)#router ospf 1
R2(config-router)#network 192.168.60.0 255.255.255.0 area 0
R2(config-router)#network 192.168.80.0 255.255.255.0 area 0
R1配置静态（默认）路由，并宣告
R1(config)#ip route 0.0.0.0 0.0.0.0 100.0.0.10
R1(config)#router ospf 1
R1(config-router)#default-information originate \--宣告自己有默认路由
R2配置静态（默认）路由，并宣告
R2(config)#ip route 0.0.0.0 0.0.0.0 100.0.0.10
R2(config)#router ospf 1
R2(config-router)#default-information originate \--宣告自己有默认路由
此时三层交换将会学习到静态路由
## NAT
静态转换：一对一的转换，一般用在服务器发布服务到公网
端口多路复用 （PAT）：一对多，员工主机访问公网
静态NAT配置：接口IP地址配置，决定需要转换的主机地址，决定采用什么公有地址，在内部和外部接口上启用NAT
R1上配置静态NAT：
R1(config)#ip nat inside source static 192.168.40.1 100.0.0.3
R1(config)#int g0/1
R1(config-if)#ip nat inside
R1(config-if)#int g0/2
R1(config-if)#ip nat outside
R2上配置静态NAT：
R2(config)#ip nat inside source static 192.168.40.1 100.0.0.3
R2(config)#int g0/1
R2(config-if)#ip nat inside
R2(config-if)#int g0/2
R2(config-if)#ip nat outside
案例1：配置目前网络环境
案例2：网络升级
实现此案例需要按照如下步骤进行
## 1 案例1：配置目前网络环境
1.1 问题
一家新创建的IT公司，公司位于北京有80多台服务器
目前网络环境使用技术，通过端口映射技术将web服务器发布给Internet：
三层交换：汇聚接入层交换机
默认路由：实现到互联网数以万计网络访问的简化配置
静态路由：实现公司内部网络互通
NAT端口映射：实现企业内部Web服务器的发布
1.2 方案
通过端口映射技术将web服务器发布给Internet，公司现有网络环境拓扑如图-1所
![image001](media/image34.png){width="4.617361111111111in"
height="2.691666666666667in"}
图-1
## 2 案例2：网络升级
2.1 问题