![C:\\Users\\Administrator\\Desktop\\tu\\LINUXNSD_V01PROJECT1DAY04_009.png](media/image21.png){width="5.763194444444444in"
height="2.5277777777777777in"}
![C:\\Users\\Administrator\\Desktop\\tu\\LINUXNSD_V01PROJECT1DAY04_010.png](media/image22.png){width="5.761805555555555in"
height="2.395138888888889in"}
telnet远程全是明文传输，SSH是密文
UDP
## ACL
![C:\\Users\\Administrator\\Desktop\\tu\\LINUXNSD_V01PROJECT1DAY04_018.png](media/image23.png){width="5.763194444444444in"
height="3.4805555555555556in"}
![C:\\Users\\Administrator\\Desktop\\tu\\LINUXNSD_V01PROJECT1DAY01_028.png](media/image1.png){width="5.763194444444444in"
height="3.8201388888888888in"}
标准访问控制列表：基于源IP地址过滤数据包
标准访问控制列表控制列表号是1\~99
创建ACL：
R1(config)#access-list access-list-number { permit(允许) \| deny(拒绝)
}source \[source-wildcard\]
例：R1(config)#access-list 1 permit 192.168.1.0 0.0.0.255
\-\--允许.1的网段通过
R1(config)#access-list 1 permit 192.168.2.2 0.0.0.0 \-\--允许主机2.2通过
R1(config)#access-list 1 deny 192.168.2.3 0.0.0.0 \-\--拒绝主机2.3
反掩码：0匹配，1是不匹配
192.168.1.0 0.0.0.255 即精确匹配前面192.168.1.
192.168.2.2 0.0.0.0 即精确匹配所有192.168.2.2
![C:\\Users\\Administrator\\Desktop\\tu\\image001.png](media/image24.png){width="4.613194444444445in"
height="1.7548611111111112in"}
1全网已经连通状态，192.168.1.0 与 192.168.2.0网络互通
2禁止192.168.2.1通过路由
Router(config)#access-list 1 deny 192.168.2.1 0.0.0.0
Router(config)#int g0/1 \--进入1口将access 放入1口
Router(config-if)#ip access-group 1 in \-\--将access放入1口的进方向
Router(config)#access-list 1 permit any \-\--配置list1其他所有允许通过
Router#show access-lists \-\-\--查看acl配置情况
Standard IP access list 1
> 10 deny host 192.168.2.1 (1 match(es))
>
> 20 permit any
10
20表示步长，方便插队，例如增条一条2.2禁止通过，可插在10之后20之前，否则直接匹配到20则停止。写错了要删除重新写，
Router(config)#no access-list 1 deny 192.168.2.1 0.0.0.0上下一样的效果
Router(config)#no access-list 1 deny host 192.168.2.1 上下一样的效果
扩展访问控制列表：基于源IP地址、目的IP地址、指定协议、端口过滤数据包
标准访问控制列表控制列表号是100\~199
创建ACL：
R1(config)#access-list access-list-number { permit(允许) \| deny(拒绝) }
protocol { source source-wildcard destination destination-wildcard} \[
operator operan \]
例如：R1(config)#access-list 101 deny tcp 192.168.1.0 0.0.0.255 host
192.168.2.2 eq 80
R1(config)#access-list 101 permit ip any any
![C:\\Users\\Administrator\\Desktop\\tu\\image001.png](media/image24.png){width="4.613194444444445in"
height="1.7548611111111112in"}
1全网已经连通状态，192.168.1.0 与 192.168.2.0网络互通
2禁止PC2访问PC1的ftp服务，禁止PC3访问PC1的www服务，
Router(config)#access-list 100 deny tcp host 192.168.2.1 host
192.168.1.1 eq 21
Router(config)#access-list 100 deny tcp host 192.168.2.1 host
192.168.1.1 eq 21
Router(config)#access-list 100 deny tcp host 192.168.2.2 host
192.168.1.1 eq 80
Router(config)#access-list 100 permit ip any any
## 私有IP地址分类：
A类：10.0.0.0 \~ 10.255.255.255 A类：1\~127
B类：172.16.0.0 \~ 172.31.255.255 B类：129\~191
C类：192.168.0.0 \~ 192.168.255.255 C类：192\~223
D类：224\~239 组播
E类：240\~254 科研
## NAT
Net优点：节约公有IP、处理地址重叠、安全
Net 缺点：延迟增大、配置和维护的复杂性。
Net实现方式：
静态转换，一对一的转换，一般用在服务器发布服务到公网
端口多路复用 （PAT），一对多，员工主机访问公网
**静态NAT配置步骤：**
接口IP地址配置，决定需要转换的主机地址，决定采用什么公有地址，在内部和外部接口上启用NAT
Router(config)#ip nat inside source static local-ip global-ip
![C:\\Users\\Administrator\\Desktop\\tu\\image004.png](media/image25.png){width="3.6006944444444446in"
height="1.6881944444444446in"}
1.  环境准备PC3 不配置网关，PC3与PC1\\PC2 都不通
2.  配置静态NET 192.168.1.1转换成100.0.0.2
> 192.168.1.2 转换成100.0.0.3
Router(config)#ip nat inside source static 192.168.1.1 100.0.0.2
配置静态IP
Router(config)#int g0/0
Router(config-if)#ip nat inside 进入g0/0 设置为nat 进口
Router(config-if)#int g0/1
Router(config-if)#ip nat outside 进入g0/1 设置为nat 出口
Router(config)#ip nat inside source static 192.168.1.2 100.0.0.3
> 再设置1.2地址，进出口不需再配进出口
Router#debug ip nat //开启NAT检测功能，
IP NAT debugging is on
Router#undebug ip nat //关闭NAT检测功能
IP NAT debugging is off
最终结果：此时 PC1、PC2能访问PC3，PC3只能访问100.0.0.2与100.0.0.3
端口映射:与静态相似，绑了80就只能访问80的服务，等于只发布了用80端口的服务
Router(config)#ip nat inside source static tcp 192.168.1.1 80 100.0.0.2
8080
此条作用：可更改对外发布服务的端口号、限制对外发布服务的数量
Router(config)#ip nat inside source static tcp 192.168.1.1 80 100.0.0.2
80
此条作用：web任意访问100.0.0.2
**PAT端口多路复用转换步骤**
1.  配置ACL 限制允许访问外网的
2.  配置PAT
![C:\\Users\\Administrator\\Desktop\\tu\\image004.png](media/image25.png){width="3.6006944444444446in"
height="1.6881944444444446in"}
设置192.168.1.0 段的网络转换成100.0.0.1的地址去访问
配置
Router(config)#access-list 1 permit 192.168.1.0 0.0.0.255
Router(config)#ip nat inside source list 1 interface g0/1 overload
PAT 访问出去之后才会产生随机端口号，仅仅适合访问公网
案例1：标准ACL的配置（1）
案例2：标准ACL的配置（2）
案例3：扩展访问控制列表
案例4：配置静态NAT
案例5：端口映射
案例6：端口多路复用
## 1 案例1：标准ACL的配置（1）
1.1 问题
按照图-1所示拓扑结构，禁止主机pc2与pc1通信，而允许所有其他流量
![image001](media/image24.png){width="4.617361111111111in"
height="1.7583333333333333in"}
图-1
1.2 步骤
1，为路由器g0/0接口配置ip 192.168.1.254，为路由器g0/1接口配置ip
192.168.2.254
Router(config)#interface gigabitEthernet 0/0
Router(config-if)#ip address 192.168.1.254 255.255.255.0
Router(config-if)#no shut
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#ip address 192.168.2.254 255.255.255.0
Router(config-if)#no shut
2，为每台pc配置ip与网关
3，使用标准acl限制pc2
Router(config)#access-list 1 deny 192.168.2.1 0.0.0.0
或
Router(config)#access-list 1 deny host 192.168.2.1
以上两条配置其中一条即可，效果相同。
4，放行其他数据
Router(config)#access-list 1 permit any
5，在接口中应用acl
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#ip access-group 1 in
## 2 案例2：标准ACL的配置（2）
2.1 问题
按照图-2所示拓扑结构，允许主机pc2与pc1互通，而禁止其他设备访问pc1
![image002](media/image24.png){width="4.617361111111111in"
height="1.7583333333333333in"}
图-2
2.2 步骤
注：此配置需要在案例1的基础上完成
Router(config)#no access-list 1
Router(config)#access-list 1 permit 192.168.2.1 0.0.0.0
或
Router(config)#access-list 1 permit host 192.168.2.1
以上两条配置其中一条即可，效果相同。
## 3 案例3：扩展访问控制列表
3.1 问题
按照图-3所示拓扑结构，禁止pc2访问pc1的ftp服务，禁止pc3访问pc1的www服务，所有主机的其他服务不受限制
![image003 3](media/image24.png){width="4.617361111111111in"
height="1.7583333333333333in"}
图-3
3.2 步骤
注：此配置需要在案例2的基础上完成
Router(config)#no access-list 1
Router(config)#access-list 100 deny tcp host 192.168.2.1 host
192.168.1.1 eq 21
Router(config)#access-list 100 deny tcp host 192.168.2.2 host
192.168.1.1 eq 80
Router(config)#access-list 100 permit ip any any
在接口中应用acl
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#ip access-group 100 in
4 案例4：配置静态NAT
4.1 问题
按照图-4拓扑图所示，在R1上配置静态NAT使192.168.1.1转换为100.0.0.2,192.168.1.2转换为100.0.0.3，实现外部网络访问
![image004 2](media/image25.png){width="3.6in"
height="2.3333333333333335in"}
图-4
4.2 步骤
1，首先配置路由器的接口地址
Router(config)#interface g0/1
Router(config-if)#ip address 100.0.0.1 255.0.0.0
Router(config-if)#no shut
Router(config)#interface g0/0
Router(config-if)#ip address 192.168.1.254 255.255.255.0
Router(config-if)#no shut
2，配置静态nat转换
Router(config)#ip nat inside source static 192.168.1.1 100.0.0.2
Router(config)#ip nat inside source static 192.168.1.2 100.0.0.3
3，在内部和外部端口上启用NAT
Router(config)#interface g0/1
Router(config-if)#ip nat outside
Router(config)#interface g0/0
Router(config-if)#ip nat inside
4，为pc配置ip地址与网关，pc3无需配置网关
## 5 案例5：端口映射
5.1 问题
按照图-5所示拓扑结构，在R1上配置端口映射，将192.168.1.1的80端口映射为100.0.0.2的80端口，将其web服务发布到Internet。
![image005](media/image25.png){width="3.6in"
height="2.3333333333333335in"}
图-5
5.2 步骤
注：此配置需要在练习4的基础上完成
Router(config)#no ip nat inside source static 192.168.1.1 100.0.0.2
Router(config)#no ip nat inside source static 192.168.1.2 100.0.0.3
Router(config)#ip nat inside source static tcp 192.168.1.1 80 100.0.0.2
80
6 案例6：端口多路复用
6.1 问题
按照图-6所示的拓扑结构，在R1上配置PAT端口多路复用使企业内网192.168.1.0/24复用g0/1端口的ip，实现外部网络的访问
![image006](media/image25.png){width="3.6in"
height="2.3333333333333335in"}
图-6
6.2 步骤
注：此配置需要在案例5的基础上完成
Router(config)#no ip nat inside source static tcp 192.168.1.1 80
100.0.0.2 80
使用acl定义内部ip地址
Router(config)#access-list 1 permit 192.168.1.0 0.0.0.255
使用pat复用外网接口地址
Router(config)#ip nat inside source list 1 interface g0/1 overload
# NSD PROJECT1 DAY05
## 单臂路由---路由的配置
Router(config)#int g0/0
Router(config-if)#no shutdown
Router(config-if)#int g0/0.1
Router(config-subif)#encapsulation dot1Q 1
Router(config-subif)#ip address 192.168.1.254 255.255.255.0
Router(config-subif)#exit
Router(config)#interface g0/0.2
Router(config-subif)#encapsulation dot1Q 2
Router(config-subif)#ip address 192.168.2.254 255.255.255.0
Router(config-subif)#exit
=====================================================================
端口范围：0\~65535 0\~1023已被知名软件给占用，使用之后的。
## STP：
生成树协议，交换机默认打开，防止广播风暴。
Switch(config)#spanning-tree vlan 1 \-\--打开STP是基于vlan的协议
Switch(config)#no spannint-tree vlan 1 \-\--关闭STP
![C:\\Users\\Administrator\\Desktop\\tu\\LINUXNSD_V01PROJECT1DAY05_009.png](media/image26.png){width="5.763194444444444in"
height="3.5659722222222223in"}
网桥ID（BID）
网桥优先级：32768，要修改必须是4096的倍数，值越小越优先
阻塞接口：逻辑上断开环路，防止广播风暴，线路故障阻塞接口被激活，起备份线路作用
Switch#show version \-\-\--查看交换机版本，可看到MAC地址
查看根网桥，
Switch#show spanning-tree vlan 1
VLAN0001
Spanning tree enabled protocol ieee
Root ID Priority 32769 \-\-\--根网桥信息，第一名，优先级都是32768