Vlan Mac Address Type Ports
\-\-\-- \-\-\-\-\-\-\-\-\-\-- \-\-\-\-\-\-\-- \-\-\-\--
Switch#show mac-address-table
Mac Address Table
\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\--
Vlan Mac Address Type Ports
\-\-\-- \-\-\-\-\-\-\-\-\-\-- \-\-\-\-\-\-\-- \-\-\-\--
1 0060.3ea9.7ce2 DYNAMIC Fa0/1
1 0060.7003.9931 DYNAMIC Fa0/24
多台交换机的MAC学习，一个接口有多个MAC地址
Switch#show mac-address-table
Mac Address Table
\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\--
Vlan Mac Address Type Ports
\-\-\-- \-\-\-\-\-\-\-\-\-\-- \-\-\-\-\-\-\-- \-\-\-\--
1 0009.7cb2.81b7 DYNAMIC Fa0/2
1 0060.3ea9.7ce2 DYNAMIC Fa0/24
1 0060.7003.9931 DYNAMIC Fa0/24
1 00d0.d31b.0618 DYNAMIC Fa0/24
1 00e0.f73a.3c1b DYNAMIC Fa0/1
Switch#
## vlan
广播域：接收同样广播消息的节点的集合，交换机所有接口默认属于同一个广播域
Vlan
：虚拟局域网，是物理设备上连接的不受物理位置限制的用户的一个逻辑组。
Vlan的作用：广播控制 增加安全性 提高宽带利用 降低延迟
默认交换机拥有VLAN1且所有端口都在VLAN1中。
====================================================================
text1(config)#vlan 2 \-\-\-\-\-\-\-\-\--创建vlan2
text1(config-vlan)#name xiaoshou \-\-\-\-\-\-\-\-\--修改vlan2的名字
text1(config)#vlan 3 \-\-\-\-\-\-\-\-\-\--创建vlan3
text1(config-vlan)#vlan 33 \-\-\--继续在vlan3的状态里创建vlan33
text1(config-vlan)#vlan 44 \-\-\--继续在vlan33的状态里创建vlan44
text1(config-vlan)#**no** vlan 33 \-\-\--删除vlan33
text1(config)#no vlan 44 \-\-\--删除vlan44
text1(config)#interface f0/3 \-\-\--进入03端口
text1(config-if)#**switchport access vlan 2** \-\--将03端口加入vlan2
text1(config-if)#interface f0/4 \-\--在03端口下，进入04端口
text1(config-if)#switchport access vlan 2 \-\--将04加入vlan2
text1(config)#interface **range** f0/5-6 \-\--同时进入5-6口
text1(config-if-range)#switchport access vlan 3 \-\--划入vlan3
text1(config-if-range)#
text1#**show vlan brief** \-\-\-\--查看vlan摘要信息
VLAN Name Status Ports
\-\-\-- \-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\--
\-\-\-\-\-\-\-\--
\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\--
1 default active Fa0/1, Fa0/2, Fa0/7, Fa0/8
Fa0/9, Fa0/10, Fa0/11, Fa0/12
Fa0/13, Fa0/14, Fa0/15, Fa0/16
Fa0/17, Fa0/18, Fa0/19, Fa0/20
Fa0/21, Fa0/22, Fa0/23, Fa0/24
Gig0/1, Gig0/2
2 xiaoshou active Fa0/3, Fa0/4
31002 fddi-default active
1003 token-ring-default active
1004 fddinet-default active
1005 trnet-default active VLAN0003 active Fa0/5, Fa0/6
===================================================================
将端口10加入vlan33，未取消端口vlan，直接删除了vlan33,导致端口消失
test2(config)#vlan 33
test2(config-vlan)#exit
test2(config)#interface f0/10
test2(config-if)#switchport access vlan 33
test2(config-if)#exit
test2(config)#no vlan 33
test2(config)#exit
test2#
test2#show vlan brief
VLAN Name Status Ports
\-\-\-- \-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\--
\-\-\-\-\-\-\-\--
\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\-\--
1 default active Fa0/1, Fa0/2, Fa0/3, Fa0/4
Fa0/8, Fa0/9, Fa0/11, Fa0/12 \-\--此时不见了vlan10
Fa0/13, Fa0/14, Fa0/15, Fa0/16
Fa0/17, Fa0/18, Fa0/19, Fa0/20
Fa0/21, Fa0/22, Fa0/23, Fa0/24
Gig0/1, Gig0/2
3 VLAN0003 active Fa0/5, Fa0/6, Fa0/7
1002 fddi-default active
1003 token-ring-default active
1004 fddinet-default active
1005 trnet-default active
恢复方法，进入端口10，加入vlan1即可
## TRUNK
VLAN标识种类
以太网实现中继可用两种封装类型
1.  ISL(Cisco 私有协议)
![C:\\Users\\Administrator\\Desktop\\tu\\LINUXNSD_V01PROJECT1DAY02_054.png](media/image8.png){width="5.759722222222222in"
height="2.567361111111111in"}
2、IEEE 802.1Q
![C:\\Users\\Administrator\\Desktop\\tu\\LINUXNSD_V01PROJECT1DAY02_052.png](media/image9.png){width="5.759027777777778in"
height="2.7194444444444446in"}
Access 接入链路，只支持一个Vlan
Trunk 中继链路，承载多个Vlan
text1(config)#interface f0/7
text1(config-if)#switchport mode trunk
test2#show interfaces f0/7 switchport
Name: Fa0/7
Switchport: Enabled
Administrative Mode: trunk
Operational Mode: trunk
Administrative Trunking Encapsulation: dot1q
## 以太通道：
也称为接口捆绑、以太链路聚集，提高更高的带宽和可靠性
test1(config)#interface range f0/1-2
test1(config-if-range)#channel-group 1 mode on
Creating a port-channel interface Port-channel 1
%LINK-5-CHANGED: Interface Port-channel 1, changed state to up
test2(config)#interface range f0/1-2
test2(config-if-range)#channel-group 1 mode on
Creating a port-channel interface Port-channel 1
%LINK-5-CHANGED: Interface Port-channel 1, changed state to up
test1#show running-config \-\--查看配置记录
test1#show etherchannel summary \-\--专门查看以太通道配置
test1(config)#interface f0/2
test1(config-if)#shutdown
test1(config-if)#no shutdown
1 案例1：划分VLAN
2 案例2：多交换机VLAN的划分
3 案例3：配置trunk中继链路
4 案例4：以太网通道配置
## 1 1 案例1：划分VLAN
1.1 问题
在交换机上创建以下VLAN，按照拓扑图-1将端口加入到指定的VLAN并配置服务器IP地址，实现同VLAN主机的通信
![image001](media/image10.png){width="3.55in"
height="2.158333333333333in"}
图-1
1.2 步骤
由于默认情况下所有接口都在VLAN1中，且VLAN1默认就存在，所以只需要配置VLAN2和VLAN3即可。
Switch\>enable
Switch#configure terminal
Switch(config)#vlan 2 //创建VLAN2
Switch(config-vlan)#vlan 3 //创建VLAN3
Switch(config-vlan)#exit
Switch(config)#interface range fastEthernet 0/3-4 //同时进入3、4接口
Switch(config-if-range)#switchport access vlan 2 //将3、4接口加入VLAN2
Switch(config-vlan)#exit
Switch(config)#interface range fastEthernet 0/5-6
Switch(config-if-range)#switchport access vlan 3
Switch#show vlan brief
## 2 2 案例2：多交换机VLAN的划分
注：以下配置需要在案例1的基础上完成
![image002](media/image11.png){width="4.617361111111111in"
height="2.066666666666667in"}
S1配置
Switch#configure terminal
Switch(config)#interface fastethernet 0/7
Switch(config-if)#switchport access vlan 3
S2配置
Switch\>enable
Switch#configure terminal
Switch(config)#vlan 3
Switch(config-vlan)#exit
Switch(config)#interface range fastEthernet 0/5-7
Switch(config-if-range)#switchport access vlan 3
## 3 3 案例3：配置trunk中继链路
3.1 问题
通过配置实现跨交换机的同VLAN通信，如图-3所示
![image003](media/image12.png){width="4.617361111111111in"
height="1.7083333333333333in"}
图-3
3.2 步骤
注：以下配置需要在案例2的基础上完成
S1配置
Switch\>enable
Switch#configure terminal
Switch(config)#interface fastEthernet 0/7
Switch(config-if)#switchport mode trunk
S2配置
Switch\>enable
Switch#configure terminal
Switch(config)#vlan 2
Switch(config-vlan)#exit
Switch(config)#interface range fastEthernet 0/3-4
Switch(config-if-range)#switchport access vlan 2
Switch(config-if-range)#exit
Switch(config)#interface fastEthernet 0/7
Switch(config-if)#switchport mode trunk
## 4 4 案例4：以太网通道配置
4.1 问题
参照图-4将交换机的f0/7-f0/9端口配置为以太网通道
![image004](media/image13.png){width="3.808333333333333in"
height="0.9416666666666667in"}
图-4
4.2 步骤
S1配置
Switch\>enable
Switch#configure terminal
Switch(config)#interface range fastEthernet 0/7-9
Switch(config-if-range)#channel-group 1 mode on
Switch(config-if-range)#end
Switch#show etherchannel summary
S2配置
Switch\>enable
Switch#configure terminal
Switch(config)#interface range fastEthernet 0/7-9
Switch(config-if-range)#channel-group 1 mode on
Switch(config-if-range)#end
Switch#show etherchannel summary
# NSD PROJECT1 DAY03
## ICMP协议，
提供网络状态信息，ping工具使用ICMP
Router#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B -
BGP
D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
\* - candidate default, U - per-user static route, o - ODR
P - periodic downloaded static route
Gateway of last resort is not set
192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.1.0/24 is directly connected, GigabitEthernet0/0 -直连路由
L 192.168.1.254/32 is directly connected, GigabitEthernet0/0
192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.2.0/24 is directly connected, GigabitEthernet0/1 -直连路由
L 192.168.2.254/32 is directly connected, GigabitEthernet0/1
Router#
C 直连路由，产生条件是接口开启并且配置了IP地址
S
静态路由，由管理员手动配置，要实现数据互通，需要配置来回两个方向，否则有去无回。
Router(config)#ip route 192.168.3.0 255.255.255.0 192.168.2.2
Router(config)#ip route 192.168.1.0 255.255.255.0 192.168.2.1
## 三层交换实现vlan互通
路由的网关配在端口上，三层交换机的网关配置在vlan上
三层交换：
SW-3L (config)#ip routing \-\-\-\--三层交换开启路由功能
SW-3L (config)#in vlan 1 \-\--进入vlan1，下一步配置IP
SW-3L (config-if)#ip address 192.168.1.254 255.255.255.0
SW-3L (config-if)#no shutdown
SW-3L (config)#in vlan 2 \-\--进入vlan2，下一步配置IP
SW-3L (config-if)#ip address 192.168.2.254 255.255.255.0
SW-3L (config-if)#no shutdown
SW-3L (config)#in vlan 3 \-\--进入vlan3，下一步配置IP
SW-3L (config-if)#ip address 192.168.3.254 255.255.255.0
SW-3L (config-if)#no shutdown
三层交换机配trunk:先制定接口封装为802.1q