现有网络问题分析：
接入层交换机只与同一个三层交换机相连，存在单点故障而影响网络通信。
互联网连接单一服务商
现有网络需求：
随着企业发展，为了保证网络的高可用性，需要使用很多的冗余技术。
保证局域网络不会因为线路故障而导致的网络故障。
保证客户端机器不会因为使用单一网关而出现的单点失败。
保证到互联网的高可用接入使用冗余互联网连接。
提高网络链路带宽。
2.2 方案
基于项目的需求，需要用到如下技术：
STP：解决二层环路带来的广播风暴并链路冗余问题
以太网通道：提高网络链路带宽
OSPF路由协议：实现网络路径的自动学习
HSRP：实现网关冗余
重新规划后的网络拓扑如图-2：
![image002](media/image35.png){width="4.617361111111111in"
height="2.725in"}
图-2
2.3 步骤
3 实现此案例需要按照如下步骤进行
### 步骤一：二层交换机配置
分别创建VLAN10、20、30、40
sw1将f0/5接口加入vlan10
Switch(config)#interface fastEthernet 0/5
Switch(config-if)#switchport access vlan 10
sw2将f0/5接口加入vlan20
Switch(config)#interface fastEthernet 0/5
Switch(config-if)#switchport access vlan 20
sw3将f0/5接口加入vlan30
Switch(config)#interface fastEthernet 0/5
Switch(config-if)#switchport access vlan 30
sw4将f0/5接口加入vlan40
Switch(config)#interface fastEthernet 0/5
Switch(config-if)#switchport access vlan 40
每台设备捆绑以太通道，将f0/1与f0/2捆绑为通道1，f0/3与f0/4捆绑为通道2
Switch(config)#interface range f0/1-2
Switch(config-if-range)#channel-group 1 mode on
Switch(config)#interface range f0/3-4
Switch(config-if-range)#channel-group 2 mode on
查看以太通道汇总信息
Switch#show etherchannel summary
依次进入所有二层交换机的以太通道接口，配置中继链路
Switch(config)#interface port-channel 1
Switch(config-if)#switchport mode trunk
Switch(config)#interface port-channel 2
Switch(config-if)#switchport mode trunk
===============================================
### 步骤二：三层交换机基本配置
每台设备分别创建VLAN10、20、30、40
1-2口捆绑为通道1
3-4口捆绑为通道2
5-6口捆绑为通道3
7-8口捆绑为通道4
9-10口捆绑为通道5
依次进入三层交换机的4个通道接口，配置中继链路（两台三层交换机配置相同）
Switch(config)#interface port-channel 1
Switch(config-if)# switchport trunk encapsulation dot1q
Switch(config-if)#switchport mode trunk
Switch(config)#interface port-channel 2
Switch(config-if)# switchport trunk encapsulation dot1q
Switch(config-if)#switchport mode trunk
Switch(config)#interface port-channel 3
Switch(config-if)# switchport trunk encapsulation dot1q
Switch(config-if)#switchport mode trunk
Switch(config)#interface port-channel 4
Switch(config-if)# switchport trunk encapsulation dot1q
Switch(config-if)#switchport mode trunk
Switch(config)#interface port-channel 5
Switch(config-if)# switchport trunk encapsulation dot1q
Switch(config-if)#switchport mode trunk
配置三层交换机vlan10、20、30、40的ip地址
Switch(config)#interface vlan 10
Switch(config-if)#ip address 192.168.10.252 255.255.255.0
Switch(config)#interface vlan 20
Switch(config-if)#ip address 192.168.20.252 255.255.255.0
Switch(config)#interface vlan 30
Switch(config-if)#ip address 192.168.30.252 255.255.255.0
Switch(config)#interface vlan 40
Switch(config-if)#ip address 192.168.40.252 255.255.255.0
注意：另外一台三层交换机配置的ip地址是253
Switch(config)#interface vlan 10
Switch(config-if)#ip address 192.168.10.253 255.255.255.0
Switch(config)#interface vlan 20
Switch(config-if)#ip address 192.168.20.253 255.255.255.0
Switch(config)#interface vlan 30
Switch(config-if)#ip address 192.168.30.253 255.255.255.0
Switch(config)#interface vlan 40
Switch(config-if)#ip address 192.168.40.253 255.255.255.0
===========================================================
### 步骤三：三层交换机高级配置
配置生成树协议，产生负载均衡效果。
MS1配置PVST+ 使其成为vlan10、20的主根 vlan30、40的次根
Switch(config)#spanning-tree vlan 10 root primary
Switch(config)#spanning-tree vlan 20 root primary
Switch(config)#spanning-tree vlan 30 root secondary
Switch(config)#spanning-tree vlan 40 root secondary
MS2配置PVST+ 使其成为vlan30、40的主根 vlan10、20的次根
Switch(config)#spanning-tree vlan 30 root primary
Switch(config)#spanning-tree vlan 40 root primary
Switch(config)#spanning-tree vlan 10 root secondary
Switch(config)#spanning-tree vlan 20 root secondary
配置热备份路由协议，完善负载均衡效果。
MS1配置HSRP 使其成为vlan10、20的活跃路由器 vlan30、40的备份路由器
Switch(config)#interface vlan 10
Switch(config-if)#standby 10 ip 192.168.10.254
Switch(config-if)#standby 10 priority 105
Switch(config-if)#standby 10 preempt
Switch(config)#interface vlan 20
Switch(config-if)#standby 20 ip 192.168.20.254
Switch(config-if)#standby 20 priority 105
Switch(config-if)#standby 20 preempt
Switch(config)#interface vlan 30
Switch(config-if)#standby 30 ip 192.168.30.254
Switch(config)#interface vlan 40
Switch(config-if)#standby 40 ip 192.168.40.254
查看热备份状态
Switch#show standby brief
MS2配置HSRP 使其成为vlan30、40的活跃路由器 vlan10、20的备份路由器
Switch(config)#interface vlan 30
Switch(config-if)#standby 30 ip 192.168.30.254
Switch(config-if)#standby 30 priority 105
Switch(config-if)#standby 30 preempt
Switch(config)#interface vlan 40
Switch(config-if)#standby 40 ip 192.168.40.254
Switch(config-if)#standby 40 priority 105
Switch(config-if)#standby 40 preempt
Switch(config)#interface vlan 10
Switch(config-if)#standby 10 ip 192.168.10.254
Switch(config)#interface vlan 20
Switch(config-if)#standby 20 ip 192.168.20.254
开启两台三层交换机的路由功能，并设置每个服务器所在vlan的网关
Switch(config)#ip routing
然后测试目前网络是否可以达成全网互通。
### 步骤四：动态路由配置
按图-3为路由器与三层交换机相连的接口配置ip
![image003 3](media/image36.png){width="3.175in"
height="3.1416666666666666in"}
图-3
配置动态路由协议，使所有内网互通。
在ms1中开启ospf动态路由，并宣告直连网段
Switch(config)#router ospf 1
Switch(config-router)#network 192.168.10.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.20.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.30.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.40.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.50.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.60.0 0.0.0.255 area 0
在ms2中开启ospf动态路由，并宣告直连网段
Switch(config)#router ospf 1
Switch(config-router)#network 192.168.10.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.20.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.30.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.40.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.70.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.80.0 0.0.0.255 area 0
在r1中开启ospf动态路由，并宣告直连网段
Router(config)#router ospf 1
Router(config-router)#network 192.168.50.0 0.0.0.255 area 0
Router(config-router)#network 192.168.70.0 0.0.0.255 area 0
在r2中开启ospf动态路由，并宣告直连网段
Router(config)#router ospf 1
Router(config-router)#network 192.168.60.0 0.0.0.255 area 0
Router(config-router)#network 192.168.80.0 0.0.0.255 area 0
查看所有三层设备路由表，应该是统一状态
show ip route
### 步骤五：NAT配置
配置r1与r2的nat功能，使内网服务器40.1映射到外网100.0.0.3，并在接口中开启
Router(config)#ip nat inside source static 192.168.40.1 100.0.0.3
Router(config)#in g0/2
Router(config-if)#ip nat outside
Router(config-if)#in range g0/0-1
Router(config-if-range)#ip nat inside
在r1与r2中配置默认路由之后，使用ospf宣告自己是默认信息源（表示自己有通往外网的默认路由）
Router(config)#ip route 0.0.0.0 0.0.0.0 100.0.0.10
Router(config)#router ospf 1
Router(config-router)#default-information originate
三层交换机如果看不到从路由器学习来的O\*默认路由就去检查路由器G0/2地址是否配置，之后验证从外网可以访问内网的web服务，可以访问证明项目升级成功。
# NSD PROJECT1 DAY07
传统以太网最大传输包长MTU为1500字节
巨帧：包长大于1500字节，需要接收双边同时设置和协商。
无类IP 地址
例如：用的是B类地址但是子网掩码用的是和C类一样
172.16.0.1 255.255.255.0
128 64 32 16 8 4 2 1
1 1 1 1 1 1 1 1
11111111.11111111.11111110.00000000
8个1 8个1 7个1
掩码 255.255.254.0 /23
主机数：2的9次方 =512
可用主机数：2的9次方 -- 2 =510
172.0.0.38/27 的网络ID 与 广播ID
剖析：
172.0.0.38\--172.0.0.00100110
27\--》255.255.255.11100000 \-\--网络位
网络地址为：172.0.0.00100000\--》172.0.0.32
广播地址为：172.0.0.00111111\--》172.0.0.63
网络地址为：172.0.0.01000000\--》172.0.0.64
广播地址为：172.0.0.01011111\--》172.0.0.95
imap tcp 143 数据从服务端下载到客户端，可逐条看
pop3 tcp 110 数据从服务端下载到客户端，
smtp tcp 25 客户端传邮件至服务器
DNS tcp/udp 53
客户机找首选服务器域名解析用UDP，首选域名服务器无法解析客户机的域名解析请求，而去找根DNS域名服务器解析就是TCP。全球13台根域名服务器（根DNS）
windows远程（mstsc远程桌面） tcp 3389
linux远程windows 工具---远程桌面查看器\--选择RDP协议
DHCP udp 服务端67 客户端68
mysql tcp 3306
网络层中的 ARP：地址解析协议，将IP地址解析为MAC地址
windows中：arp -a 显示登记过的IP地址与MAC地址对应列表,仅限于局域网
linux中：arp 查看arp缓存表
三次握手：客户端发起SYN\--》服务端回应ACK，SYN\--》客户端ACK
DOS：拒绝服务攻击 DDOS:分布式拒绝服务攻击
特征：不关心系统是否有漏洞，不以窃取数据为目的。
客户端发起SYN\--》服务端回应ACK，SYN\--》客户端不返回ACK
云盾：阿里云的防御手段，进行数据晒选与流量牵引。
使用yum repolist检测yum仓库
1，安装论坛所需软件包
yum install -y mariadb-server mariadb php php-mysql
2，开启服务
systemc start mariadb
systemc enable mariadb
systemc start httpd
systemc enable httpd
3，关闭防火墙和selinux
systemctl stop firewalld
setenforce 0
4，拷贝论坛文件到虚拟机
scp /var/ftp/1811/Discuz_X3.3_SC_UTF8.zip PI:EMAIL:/
5，解压缩文件到bbs目录中
unzip Discuz_X3.3_SC_UTF8.zip -d bbs
6，拷贝论坛文件到http服务中
cp -rf bbs/upload/\* /var/www/html/
7，修改目录所属主
chown -R apache config/ data/ template/ uc_client/ uc_server/
8，打开浏览器，输入虚拟机ip地址，安装论坛，安装过程中需要清除数据库密码，再设置论坛管理员密码