Cabletron SSR 8000
Cisco Routers with IOS 11.x-12.x
Extreme Networks Switches
© 2 0 0 1     @ S T A K E ,     I N C .
51
Xprobe - The Signature Based Approach
 The initiation of queries with the static version of Xprobe (v0.0.x) 
is done according to the decision tree.
 Initiation of queries with the Signature based version of Xprobe 
(v0.x) currently has a certain logic.
The Logic Of Initiation of Queries
© 2 0 0 1     @ S T A K E ,     I N C .
52
Xprobe - The Signature Based Approach
UDP Query Sent to
a closed UDP port
ICMP Echo Request
Processing of Reply
ICMP Timestamp
Request
Processing of Reply
ICMP Address Mask
Request
Processing of Reply
ICMP Information
Request
Processing of Reply
If Needed
If Needed
If Needed
If Needed
Includes Extra Tests
The Logic Of Initiation of Queries
© 2 0 0 1     @ S T A K E ,     I N C .
53
Xprobe - The Signature Based Approach
In the future we will initiate queries according to specific differentiations. 
This means that if we receive the exact response for our offending UDP query 
that matches two operating systems, for example, we will not automatically 
send an ICMP Timestamp request, but we will compare the two signatures in 
our database and look for the exact query that will give us the ability to 
differentiate between the two. This way we save bandwidth, and make the 
fingerprinting/manual detection harder.
With more than two matches for a response we will another algorithm/decision 
logic.
The Logic Of Initiation of Queries
UDP Query Sent to
a closed UDP port
OS z
OS t
OS z
OS t
Query Choosed
[After comparison]
Comparing OSs
Signatures in the
DB
Lookup for a match in
the Signature DB
© 2 0 0 1     @ S T A K E ,     I N C .
54
Xprobe - The Signature Based Approach
platform: "Some OS v.1.2-1.3" 
udptest:0xc0:8:BAD::::::::::
udptest::::)::(+|-
)::::
udptest
© 2 0 0 1     @ S T A K E ,     I N C .
56
Xprobe - The Signature Based Approach
icmpecho::::::
Udptest:::):::
icmpecho
© 2 0 0 1     @ S T A K E ,     I N C .
57
Xprobe - The Signature Based Approach
icmpaddr::::
icmpaddr::)::
icmpts, icmpaddrreq, icmpinfo
© 2 0 0 1     @ S T A K E ,     I N C .
58
Xprobe - More Examples
www.netbsd.org
© 2 0 0 1     @ S T A K E ,     I N C .
59
Xprobe - More Examples
www.netbsd.org
© 2 0 0 1     @ S T A K E ,     I N C .
60
Xprobe - More Examples
www.net-security.org
© 2 0 0 1     @ S T A K E ,     I N C .
61
Xprobe - More Examples
www.net-security.org
© 2 0 0 1     @ S T A K E ,     I N C .
62
Xprobe - More Examples
www.alldas.de
© 2 0 0 1     @ S T A K E ,     I N C .
63
Xprobe - More Examples
www.alldas.de
© 2 0 0 1     @ S T A K E ,     I N C .
64
Xprobe - More Examples
IP ID of the Offending Packet
is not Echoed Correctly
Echoing  Integrity Check
FreeBSD 2.x - 4.1.1
Other
IP ID of the Offending Packet is
Echoed Correctly
UDP Checksum of the
Offending Packet Echoed = 0
Echoing  Integrity Check
FreeBSD 4.1.1 - 4.3
FreeBSD 5.0
Other
UDP Checksum of the
Offending Packet Echoed ! = 0
TTL ~ 255
TTL ~ 64
FreeBSD 4.1.1-4.3
FreeBSD 5.0
Already IDENTIFIED
No reply for an ICMP Information Request
Echoing  Integrity Check
IP Header Checksum Echoed = 0
IP Header Checksum Echoed !=0
NetBSD 1.3 - 1.3I
Big Endian
Other
www.alldas.de
© 2 0 0 1     @ S T A K E ,     I N C .
65
Xprobe - More Examples
www.alldas.de
10/19-19:14:00.871716 213.8.199.165:24493 -> 66.21.117.5:32132
UDP TTL:250 TOS:0x0 ID:56241 IpLen:20 DgmLen:98 DF
Len: 78
00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00 00 00 00 00 00                                ......
10/19-19:14:01.191716 66.21.117.5 -> 213.8.199.165
ICMP TTL:41 TOS:0x0 ID:49572 IpLen:20 DgmLen:56 DF
Type:3  Code:3  DESTINATION UNREACHABLE: PORT UNREACHABLE
** ORIGINAL DATAGRAM DUMP:
213.8.199.165:24493 -> 66.21.117.5:32132
UDP TTL:233 TOS:0x0 ID:56241 IpLen:20 DgmLen:98
Len: 78
** END OF DUMP
00 00 00 00 45 00 00 62 DB B1 40 00 E9 11 62 10  ....E..b..@...b.
D5 08 C7 A5 42 15 75 05 5F AD 7D 84 00 4E 00 00
....B.u._.}..N..
FreeBSD 5.0 (automatically supported by the 0.x version)
IPID Echoed OK
UDP Checksum 0
TTL  209.68.21.243:32132
UDP TTL:250 TOS:0x0 ID:54470 IpLen:20 DgmLen:98 DF
Len: 78
00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00 00 00 00 00 00                                ......
10/19-18:59:01.211716 209.68.21.243 -> 213.8.199.165
ICMP TTL:238 TOS:0x0 ID:40233 IpLen:20 DgmLen:56 DF
Type:3  Code:3  DESTINATION UNREACHABLE: PORT UNREACHABLE
** ORIGINAL DATAGRAM DUMP:
213.8.199.165:6314 -> 209.68.21.243:32132
UDP TTL:238 TOS:0x0 ID:54470 IpLen:20 DgmLen:98
Len: 78
** END OF DUMP
00 00 00 00 45 00 00 62 D4 C6 40 00 EE 11 33 DE  ....E..b..@...3.
D5 08 C7 A5 D1 44 15 F3 18 AA 7D 84 00 4E 00 00
.....D....}..N..
FreeBSD 4.1.1 – 4.3 (automatically supported by the 0.x version)
IPID Echoed OK
UDP Checksum 0
TTL < 255
© 2 0 0 1     @ S T A K E ,     I N C .
69
Xprobe - Known Problems
Signature Base Needs to Grow
No ids evasion is done yet. packets are easy to fingerprint. once core 
features developed, optional 'masking' of payload data will be done. 
(ICMP echo request like the once produced with the ‘ping’ utility, DNS 
queries etc).
ICMP Echo request is sent with a code field != 0 (still nobody looks at 
this parameter).
© 2 0 0 1     @ S T A K E ,     I N C .
70
Further Reading
ICMP Usage In Scanning, v3.0 by Ofir Arkin, 
http://www.sys-security.com
X – Remote ICMP based OS Fingerprinting Techniques, by Fyodor Yarochkin and Ofir 
Arkin,
http://www.sys-security.com
RFC 792: Internet Control Message Protocol, 
http://www.ietf.org/rfc/rfc0792.txt
RFC 1122: Requirements for Internet Hosts - Communication Layers, 
http://www.ietf.org/rfc/rfc1122.txt
RFC 1256: ICMP Router Discovery Messages, 
http://www.ietf.org/rfc/rfc1256.txt
RFC 1349: Type of Service in the Internet Protocol Suite, 
http://www.ietf.org/rfc/rfc1349.txt
RFC 1812: Requirements for IP Version 4 Routers,
http://www.ietf.org/rfc/rfc1812.txt
© 2 0 0 1     @ S T A K E ,     I N C .
71
Tools Used
Xprobe written by Fyodor Yarochkin & Ofir Arkin
http://www.sys-security.com
http://www.notlsd.net/xprobe
http://xprobe.sourceforge.net
tcpdump 
http://www.tcpdump.org
Snort written by Marty Roesch
http://www.snort.org