. . . . .
Interface eth1 is up, line protocol detection is disabled
. . . . .
```
配置eth0参数：
```
site-A-RTR# configure terminal
site-A-RTR(config)# interface eth0
site-A-RTR(config-if)# ip address 10.10.10.1/30
site-A-RTR(config-if)# description to-site-B
site-A-RTR(config-if)# no shutdown 
```
继续配置eth1参数：
```
site-A-RTR(config)# interface eth1
site-A-RTR(config-if)# ip address 192.168.1.1/24
site-A-RTR(config-if)# description to-site-A-LAN
site-A-RTR(config-if)# no shutdown 
```
现在验证配置:
```
site-A-RTR(config-if)# do show interface 
```
---
```
Interface eth0 is up, line protocol detection is disabled
. . . . .
  inet 10.10.10.1/30 broadcast 10.10.10.3
. . . . .
Interface eth1 is up, line protocol detection is disabled
. . . . .
  inet 192.168.1.1/24 broadcast 192.168.1.255
. . . . .
```
---
```
site-A-RTR(config-if)# do show interface description 
```
---
```
Interface      Status  Protocol  Description
eth0           up      unknown   to-site-B
eth1           up      unknown   to-site-A-LAN
```
永久保存配置:
```
site-A-RTR(config-if)# do write
```
在site-B上重复上面配置IP地址的步骤。
如果一切顺利，你应该可以在site-A的服务器上ping通site-B上的对等IP地址10.10.10.2了。
注意：一旦Zebra的守护进程启动了，在vtysh命令行中的任何改变都会立即生效。因此没有必要在更改配置后重启Zebra守护进程。
### 步骤 2: 配置OSPF
我们首先创建OSPF配置文件，并启动OSPF守护进程：
```
# cp /usr/share/doc/quagga-XXXXX/ospfd.conf.sample /etc/quagga/ospfd.conf
# service ospfd start
# chkconfig ospfd on 
```
现在启动vtysh命令行来继续OSPF配置：
```
# vtysh
```
输入路由配置模式:
```
site-A-RTR# configure terminal
site-A-RTR(config)# router ospf
```
可选配置路由id:
```
site-A-RTR(config-router)# router-id 10.10.10.1
```
添加在OSPF中的网络:
```
site-A-RTR(config-router)# network 10.10.10.0/30 area 0
site-A-RTR(config-router)# network 192.168.1.0/24 area 0
```
永久保存配置:
```
site-A-RTR(config-router)# do write
```
在site-B上重复和上面相似的OSPF配置:
```
site-B-RTR(config-router)# network 10.10.10.0/30 area 0
site-B-RTR(config-router)# network 172.16.1.0/24 area 0
site-B-RTR(config-router)# do write 
```
OSPF的邻居现在应该启动了。只要ospfd在运行，通过vtysh的任何OSPF相关配置的改变都会立即生效而不必重启ospfd。
下一节，我们会验证我们的Quagga设置。
### 验证
#### 1. 通过ping测试
首先你应该可以从site-A ping同site-B的LAN子网。确保你的防火墙没有阻止ping的流量。
```
[root@site-A-RTR ~]# ping 172.16.1.1 -c 2 
```
#### 2. 检查路由表
必要的路由应该同时出现在内核与Quagga理由表中。
```
[root@site-A-RTR ~]# ip route 
```
---
```
10.10.10.0/30 dev eth0  proto kernel  scope link  src 10.10.10.1
172.16.1.0/30 via 10.10.10.2 dev eth0  proto zebra  metric 20
192.168.1.0/24 dev eth1  proto kernel  scope link  src 192.168.1.1
```
---
```
[root@site-A-RTR ~]# vtysh
site-A-RTR# show ip route 
```
---
```
Codes: K - kernel route, C - connected, S - static, R - RIP, O - OSPF,
       I - ISIS, B - BGP, > - selected route, * - FIB route
O   10.10.10.0/30 [110/10] is directly connected, eth0, 00:14:29
C>* 10.10.10.0/30 is directly connected, eth0
C>* 127.0.0.0/8 is directly connected, lo
O>* 172.16.1.0/30 [110/20] via 10.10.10.2, eth0, 00:14:14
C>* 192.168.1.0/24 is directly connected, eth1
```
#### 3. 验证OSPF邻居和路由
在vtysh命令行中，你可以检查必要的邻居是否在线与是否已经学习了合适的路由。
```
[root@site-A-RTR ~]# vtysh
site-A-RTR# show ip ospf neighbor 
```
![](/data/attachment/album/201411/15/223644bwephhtqlhlplewi.jpg)
本教程中，我们将重点放在使用Quagga配置基本的OSPF。在一般情况下，Quagga能让我们能够轻松在一台普通的Linux机器上配置动态路由协议，如OSPF、RIP或BGP。启用了Quagga的机器可以与你网络中的其他路由器进行通信和交换路由信息。由于它支持主要的开放标准的路由协议，它或许是许多情况下的首选。更重要的是，Quagga的命令行界面与主要路由器厂商如思科和Juniper几乎是相同的，这使得部署和维护Quagga机器变得非常容易。
希望这些对你们有帮助。
---
via: 
作者：[Sarmed Rahman](http://xmodulo.com/author/sarmed) 译者：[geekpi](https://github.com/geekpi) 校对：[wxy](https://github.com/wxy)
本文由 [LCTT](https://github.com/LCTT/TranslateProject) 原创翻译，[Linux中国](http://linux.cn/) 荣誉推出