SQL> ALTER DISKGROUP ARCH_DISK ADD DISK /dev/oracleasm/disks/ASMDISK3name
（7）向磁盘组中增加一个磁盘
DATA_DISK
ARCH_DISK
FLASH_DISK
...........
NAME
SQL> select name,allocation_unit_size,total_mb from v$asm_diskgroup;
（6）查看每个磁盘组的可用大小
FLASHDISK
ARCHDISK1
DATADISK1
DATADISK2
NAME
SQL>
（5）查看磁盘名与裸设备对应关系
DATA_DISK
ARCH_DISK
FLASH DISK
TA
SQL> select name,state from v$asm_diskgroup;
Diskgroup altered.
SQL>alter diskgroup
(4）挂载FLASH_DISK磁盘组
DATA_DISK
ARCH_DISK
FLASH_DISK
iskgroup altered.
SQL>alter diskgroup FLASH_DISK dismount
（3）卸载FLASH_DISK磁盘组
DATA_DISK
ARCH_DISK
FLASH_DISK
NAME
SQL> select name,state from v$asm_diskgroup;
(2）查看磁盘组状态
ME
ME
select name,path from v$asm_disk_stat;
1048576
1048576
1048576
ALLOCATION_UNIT_SIZE
MOUNTED
MOUNTED
MOUNTED
STATE
MOUNTED
MOUNTED
DISMOUNTED
STATE
FLASH_DISK mOunt;
v$asm_diskgroup;
/dev/oracleasm/disks/ASMDISK1
/dev/oracleasm/disks/ASMDISK2
/dev/oracleasm/disks/ASMDISK4
/dev/oracleasm/disks/ASMDISK5
/dev/oracleasm/disks/AsMDISK3
PATH
MOUNTED
MOUNTED
STATE
.........
954
3815
3815
..........
TOTAL_MB
417
PDG
---
## Page 433
Linux公社（www.LinuxIDC.com）是专业的Linux系统门户网站，实时发布最新Linux资讯。
闭，
接到该ASM实例的情况下，才能正常关闭ASM实例，如果至少有一个数据库实例与之连
节点的ASM实例必须将这个要删除的磁盘组卸载。
掉，那么使用ASM的数据库实例也会岩掉。在RAC环境中，在删除一个磁盘组之前，其他
Oracle在10g版本中提供了ASMCMD命令，通过这个命令可以管理存储在ASM磁盘
5.ASMCMD命令
ASM实例被强制关闭后，在下次启动时，会要求进行恢复。
ORA-15064: communication failure with ASM instance
任何与之连接的数据库实例最终也将自动关闭，同时报以下错误：
此时，如果对该ASM实例强制执行SHUTDOWNABORT命令，
ORA-15097: cannot SHUTDOWN ASM instance with connected RDBMS instance
会提示以下错误：
关闭ASM实例的命令和关闭数据库实例的命令相同，但只有在没有任何数据库实例连
4.关闭ASM实例
当有数据库使用ASM的磁盘组时，是无法卸载和删除这个磁盘组的。ASM实例如果岩
Diskgroup dropped.
SQL>drop diskgroup
（9）删除一个磁盘组：
Diskgroup altered.
SQL> ALTER DISKGROUP ARCH_DISK DROP DISK ARCHDISK2;
（8）从磁盘组中删除一个磁盘：
可以看出，
FLASHDISK
ARCHDISK2
DATADISK1
DATADISK2
DATA_DISK
ARCH_DISK
FLASH_DISK
TAMR
查看每个磁盘组的可用大小。
Diskgroup altered.
ARCHDISK2;
，磁盘组ARCH_DISK的大小发生变化了，表明添加磁盘成功。
-----
1048576
1048576
1048576
ALLOCATION UNIT_SIZE
FLASH DISK;
Linuxidc.com
/dev/oracleasm/disks/ASMDISK1
/dev/oracleasm/disks/ASMDISKz
/dev/oracleasm/disks/ASMDISK3
/dev/oracleasm/disks/ASMDISK4
/dev/oracleasm/disks/ASMDISK5
PATH
954
4292
8815
TOTAL_MB
，那么ASM实例将被关
PDG
---
## Page 434
Linux公社（www.LinuxIDC.com）是专业的Linux系统门户网站，实时发布最新Linux资讯。
md_restore.
SID。例如：
中的数据。下面简单介绍ASMCMD命令的使用方法。
下面是ASMCMD提供的一些可用命令，其中oracle 1lg新增的命令有cp、md_backup、
还可以使用“asmcmd-p”，加上“-p”参数可以显示当前路径。
在使用ASMCMD命令时必须启动ASM实例，然后指定ORACLE_HOME和ORACLE
(3）查看磁盘空间信息
spfileracdb.ora
EMPFILE/
PARAMETERFILE/
NLINELOG/
DATAFILE/
CONTROLFILE/
ASMCMD>1s
(2）列出目录信息
ASMCMD> cd+DATA_DISK/RACDB
（1）切换目录
ASMCMD>?
ASMCMD>
[oracle@node-racl
[oracle@node-racl
remap
lsdsk
md_restore
md_backup
mkdir
mkalias
1sdg
lsct
help
www.Linuxidc.com
~]$asmcmd
-]S export
ORACLE_SID=+ASM1
第13章
OracleRAC集群419
PDG
---
## Page 435
Linux公社（www.LinuxIDC.com）是专业的Linux系统门户网站，实时发布最新Linux资讯。
420第5篇集群高级应用篇
copying file(s) .. 
copying file(s)..
copying file(s)..
SOurCe +DATA_DISK/RACDB/DATAFILB/UNDOTBS1.258.728340289
ASMCMD>Cp UNDOTBS1.258.728340289 UND0TBS1.dbf
将ASM磁盘文件UNDOTBS1.258.728340289文件复制到操作系统某目录下：
spfileracdb.ora
file,+DATA_DIsK/racdb/test/spfileracdb.ora,copy committed.
copying file(s).
source +DATA_DISK/RACDB/spfileracdb.ora
ASMCMD> cp spfileracdb.ora test
将ASM磁盘文件spfileracdb.or复制到test目录下：
（6）复制磁盘文件
spfileracdb.ora
PARAMETERFILE/
ONLINELOG/
ASMCMD> mkdir test
（5）创建一个目录
执行ASMCMD的“lsct”命令显示ASM和数据库实例连接情况，如图13-65所示。
（4）显示ASM和数据库实例连接情况
执行ASMCMD的“duDATAFILE”命令查看磁盘空间信息，如图13-64所示。
TEMPFILE/
DATAFILE/
CONTROLFILE/
ASMCMD>
www.Linuxidc.com
1s
自
图13-65显示ASM和数据库实例连接情况
图13-64查看磁盘空间信息
XC
PDG
---
## Page 436
Linux公社（www.LinuxIDC.com）是专业的Linux系统门户网站，实时发布最新Linux资讯。
介绍此命令的简单用法。
境。srvctl在Oracle 9i中被引人，Oracle10g、1lg对其功能进行了很大的增强和改进。下面
13.7
metadata的组织信息。
srvctl即 ServerControl，是Oracle提供的一个命令行工具，用于管理Oracle的RAC环
ASMCMD>rm -rf test
（10）在磁盘组删除文件
+DATA_DISK/RACDB/DATAFILE/SYSTEM.dbf
+DATA_DISK/RACDB/DATAFILE/SYSTEM.256.728340285
+DATA_DISK/RACDB/DATAFILE/SYSAUX.257.728340287
ASMCMD>find+DATA_DISK sys*
（9）在磁盘组查找文件
执行如图13-66所示的命令为ASM磁盘文件设置别名。
（8）为ASM磁盘文件设置别名
DATA_DISK/RACDB/DATAFILE/SYSAUX.dbf
这样就把ASM的metadata备份到了文件系统上，
Diskgroup to be backed up:DATA DIsK
ASMCMD>md_backup -b/u01/oracle/datadisk.bak -g data_disk
（7）备份ASM的metadata
file,/u01/oracle/product/11.0.6/rac_db/dbs/UNDoTBs1.dbf,copy committed.
copying file(s)...
copying file(s) ...
copying file(s)..
利用srvctI管理RAC数据库
www.Linuxidc.com
DATAFILE
DATAFILE
DATAFILL
DATAFILE
HIRROR
HIBRO
图13-66为ASM磁盘文件设置别名
ND
5
256
72834
TA
，通过查看datadisk.bak文件可以得知
0果群421
---
## Page 437
Linux公社（www.LinuxIDC.com）是专业的Linux系统门户网站，实时发布最新Linux资讯。
13.7.2查看RAC数据库配置信息（srvctlconfig）
13.7.1查看实例状态（srvctl status）
VIP exists.:/node-vip2/192.168.12.240/255.255.255.0/eth0
[oracle@node-rac1 -]S srvctl config nodeapps -n node-rac2
显示指定节点的应用程序配置：
acdb
[oracle@node-rac1 ~]S srvctl config database
列出配置的所有数据库：
[oracle@node-racl ~]$ srvctl config database -d racdb
显示RAC数据库的配置：
口-i，即instance name，表示实例名称。
口-d，即database name，表示数据库名称。
在上面的命令行操作中，都用到的参数是：
ASM instance +ASM2 is running on node node-rac2.
[oracle@node-racl~]$srvctlstatus asm
查询特定节点上ASM实例的状态：
GSD is running on node: node-rac2
[oracleanode-racl ~]$ srvctl status nodeapps -n node-rac2
查询特定节点上应用程序的状态：
Instance racdb2 is running on node node-rac2
[oraclesnode-racl ~]$ srvctlstatus instance -d racdb -i racdb2
查询实例racdb2的状态：
Instance racdb1 is running on node node-racl
[oracle@node-racl ~]S srvctl status instance -d racdb -i racdb1
查询实例racdb1的状态：
Instance racdb1 is running on node node-rac1
Instance racdb2 is running on node
[oracle@node-racl -]S srvctl status database -dracdb
查询所有实例和服务的状态：
node-rac2
-n node-rac2
PDG
---
## Page 438
Linux公社（www.LinuxIDC.com）是专业的Linux系统门户网站，实时发布最新Linux资讯。
13.7.4增加/删除/修改实例（srvctladd/remove/modify）
13.7.3启动/关闭实例（srvctl start/stop）
[oracle@node-racl~]$ srvctl status
[oracle@node-racl-]$srvctlstop
Service test is running on instance（s) racdb1
[oracle@node-racl ~]$ srvctl start service -d racdb -s test -i racdb1
在集群节点之间切换集群服务：
口
口-r，表示首选实例。
其中参数的含义如下：
[oracle@node-rac1 -]$ srvctl add service -d racdb -g teat -r racdb1 -a racdb2 -P BASIC
增加一个服务，然后在节点间切换此服务：
[oracle@node-rac1 -]$srvctl start database-d racdb
也可以通过一条命令启动所有实例及其启用的服务：
[oraclesnode-racl~]$ emctl start dbconsole
oracle@node-racl
oraclesnode-racl
启动OracleRAC所有服务：
[oracle@node-racl ~]$srvctl stop database -d racdb
也可以通过一条命令停止所有实例及其启用的服务：
oracle@node-racl~]s
停止OracleRAC所有服务：
+ASM2/u01/oracle/product/11.0.6/rac_db
显示指定节点的ASM实例配置：
Listener exists.
ONS daemon exists.
GSD exists.
-a，表示可用的实例。
www.Linuxidc.com
-S
~]$
~]S
srvctl
srvctl start
srvctl
start
stop
service
instance -dracdb -i racdb1
asm -n node-rac1
service
service
-d racdb-s test -i racdb1
-dracdb-i racdb1
-dracdb
-s test
-iracdb2
集群423
PDG
---
## Page 439