      | mv-expand AssignedRoles
      | where AssignedRoles matches regex 'Admin'
      | summarize by tolower(AccountUPN));
  Audit logs
  | where TimeGenerated > ago(queryfrequency)
  | where Category =~ "UserManagement"
  | where ActivityDisplayName in (security_info_actions)
  | extend Initiator = tostring(InitiatedBy.user.userPrincipalName)
  | extend IP = tostring(InitiatedBy.user.ipAddress)
  | extend Target = 
tolower(tostring(TargetResources[0].userPrincipalName))
  | where Target in (VIPUsers)
```
### Questionable identities and anomalies
Use Log Analytics or Sentinel (log sourced in Microsoft Entra ID) to discover questionable identities and anomalies.
```kusto
SigninLogs
    | where UserId == "x"
    | extend deviceId_ = tostring(DeviceDetail.deviceId)
    | extend displayName_ = tostring(DeviceDetail.displayName)
    | extend city_ = tostring(LocationDetails.city)
    | extend countryOrRegion_ = tostring(LocationDetails.countryOrRegion)
    | summarize min(TimeGenerated), max(TimeGenerated) by IPAddress, ResultDescription, deviceId_, displayName_, city_, countryOrRegion_, AppDisplayName
```
> [!NOTE]
> Not all Microsoft Entra activity-generating alerts have a corresponding entry in SigninLogs, as seen with anomalous token detection. We recommended you see other tables, such as **OfficeActivity** and **AuditLogs**.
```kusto
OfficeActivity
    | where UserId == "x"
    | summarize min(TimeGenerated), max(TimeGenerated) by ClientIP, OfficeWorkload
```
### Activity in CloudAppEvents tables in Microsoft Defender XDR
Use of this method depends on logging setup.
```kusto
M365D AH
CloudAppEvents
| where AccountId == "x"
| summarize min(Timestamp), max(Timestamp) by IPAddress, CountryCode, City, Application
```
[CloudAppEvents](/microsoft-365/security/defender/advanced-hunting-cloudappevents-table) describes the advanced hunting schema that contains information about activities in various cloud apps and services covered by Microsoft Defender for Cloud Apps.
### Malicious actions in AuditLogs, AzureActivity, AzureDevOpsAuditing, and CloudAppEvents
Confirm what the attacker accessed: identity documents, code, repositories, etc. Review the items for sensitive information or hardcoded credentials as demonstrated in the following SharePoint example.
```kusto
OfficeActivity
    | where OfficeWorkload contains "SharePoint" (or other)
    | where ClientIP == "bad IP"
    | project TimeGenerated, Operation, OfficeObjectId
```
### Device investigation checklist
Investigate logs that record device behavior. There's suspicious device activity if:
* Microsoft Defender portal:
  * The device has token theft-related alerts. Search for device ID: join AlertInfo on AlertId| where DeviceId is x
  * Attempts to access Primary Refresh Token (PRT)
  * User installed suspicious apps, extensions, or they recently browsed to suspicious websites. Search Microsoft Defender for Endpoints alerts for suspicious processes or files. Alerts can include suspicious: implant process from a known emerging threat, process name, process behavior, service launched, or scheduled task activity. For possible C2 comms, use Possible command-and-control activity.
  * [Investigate Microsoft Defender for Endpoint alerts](/microsoft-365/security/defender-endpoint/investigate-alerts#investigate-using-the-alert-story) describes how to investigate alerts that are affecting your network, understand what they mean, and how to resolve them.
* Advanced hunting:
  * The device has outgoing network connections from suspicious processes. Look for unusual outgoing activity during the trigger window.
  * Local accounts performed suspicious activity
Learn more:
* [View and organize the Microsoft Defender for Endpoint Alerts queue](/microsoft-365/security/defender-endpoint/alerts-queue)
* [Investigate devices in the Defender for Endpoint Devices list](/microsoft-365/security/defender-endpoint/investigate-machines)
### Isolate the device from the network
Contain the device. [Take response actions on a device in Microsoft Defender for Endpoint](/microsoft-365/security/defender-endpoint/respond-machine-alerts#contain-devices-from-the-network) describes how to quickly respond to detected attacks by isolating devices or collecting an investigation package.
### Data accessed by the attacker
Data loss is data destruction or leakage. Discover what the attacker accessed and the data sensitivity. Investigate SharePoint, OneNote, Azure DevOps. Rotate credentials.
### Data loss procedure
Use your disaster recovery plan's guidance on attacker access to corporate data. Use the following guidance to help prevent data loss, and to improve or create a disaster recovery plan.
* [Investigate data loss alerts with Microsoft Defender XDR](/microsoft-365/security/defender/dlp-investigate-alerts-defender)
* [Investigate Microsoft Purview Data Loss Prevention alerts in Microsoft Defender XDR](https://techcommunity.microsoft.com/t5/security-compliance-and-identity/learn-how-to-investigate-microsoft-purview-data-loss-prevention/ba-p/3732758)
* [Forensic artifacts in Office 365 and where to find them](https://techcommunity.microsoft.com/t5/microsoft-security-experts-blog/forensic-artifacts-in-office-365-and-where-to-find-them/ba-p/3634865)
### Other affected users or devices: entire environment
Query indicators of compromise for the entire environment. For example, more affected devices. Iterate to ensure discovery of affected users and devices.
## Containment state
Once you identified one more user, device, application(s), or workload identities are malicious or compromised, you should take actions to contain the attacker. If compromised, you might not immediately roll the application's credentials, nor delete it.
Sometimes, it's more important to collect attacker details than to respond immediately to the attack. We recommend you consider the order of the following guidance. In this example, containment, or mitigation, is prioritized over information gathering.
> [!IMPORTANT]
> Determine the security and business effects of disabling user or device accounts. If it's too great, consider moving to the Recovery stage.
### Containment task list
1. Change the password for accounts suspected of breach, or if the account password was discovered.
2. Block the user. [Revoke user access in Microsoft Entra ID](/azure/active-directory/enterprise-users/users-revoke-access) describes how to revoke all access for a user in scenarios that include compromised accounts, employee termination, and other insider threats.
3. In Microsoft Entra ID Protection, or similar feature, mark relevant accounts as Compromised.
4. Block the attacker IP address.
    > [!TIP]
    > Attackers can use legitimate virtual private networks (VPNs), which can create more risk as they change IP addresses. If you use Cloud Authentication, block the IP address in Defender for Cloud Apps, or Microsoft Entra ID. If federated, block the IP address at the firewall level in front of the Active Directory Federation Services (ADFS).
5. Enable MFA. [Enable Microsoft Entra multifactor authentication](/azure/active-directory/authentication/tutorial-enable-azure-mfa) describes how to prompt users for additional forms of identification during a sign-in event.
6. Enable Microsoft Entra ID Protection for user and sign-in risk. [Risk policies: Microsoft Entra ID Protection](/azure/active-directory/identity-protection/howto-identity-protection-configure-risk-policies) describes risk policies in Microsoft Entra Conditional Access that can automate the response to risks and allow users to self-remediate detected risks.
7. Determine compromised data: emails, SharePoint, OneDrive, apps. The Microsoft Defender for Cloud Apps [Activities](/cloud-app-security/activity-filters) filter can scan activities and update new activities.
8. Maintain password hygiene. The [Password Guidance](https://www.microsoft.com/research/publication/password-guidance/) whitepaper provides recommendations for password management for end users and identity administrators.
9. Iterate until you discover the affected accounts and devices, and the attack is stopped.
## Recovery
Use the following sections for guidance after investigation and containment.
### Remediation task list
After you complete the investigation and containment, remediate the damage:
* Disable affected user and device accounts
  * Revoke current tokens
  * Reset passwords
* Disable added credentials and/or devices
  * Remediate infected devices
* Disable suspicious email rules
* Roll back changes made by compromised privileged accounts
### Delete added credentials and devices
Before you re-enable affected accounts, use the following guidance.
Delete credentials added with Microsoft Entra authentication methods Graph API.
To delete a user email authentication method, run the following Graph call:
```http
DELETE /users/{id | userPrincipalName}/authentication/emailMethods/{id}
```
Or, delete an added authenticator authentication method run:
```http
DELETE /users/{id | userPrincipalName}/authentication/microsoftAuthenticatorMethods/{microsoftAuthenticatorAuthenticationMethodId}
```
Learn more:
* [Microsoft Entra authentication methods API overview](/graph/api/resources/authenticationmethods-overview)
Delete devices enrolled by the identified user account(s). Use the following Graph API calls:
```http
DELETE /devices/{id}
```
```http
DELETE /devices(deviceId='{deviceId}')
```
### Attacker-accessed data contains more credentials
If you enabled Microsoft Purview, scan your environment. Use the All credentials entity definition with the compromised accounts. Roll the identified credentials as described in the following credential rolling section.
Learn more:
* [All credentials entity definition](/microsoft-365/compliance/sit-defn-all-creds)
### Expire and rotate leaked secrets
Rotate secrets associated with the identified user or device credentials.
* In the Azure portal for the cloud accounts, reset account passwords.
* For hybrid accounts, reset the user password twice as described in [Revoke user access in Microsoft Entra ID](/azure/active-directory/enterprise-users/users-revoke-access).
* In the Microsoft Entra user account, verify devices and MFA are under user control:
  * Disable or delete unknown devices
  * Before you reenable the user account, delete unknown MFA options
* Expire the hardcoded or plaintext credentials in your code repositories:
  * Review the leaked credentials. [Workload identity risk detections](/azure/active-directory/identity-protection/concept-workload-identity-risk) describes how to protect applications and service principals.
  * Run credential scanning. [Credential Scanning](https://microsoft.github.io/code-with-engineering-playbook/continuous-integration/dev-sec-ops/secret-management/credential_scanning/) describes how to automatically inspect a project to ensure that no secrets are included in the project's source code.
* Delete added or changed inbox rules in the Microsoft 365 portal:
  * [Configure email forwarding in Microsoft 365](/microsoft-365/admin/email/configure-email-forwarding)
  * [Phishing investigation](incident-response-playbook-phishing.md)
### Secure identities in your environment
The following articles provide more information about securing identities.
* [Securing privileged access](https://aka.ms/Spa)
* [Securing privileged access for hybrid and cloud deployments in Microsoft Entra ID](/azure/active-directory/roles/security-planning)
* [Add or update a user's profile information and settings](/azure/active-directory/fundamentals/active-directory-users-profile-azure-portal)
* [Overview: Remove a former employee and secure data](/microsoft-365/admin/add-users/remove-former-employee)
* [Microsoft Entra security operations guide](/azure/active-directory/fundamentals/security-operations-introduction)
## Token theft root cause
Sometimes, it's not possible to discover the root cause. We recommended you complete the investigation to derive the details that can show root cause. After recovery, you can perform more investigative steps to help determine the root cause.
[Investigate malicious email delivered in Microsoft 365](/microsoft-365/security/office-365-security/investigate-malicious-email-that-was-delivered) describes how to find and investigate suspicious email messages.
## Next steps
*[Token theft wokflow decision tree](https://aka.ms/tokentheftworkflow)
* [What is Microsoft Entra ID Protection?](/azure/active-directory/identity-protection/overview-identity-protection)
* [Continuous access evaluation](/azure/active-directory/conditional-access/concept-continuous-access-evaluation)
* [Risk based access policies](/azure/active-directory/identity-protection/concept-identity-protection-policies)
* [From Strong to Stronger: Phishing Resistant authentication methods: The Blueprint Files](/events/ignite-nov-2021/security-compliance-and-identity/breakouts/brk244/)
* [Conditional Access authentication strength](/azure/active-directory/authentication/concept-authentication-strengths)
* [Conditional Access: Token protection (preview)](/azure/active-directory/conditional-access/concept-token-protection)
* [Token tactics: How to prevent, detect, and respond to cloud token theft](https://www.microsoft.com/security/blog/2022/11/16/token-tactics-how-to-prevent-detect-and-respond-to-cloud-token-theft/)
* [2023 identity security trends and solutions from Microsoft](https://www.microsoft.com/security/blog/2023/01/26/2023-identity-security-trends-and-solutions-from-microsoft/)