---
title: Token theft playbook
description: Learn to investigate, contain, and remediate token theft attacks in an organization.
services: active-directory
author: janicericketts
manager: martinco
ms.service: security
ms.workload: identity
ms.subservice: security-fundamentals
ms.topic: conceptual
ms.date: 07/28/2023
ms.author: jricketts
ms.reviewer: jricketts
ms.custom: "it-pro"
ms.collection:
---
# Token theft playbook
This article, and its accompanying [decision tree](https://aka.ms/tokentheftworkflow), provide guidance for security analysts and incident responders to identify and investigate token theft attacks in an organization. As organizations increase their security posture, threat actors use more sophisticated techniques to compromise resources. Quick response is needed to investigate, contain, and remediate damage resulting from token theft attacks.
A token theft attack occurs when threat actors compromise and replay tokens issued to a user, even if that user has satisfied multifactor authentication. Because authentication requirements are met, the threat actor is granted access to organizational resources by using the stolen token.
Learn more:
* [Token tactics: How to prevent, detect, and respond to cloud token theft](https://www.microsoft.com/security/blog/2022/11/16/token-tactics-how-to-prevent-detect-and-respond-to-cloud-token-theft/)
## Prerequisites
* Access to the Microsoft Entra ID (formerly Azure AD) [sign in](/azure/active-directory/reports-monitoring/concept-sign-ins) and [audit](/azure/active-directory/reports-monitoring/concept-audit-logs) logs for users and service principals
* An account with one of the following Microsoft Entra roles assigned:
  * Security Administrator
  * Global Administrator
  * Security Reader
  * Global Reader
  * Security Operator
## Recommendations
While not required, we recommend:
* Enable the advanced hunting feature, and access to the last seven days of event data
  * [Connect Office 365 to Microsoft Defender for Cloud Apps](/defender-cloud-apps/connect-office-365) provides instructions for connecting Microsoft Defender for Cloud Apps to your existing Microsoft 365 account using the app connector API.
* Access the Unified Access Log for additional signals
  * [Forensic artifacts in Office 365 and where to find them](https://techcommunity.microsoft.com/t5/microsoft-security-experts-blog/forensic-artifacts-in-office-365-and-where-to-find-them/ba-p/3634865) provides explanations and tips for investigators to understand what data is available and in which portal.
* Microsoft Entra ID [premium risk detections](/azure/active-directory/identity-protection/concept-identity-protection-risks) in Microsoft Entra ID P2 and E5 licenses enable more granular investigation triggers and instruction
* Use a [managed authentication configuration](/azure/active-directory/hybrid/connect/choose-ad-authn) with password hash synchronization (PHS), not federated, to access additional signals
## Requirements
### Configure a SIEM
Security information and event management (SIEM) tools such as Microsoft Sentinel have centralized log visibility. Configure the SIEM to ingest risk events for:
* Sign-in logs and audit logs
* [Microsoft Sentinel integration (Preview)](/defender-cloud-apps/siem-sentinel) describes how to integrate Microsoft Defender for Cloud Apps with Microsoft Sentinel (a scalable, cloud-native SIEM and SOAR) to enable centralized monitoring of alerts and discovery data.
* Office sign-in logs and audit logs
* Configure relevant alerts
Learn more:
* [Connect Microsoft Entra data to Microsoft Sentinel](/azure/sentinel/connect-azure-active-directory)
* [Access data from your event hub](/azure/active-directory/reports-monitoring/tutorial-azure-monitor-stream-logs-to-event-hub#access-data-from-your-event-hub)
Configure Microsoft Sentinel (or third-party SIEM) rules for threat detection and response by following guidance in [Detect threats out of the box](/azure/sentinel/detect-threats-built-in).
Learn more:
* Set up Microsoft Entra ID Protection alerts. [How To: Export risk data](/azure/active-directory/identity-protection/howto-export-risk-data) describes how to store data for longer periods by changing diagnostic settings in Microsoft Entra ID to send RiskyUsers, UserRiskEvents, RiskyServicePrincipals, and ServicePrincipalRiskEvents data to a Log Analytics workspace, archive data to a storage account, stream data to an event hub, or send data to a partner solution.
### Integrate a SIEM with Microsoft Defender for Cloud Apps
Microsoft Defender for Cloud Apps and Microsoft Sentinel are connected by default. If you don't use Microsoft Sentinel, connect your SIEM to Microsoft Defender for Cloud Apps, which supports Microsoft Sentinel, ArcSight by Open Text, and generic common event format (CEF).  
Learn more:
* [Generic SIEM integration](/cloud-app-security/siem)
### Integrate SIEM with Microsoft Graph API
Connect SIEM with the Microsoft Graph Security API.
* **Supported integration options** - write code to connect your application to derive insights. The [Microsoft Graph security API overview](/graph/security-concept-overview) describes key features and provides codes samples.
* **Native integrations and connectors** - built by Microsoft partners
* **Connectors** - for the API through SIEM solutions, security orchestration automated response (SOAR), incident tracking and service management (ITSM), reporting, and so on
  * [List of connectors from Microsoft](/graph/security-integration#list-of-connectors-from-microsoft) describes options for connecting with the Microsoft Graph Security API.
## Investigations
  Review the following sections for guidance on triggers, the investigation checklists, and more. Use the token theft workflow [decision tree](https://aka.ms/tokentheftworkflow) to assist with your investigation and decision making.
### Investigation triggers
Every organization has typical vs. atypical scenarios. Use the following investigation checklist to determine triggers or unusual activity for:
* Identities
* Sign-in logs
* Audit logs
* Office apps
* Devices associated with affected users
If these user activities are confirmed valid, there's no breach. If they can't be confirmed valid, assume a breach and proceed with mitigating actions.
Detect token theft attempts by searching for and investigating event types in the Microsoft Sentinel portal or in a SIEM.
Learn more:
* [Investigate incidents with Microsoft Sentinel](/azure/sentinel/investigate-cases)
Ensure you receive alerts for the following events, which might indicate a token theft attack:
The Microsoft Entra ID Protection feature has the following triggers:
* **Anomalous token (offline detection)** - atypical token characteristics detected, or a token used from an unfamiliar location. The algorithms detecting this behavior use data from Microsoft Entra ID with Microsoft 365 properties. This detection indicates if the attacker is replaying the token.
* **Unfamiliar sign-in properties** - sign-in is anomalous when compared to sign-in history. This event occurs when user sign-in properties are unfamiliar.
* **Unfamiliar sign-in** – a non-interactive sign-in occurs. Increase scrutiny on unfamiliar sign-ins, particularly if detected with suspicious devices. We recommend you give immediate attention to detection for non-interactive sign-ins.
* **Attempted access of Primary Refresh Token (PRT)** - in Windows 10 and 11, Microsoft Defender for Endpoint detects suspicious access to PRT and associated artifacts. Detections feed into the Microsoft Entra risk score, which controls resource conditional access. This detection is low-volume and infrequent.
* **Microsoft Defender XDR detections** – integrate Microsoft Entra ID Protection and Microsoft Defender XDR to see detections in one portal.
  * By default, the most relevant alerts for the security operation center (SOC) are enabled. For all Microsoft Entra IP risk detections, or to turn off the integration, make the change in Microsoft Defender XDR [Alert service setting](https://security.microsoft.com/settings/mtp_settings/service_alert_settings).
   ![Screenshot of the Show high impact alerts only option.](./media/token-theft-playbook/alert-service-settings.png)
* **Suspicious URLs** – a user might have clicked a phishing email link. The suspect email could be an adversary-in-the-middle (AiTM) phishing kit and the start of an attack.
   ![Screenshot of a list of suspicious activity.](./media/token-theft-playbook/suspicious-urls.png)
* **Other suspicious behaviors** - Defender for Microsoft 365 advanced hunter alert evidence and alert tables show actions that indicate token theft. Review the logs to determine:
  * Mass file download by a user
  * Unusual file download by a user
  * Addition of multifactor authentication, or passwordless credential to an account
  * Mailbox forwarding rules added or edited
### Starting the investigation
**Before you begin**: Complete and enable the prerequisites. In addition, this playbook assumes Microsoft customers and investigation teams might not have Microsoft 365 E5 or Microsoft Entra ID P2 license suite available or configured. Therefore, note the provided automation guidance.
For this investigation, it's assumed you have an indication of potential token-theft compromise in:
* A user report
* Microsoft Entra sign-in logs example
* Microsoft Entra ID Protection detection
### Investigation checklist
With knowledge of your typical scenarios, determine anomalies or unusual activity for:
* **Identities**
* **Sign-in logs** - unexpected location or device
* Audit logs - newly registered devices, additional multifactor authentication options, or credential changes.
* **Office apps** - changes since the trigger occurred
* **Devices** - associated with affected users. Evaluate alerts since the incident trigger.
### Evidence of compromise or token-theft: user confirmation
After you identify potentially compromised user account(s), verify the suspicious activities. This process differs for every organization.
Learn more:
* [Incident response overview, Response best practices](incident-response-overview.md#response-best-practices)
### User and/or device investigation
If you believe an account or multiple user accounts were compromised, differentiate your investigation activities between two contexts: user-sessions and machine-device.
### User investigation checklist
Investigate logs that have user behavior. There's suspicious user activity if:
* In Microsoft Entra ID Protection, or in a similar feature, alerts suggest token theft
* Additional credentials or devices added to the user
  * Record the list of identities to revoke
* Affected users receive suspicious emails
  * For phishing or malicious email use Microsoft Defender XDR to investigate and determine other affected users
  * [Investigate malicious email delivered in Microsoft 365](/microsoft-365/security/office-365-security/investigate-malicious-email-that-was-delivered) describes how to find and investigate suspicious email messages.
* [Phishing investigation](incident-response-playbook-phishing.md) provides guidance on identifying and investigating phishing attacks within your organization.
* Privileged accounts affected
  * Review privileged account changes made after the compromise
* Inbox rules creation
  * Record suspicious mailbox rules
  * Compromised users
  * Document IP addresses and the user account(s)
  * Determine other potentially compromised accounts
  * Identify additional authentications from the suspected IP address or user agent string
### Phishing or malicious email
If there's indication of phishing or other malicious email, [Investigate malicious email delivered in Microsoft 365](/microsoft-365/security/office-365-security/investigate-malicious-email-that-was-delivered) describes how to find and investigate suspicious email messages.
### Attacker IP address or user agent string authentications
The following queries refer to tables in Sentinel. Look for signs of persistence: multifactor authentication enrollment, device enrollment, mailbox forwarding rules, or inbox rules.
Learn about rules in the [Microsoft Entra security operations guide](/azure/active-directory/fundamentals/security-operations-introduction).
```kusto
AADUserRiskEvents
| where RiskEventType contains "unfamiliar" or RiskEventType contains "anomalous"
| where IpAddress == "x"
```
Or, use sign-in logs to get users with same IP address.
```kusto
SigninLogs
| where IPAddress == "x"
```
For privileged users, confirm any changes in the time window.
```kusto
AuditLogs
| where TimeGenerated between (datetime(2023-03-01) .. datetime(2023-03-15))
| where InitiatedBy == "x"
```
### Authentication method changes for a privileged account
Use the following query to find any changes in the security information of users who have privileged admin roles assigned.
```kusto
Query
  let queryperiod = 14d;
  let queryfrequency = 2h;
  let security_info_actions = dynamic(["User registered security info", "User changed default security info", "User deleted security info", "Admin updated security info", "User reviewed security info", "Admin deleted security info", "Admin registered security info"]);
  let VIPUsers = (
      IdentityInfo
      | where TimeGenerated > ago(queryperiod)