User: write a kql query for Bazacall NTDS.dit Theft
Assistant: This query looks for copies of NTDS created in specific file paths known to be associated with the Bazacall threat. 

DeviceProcessEvents
| where FileName =~ "ntdsutil.exe"
| where ProcessCommandLine has_any("full", "fu")
| where ProcessCommandLine has_any ("temp", "perflogs", "programdata")
// Exclusion
| where ProcessCommandLine !contains @"Backup"