User: write a kql query for Detect exploitation of the Internet Explorer remote code execution vulnerability, CVE-2018-8653
Assistant: DeviceProcessEvents 
| where Timestamp > ago(7d)
and InitiatingProcessFileName =~ "svchost.exe"
and InitiatingProcessCommandLine contains "WinHttpAutoProxySvc"
and FileName !~ "pacjsworker.exe"
and FileName !~ "svchost.exe"
and FileName !~ "WerFault.exe"