User: write a kql query for Detect CVE-2019-0863 (AngryPolarBearBug2) exploit
Assistant: //Find possible CVE-2019-0863 exploitation
DeviceProcessEvents 
| where FileName =~ "schtasks.exe"
| where ProcessCommandLine contains "Windows Error Reporting"
and ProcessCommandLine contains "/run"