User: write a kql query for Macaw ransomware - Mass account password change 
Assistant: This query looks for instances of attackers changes hundreds of account passwords within short succession.

DeviceProcessEvents 
| where ProcessCommandLine has_all('user', '/Domain', '/Active:Yes', '/PasswordChg:No') 
| summarize commands=count() by DeviceId, bin(Timestamp, 1d)  
| where commands > 200