User: write a kql query for Macaw Ransomware - Use of MSBuild.exe as a LOLBin
Assistant: This query looks for instances of MSBuild.exe being used as a LOLBin.

DeviceProcessEvents 
| where InitiatingProcessFileName =~ "wmiprvse.exe" 
| where FileName =~ "msbuild.exe" and ProcessCommandLine has "programdata"