User: write a kql query for Detect .ace files associated with WinRAR absolute path transversal exploit, CVE-2018-20250
Assistant: //Query for .ace files
DeviceFileEvents
| where Timestamp > ago(7d)
//Look for ACE files
| where FileName endswith ".ace"
//Exclude clean ACE files used by Trend Micro
| where FolderPath !contains @'\Trend Micro'