User: write a kql query for Task creation associated with privilege escalation vulnerability, CVE-2019-0808
Assistant: //Scheduled task creation 
DeviceProcessEvents 
| where Timestamp  > ago(14d) 
| where FileName =~ "schtasks.exe"  
| where ProcessCommandLine  contains "highest" and 
(ProcessCommandLine contains "ecosetup" or 
ProcessCommandLine contains "spsextserv.exe")