User: write a kql query for Detect CVE-2019-1129 (ByeBear) exploit
Assistant: //Find possible use of ByeBear (CVE-2019-1129)
DeviceProcessEvents 
| where ProcessCommandLine contains
@"packages\Microsoft.MicrosoftEdge_8wekyb3d8bbwe"
and ProcessCommandLine contains"/S /Q"
and (ProcessCommandLine contains "rmdir" or ProcessCommandLine contains "del")