User: write a kql query for Detect malicious use of RegAsm, RegSvcs, and InstallUtil by Snip3
Assistant: DeviceNetworkEvents 
| where InitiatingProcessFileName in ("RegSvcs.exe","RegAsm.exe", "InstallUtil.exe") 
| where InitiatingProcessCommandLine in ("\"RegAsm.exe\"","\"RegSvcs.exe\"","\"InstallUtil.exe\"") 
| where InitiatingProcessParentFileName endswith "Powershell.exe"