User: write a kql query for Oracle WebLogic process wlsvcX64.exe exploitation and execution of PowerShell script to download payloads
Assistant: union DeviceProcessEvents, DeviceFileEvents
| where InitiatingProcessParentFileName =~ 'wlsvcX64.exe' and InitiatingProcessFileName =~ 'powershell.exe'