User: write a kql query for StrRAT Malware Persistence
Assistant: The following query looks for the scheduled task named "Skype," which is created by the StrRAT JAR file. This creates persistence on the impacted machine.

DeviceProcessEvents
| where InitiatingProcessFileName in~("java.exe","javaw.exe")
| where FileName == 'cmd.exe' and ProcessCommandLine has_all("schtasks /create", "tn Skype")