User: write a kql query for Bazacall Excel Macro Execution
Assistant: This query looks for the malicious macro being executed on a machine. 

DeviceProcessEvents
| where InitiatingProcessFileName =~ "excel.exe"
    and ProcessCommandLine has_all('mkdir', '&& copy', 'certutil.exe')