User: write a kql query for Get an inventory of SolarWinds Orion software possibly affected by Nobelium
Assistant: DeviceTvmSoftwareVulnerabilities
| where SoftwareVendor == 'solarwinds'
| where SoftwareName startswith 'orion'
| summarize dcount(DeviceName) by SoftwareName
| sort by dcount_DeviceName desc