User: write a kql query for View data on software identified as affected by Nobelium campaign
Assistant: DeviceTvmSoftwareVulnerabilities
| where CveId == 'TVM-2020-0002'
| project DeviceId, DeviceName, SoftwareVendor, SoftwareName, SoftwareVersion