User: write a kql query for Bazacall Renamed Rclone for Exfiltration
Assistant: This query looks for Rclone being renamed to be used for data exfiltration. 

DeviceProcessEvents 
| where ProcessVersionInfoProductName has "rclone" and not(FileName has "rclone")