User: write a kql query for Detect CVE-2019-0973 (InstallerBypass) exploit
Assistant: //Find possible use of InstallerBypass (Windows Installer Service exploit)
DeviceProcessEvents 
| where FileName =~ "msiexec.exe"
| where ProcessCommandLine contains "/fa" 
and ProcessCommandLine contains ":\\windows\\installer"