User: write a kql query for Detect DoublePulsar execution
Assistant: //DoublePulsar execution
DeviceProcessEvents
| where Timestamp > ago(7d)
| where SHA1 == "be855cd1bfc1e1446a3390c693f29e2a3007c04e" or
(ProcessCommandLine contains "targetport" and ProcessCommandLine contains "targetip" and 
(ProcessCommandLine contains "payload" or ProcessCommandLine contains "verifybackdoor"))