User: write a kql query for Exchange vulnerability creating web shells via UMWorkerProcess
Assistant: DeviceFileEvents
| where InitiatingProcessFileName == "UMWorkerProcess.exe" 
| where FileName !in~("CacheCleanup.bin", "cleanup.bin")
| where FileName !endswith ".txt"
| where FileName !endswith ".LOG" 
| where FileName !endswith ".cfg"