User: write a kql query for Fake replies
Assistant: let SubjectTerms = pack_array('onus','equired','all','urvey','eb', 'eport','you','nation','me','itting','book','ocument','ill'); 
EmailEvents 
| where EmailDirection == "Inbound" 
| where Subject startswith "RE:" 
| where Subject has_any(SubjectTerms) 
| join EmailUrlInfo on $left.NetworkMessageId == $right.NetworkMessageId 
| where Url startswith "https://docs.google.com/document/"