User: write a kql query for Command and control associated with privilege escalation vulnerability, CVE-2019-0808
Assistant: //Network Communication to C&C 
DeviceNetworkEvents 
| where Timestamp > ago(14d) 
| where RemoteUrl  in("luckluck.blog", "fffun-video.biz") //Dest Address DNS 
or RemoteIP  == "63.141.233.82" //Destination Address