User: 如何在Redis中设置自定义过期时间，以控制缓存过期和内存使用？
Assistant: 在Redis中设置自定义过期时间可以通过以下两种方式实现：

1. 使用EXPIRE命令设置过期时间：
EXPIRE命令用于设置一个键的过期时间。语法为：EXPIRE key seconds，其中key是需要设置过期时间的键名，seconds是过期时间，单位是秒。例如：
```
redis> SET mykey "Hello"
OK
redis> EXPIRE mykey 10
(integer) 1
```
这里设置了mykey这个键的过期时间为10秒。

2. 使用TTL命令获取剩余过期时间：
TTL命令用于获取一个键的剩余过期时间。语法为：TTL key，其中key是需要获取剩余过期时间的键名。例如：
```
redis> SET mykey "Hello"
OK
redis> EXPIRE mykey 10
(integer) 1
redis> TTL mykey
(integer) 9
```
这里获取了mykey这个键的剩余过期时间为9秒。

通过设置过期时间，可以有效控制Redis中缓存的过期和内存使用。当一个键的过期时间到期时，Redis会自动将其删除。这样可以避免过期的缓存数据占用过多内存资源，同时也能保证缓存的数据是最新的。