User: write a kql query for StrRAT Malware AV Discovery
Assistant: The following query looks for instances of defense evasion behavior, whereby the malware attempts to discover the Antivirus production solutions in place on the compromised device.

DeviceProcessEvents
| where InitiatingProcessFileName in~("java.exe", "javaw.exe") and InitiatingProcessCommandLine has "roaming"
| where FileName == 'cmd.exe' and  ProcessCommandLine has 'path antivirusproduct get displayname'