User: write a kql query for Cypherpunk remote execution through PSEXESVC
Assistant: // Searches for possible Cypherpunk ransomware activity
DeviceProcessEvents
| where InitiatingProcessParentFileName startswith "psexe"
| where ProcessCommandLine has "Dvr /go"