User: write a kql query for Tim.exe payload delivery
Assistant: This query looks for delivery of the malicious payload, Tim.exe. 

DeviceNetworkEvents
| where InitiatingProcessFileName =~ 'powershell.exe'
    and InitiatingProcessCommandLine has('Invoke-WebRequest') and InitiatingProcessCommandLine endswith '-OutFile tim.EXE'