User: write a kql query for Macaw ransomware - Disable Controlled Folders 
Assistant: This query looks for instances where the attacker has disabled the use of controlled folders.

DeviceProcessEvents 
| where InitiatingProcessFileName =~ 'cmd.exe' 
| where FileName =~ 'powershell.exe' and ProcessCommandLine has('powershell.exe  -command "Set-MpPreference -EnableControlledFolderAccess Disabled"')