User: write a kql query for Stolen Images
Assistant: This query looks for instances of Wscript being used to execute the malicious "stolen images" file associated with this Bazarloader campaign. 

DeviceProcessEvents
| where FileName =~ "wscript.exe" and ProcessCommandLine has_all("stolen", "images")