User: write a kql query for Qakbot Craigslist Domains
Assistant: This query looks for network connections to domains impersonating Craigslist which are associated with the delivery of Qakbot.

DeviceNetworkEvents
| where RemoteUrl matches regex @"abuse\.[a-zA-Z]\d{2}-craigslist\.org"