User: write a kql query for RunDLL Suspicious Network Connections
Assistant: This query looks for network connection events made by the RunDll32.exe process that have a command line that contains the ",GlobalOut" process parameter. 

DeviceNetworkEvents
| where InitiatingProcessFileName =~ 'rundll32.exe' and InitiatingProcessCommandLine has ",GlobalOut"