User: write a kql query for Suspicious Google Doc Links
Assistant: EmailUrlInfo 
| where Url startswith "https://docs.google.com/document/" 
| join (EmailEvents 
| where EmailDirection == "Inbound" 
| where InternetMessageId matches regex "\\<\\w{ 38,42} \\@") on NetworkMessageId