User: write a kql query for Bazacall Cobalt Strike Lateral Movement
Assistant: This query looks for alerts related to Cobalt Strike and its built-in PSExec used for lateral movement. 

AlertInfo
| where Title in("File dropped and launched from remote location", "Suspicious transfer of an executable file")
// Joining in instances where Cobalt Strike's built-in PsExec is used for lateral movement
| join AlertEvidence on $left.AlertId == $right.AlertId
| where FileName matches regex @"^([a-z0-9]){7}\.exe$" and FileName matches regex "[0-9]{1,5}"