User: write a kql query for Zip-Doc - Word Launching MSHTA
Assistant: This query looks for instnaces of Microsoft Word creating an .hta file

DeviceProcessEvents
| where InitiatingProcessFileName =~ 'WINWORD.EXE' and FileName =~ 'cmd.exe' and ProcessCommandLine has_all('hta')