User: write a kql query for Backdoor associated with privilege escalation vulnerability, CVE-2019-0808
Assistant: //File creation 
DeviceFileEvents 
| where Timestamp > ago(14d) 
| where FolderPath  contains "temp" and  FileName in~("updata.exe", 
"recovery_db.exe", "spsextserver.exe", "recoverydb.exe") 
or SHA1 in("987cf95281a3f6449681148ea05e44115f74ccbc", 
"6f465b791ab8ef289f20c412808af7ae331c87ab", 
"d5c6c037735c4518fffcdac1026770d8d251c7c8") //File SHAs of above processes