User: write a kql query for Detect potentially unwanted activity from ironSource bundlers
Assistant: union DeviceFileEvents, DeviceProcessEvents 
| where Timestamp > ago(7d)
// Prifou launched by ironSource bundler
| where ProcessCommandLine has "/mhp " and ProcessCommandLine has "/mnt " 
and ProcessCommandLine has "/mds "
// InstallCore launch commands
or (ProcessCommandLine has "/mnl" and ProcessCommandLine has "rsf")
// Chromium installation
or ProcessCommandLine has "bundlename=chromium"
or FileName == "prefjsonfn.txt"
| project SHA1, ProcessCommandLine, FileName, InitiatingProcessFileName,
InitiatingProcessCommandLine, InitiatingProcessSHA1