---

### A10 Thunder Series and AX Series—Command Line Interface Reference

#### IPv6 Address and MAC Address Information
- **b101::1112 0007.E90A.4402**  
  - Type: Dynamic  
  - State: Reachable  
  - Interface: ethernet 6  
  - VLAN: 1

- **fe80::207:e9ff:fe0a:4402 0007.E90A.4402**  
  - Type: Dynamic  
  - State: Reachable  
  - Interface: ethernet 6  
  - VLAN: 1

#### OSPF and RIP Commands
- **show ip ospf | show ipv6 ospf**  
  - Description: Display OSPF information. (Refer to the “Config Commands: Router - OSPF” chapter in the Network Configuration Guide.)

- **show ip prefix-list | show ipv6 prefix-list**  
  - Description: Display information about prefix lists.  
  - Syntax: `show {ip | ipv6} prefix-list`  
  - Mode: All

- **show ip protocols | show ipv6 protocols**  
  - Description: Show information for dynamic routing protocols.  
  - Syntax: `show {ip | ipv6} protocols`  
  - Mode: All

- **show ip rip | show ipv6 rip**  
  - Description: Show information for RIP. (Refer to the “Config Commands: Router - RIP” chapter in the Network Configuration Guide.)

- **show ip route | show ipv6 route**  
  - Description: Display the IPv4 or IPv6 routing table.  
  - Syntax: `show {ip | ipv6} route [ipaddr[/mask-length] | all | bgp | connected | database | isis | mgmt | ospf | rip | static | summary]`  
  - Mode: All  
  - Usage: The `all` option is only applicable for IPv4.  
    - `show ip route` displays information for the data route table only.  
    - `show ip route mgmt` displays information for the management route table only.  
  - Example:  
    ```plaintext
    ACOS#show ip route
    Codes: C - connected, S - static, O - OSPF
    S* 0.0.0.0/0 [1/0] via 192.168.20.1, ve 10
    S* 192.168.1.0/24 [1/0] is directly connected, Management
    C* 192.168.1.0/24 is directly connected, Management
    C* 192.168.19.0/24 is directly connected, ve 10
    Total number of routes : 4
    ```

- **show ip stats | show ipv6 stats**  
  - Description: View statistics for IPv4 or IPv6 packets.  
  - Syntax: `show {ip | ipv6} stats`  
  - Mode: All

- **show ipv6 traffic**  
  - Description: Display IPv6 traffic management statistics.  
  - Syntax: `show ipv6 traffic`  
  - Mode: All  
  - Example:  
    ```plaintext
    ACOS#show ipv6 traffic
    Traffic Type   Received  Sent  Errors
    -------------------------------------------------
    Router Solicit 1        1     0
    Router Adverts 0        0     0
    Neigh Solicit  0        0     0
    Neigh Adverts  0        0     0
    Echo Request   0        0     0
    Echo Replies   0        0     0
    Other ICMPv6 Errs 0     0     0
    ```

- **show isis**  
  - Description: Refer to the “Config Commands: Router - IS-IS” chapter in the Network Configuration Guide.

#### JSON Configuration Commands
- **show json-config**  
  - Description: View the JSON/aXAPI data format associated with the running-config, or for a specific object.  
  - Syntax: `show json-config [object]`  
  - Mode: All  
  - Example:  
    ```plaintext
    ACOS#show json-config slb server web2
    a10-url:/axapi/v3/slb/server/web2
    {
      "server": {
        "name": "web2",
        "host": "10.10.10.2",
        "health-check": "https-with-key",
        "port-list": [
          {
            "port-number": 80,
            "protocol": "tcp",
            "health-check-disable": 1
          }
        ]
      }
    }
    ```

- **show json-config-detail**  
  - Description: View the JSON/aXAPI data format, including the URI and object type, associated with the running-config, or for a specific object.  
  - Syntax: `show json-config-detail [object]`  
  - Mode: All  
  - Example:  
    ```plaintext
    ACOS#show json-config-detail slb server web2
    a10-url:/axapi/v3/slb/server/web2
    {
      "server": {
        "name": "web2",
        "host": "10.10.10.2",
        "health-check": "https-with-key",
        "port-list": [
          {
            "port-number": 80,
            "protocol": "tcp",
            "health-check-disable": 1,
            "a10-url": "/axapi/v3/slb/server/web2/port/80+tcp",
            "obj-type": "multi"
          }
        ]
      }
    }
    ```

- **show json-config-with-default**  
  - Description: View the JSON/aXAPI data format, including default values, associated with the running-config or for a specific object.  
  - Syntax: `show json-config-with-default [object]`  
  - Mode: All  
  - Example:  
    ```plaintext
    ACOS#show json-config-with-default slb server web2
    a10-url:/axapi/v3/slb/server/web2
    {
      "server": {
        "name": "web2",
        "host": "10.10.10.2",
        "action": "enable",
        "template-server": "default",
        "health-check": "https-with-key",
        "conn-limit": 8000000,
        "no-logging": 0,
        "weight": 1,
        "slow-start": 0,
        "spoofing-cache": 0,
        "stats-data-action": "stats-data-enable",
        "extended-stats": 0,
        "port-list": [
          {
            "port-number": 80,
            "protocol": "tcp",
            "range": 0,
            "action": "enable",
            "no-ssl": 0,
            "health-check-disable": 1,
            "weight": 1,
            "conn-limit": 8000000,
            "no-logging": 0,
            "stats-data-action": "stats-data-enable",
            "extended-stats": 0,
            "a10-url": "/axapi/v3/slb/server/web2/port/80+tcp"
          }
        ]
      }
    }
    ```

- **show key-chain**  
  - Description: Show configuration information for authentication key chains.  
  - Syntax: `show key-chain [key-chain-name]`  
  - Mode: Privileged EXEC and all Config levels  
  - Example:  
    ```plaintext
    ACOS#show key-chain
    key chain test1
    key 1
    key-string test1key1
    key 2
    key-string test1key2
    key chain test2
    key 2
    key-string test2key2
    ACOS#show key-chain test1
    key chain test1
    key 1
    key-string test1key1
    key 2
    key-string test1key2
    ```

- **show lacp**  
  - Description: Show configuration information and statistics for Link Aggregation Control Protocol (LACP).  
  - Syntax: `show lacp {counter [lacp-trunk-id] | sys-id | trunk [admin-key-list-details | detail | summary | lacp-trunk-id]}`  
  - Mode: All  
  - Example:  
    ```plaintext
    ACOS#show lacp counters
    Traffic statistics
    Port       LACPDUs   Marker Pckt err
    Sent       Recv      Sent    Recv   Sent  Recv
    Aggregator po5       1000000
    ethernet 1 81        81      0      0     0    0
    ethernet 2 81        81      0      0     0    0
    Aggregator po10      1000001
    ethernet 6 233767    233765  0      0     0    0
    ```
    In this example, LACP has dynamically created two trunks, 5 and 10. Trunk 5 contains ports 1 and 2. Trunk 10 contains port 6.
    
    ```plaintext
    ACOS#show lacp trunk summary
    Aggregator po5 1000000
    Admin Key: 0005 - Oper Key 0005
    Link: ethernet 1 (3) sync: 1
    Link: ethernet 2 (4) sync: 1
    Aggregator po10 1000001
    Admin Key: 0010 - Oper Key 0010
    Link: ethernet 6 (8) sync: 1
    ```

- **show lacp-passthrough**  
  - Description: Show information for the LACP passthrough feature.  
  - Syntax: `show lacp-passthrough`  
  - Mode: All

- **show license**  
  - Description: Display the host ID and, if applicable, serial number of the license applied to this ACOS device.  
  - Syntax: `show license [uid]`  
  - Mode: Privileged EXEC or higher  
  - Example:  
    ```plaintext
    ACOS# show license
    Host ID: 029984E1BC8EF50901B63DC0DCD1FE8A02017B9B
    ACOS# show license uid
    029984E1BC8EF50901B63DC0DCD1FE8A02017B9B
    ```

- **show license-debug**  
  - Description: This command is for internal use and is documented to notify that it does not serve any useful purpose to the consumer.  
  - Syntax: `show license-debug`  
  - Mode: All  
  - Example:  
    ```plaintext
    ACOS> show license-debug
    Host ID : A0C764C33831F0A6FB9861EA6EDCF31330FB91A6
    Product : ADC
    Platform : AX-V
    -----------------------------------------------
    Source Enabled Licenses Expiry Date
    -----------------------------------------------
    BUILT IN
    SLB None
    CGN None
    GSLB None
    RC None
    DAF None
    WAF None
    GLM
    ```

- **show license-info**  
  - Description: Show current product SKU and license information on the ACOS device.  
  - Syntax: `show license-info`  
  - Mode: All  
  - Example:  
    ```plaintext
    ACOS> show license-info
    Host ID : 5DCB01EC264BECCCFECB3C2ED42E02384EE8C527
    Product : CFW
    Platform : AX Series Advanced Traffic Manager
    GLM Ping Interval In Hours : 24
    ------------------------------------------------------------------------------------
    Enabled Licenses Expiry Date Notes
    ------------------------------------------------------------------------------------
    SLB None
    CGN None
    GSLB None
    RC None
    DAF None
    WAF None
    SSLI None
    DCFW None
    GIFW None
    URLF None
    IPSEC None
    AAM None
    FP None
    WEBROOT None Requires an additional Webroot license.
    THREATSTOP None Requires an additional ThreatSTOP license.
    ```

- **show lldp neighbor statistics**  
  - Description: Displays information on all remote neighbors or on the specified interface.  
  - Syntax: `show lldp neighbor statistics [interface Ethernet eth-num]`  
  - Mode: All

- **show lldp statistics**  
  - Description: Displays LLDP receive or send error statistics. You can display information on all interfaces or only display information on a specified interface.  
  - Syntax: `show lldp statistics [interface {ethernet eth-num | management}]`  
  - Mode: All

- **show local-uri-file**  
  - Description: Display local imported URI files.  
  - Syntax: `show local-uri-file [name] [all-partitions] [partition {shared | partition-name}]`  
  - Mode: All

- **show locale**  
  - Description: Display the configured CLI locale.  
  - Syntax: `show locale`  
  - Mode: All  
  - Example:  
    ```plaintext
    ACOS#show locale
    en_US.UTF-8 English locale for the USA, encoding with UTF-8 (default)
    ```

- **show log**  
  - Description: Display entries in the syslog buffer or display current log settings (policy). Log entries are listed starting with the most recent entry on top.  
  - Syntax: `show log [debug] [length num] [policy]`  
  - Parameters:  
    - `debug`: Show debug logging entries only.  
    - `length num`: Shows the most recent log entries, up to the number of entries you specify. You can specify 1-1000000 (one million) entries.  
    - `policy`: Shows the log settings. To display log entries, omit this option.  
  - Mode: All  
  - Example:  
    ```plaintext
    ACOS#show log policy
    ```

---

Document No.: 410-P2-CLI-001 - 6/17/2016