### Command Reference: A10 Thunder Series and AX Series

#### 1. `show ip interfaces` and `show ipv6 interfaces`

**Description:**
Displays the IP or IPv6 interfaces configured on the device.

**Syntax:**
```shell
show {ip | ipv6} interfaces [interface-type interface-number]
```
- **[interface-type interface-number]:** Optional. Specifies the type and number of the interface (e.g., `ethernet 1`, `ve 10`, `loopback 0`, `management`, `trunk 1`, `lif 1`).

**Mode:**
All

**Example:**
The following command shows the IPv4 interfaces configured on Ethernet interface 1:
```shell
ACOS# show ip interfaces ethernet 1
IP addresses on ethernet 1:
ip 10.10.10.241 netmask 255.255.255.0 (Primary)
ip 10.10.10.242 netmask 255.255.255.0
ip 10.10.10.243 netmask 255.255.255.0
ip 10.10.10.244 netmask 255.255.255.0
ip 10.10.11.244 netmask 255.255.255.0
```

The following command shows the IPv4 interfaces configured on VEs:
```shell
ACOS# show ip interfaces ve
Port        IP           Netmask     PrimaryIP
--------------------------------------------------
ve4         60.60.60.241  255.255.255.0  Yes
            50.60.60.241  255.255.252.0  No
--------------------------------------------------
ve6         99.99.99.241  255.255.255.0  Yes
```
- The `PrimaryIP` column indicates whether the address is the primary IP address for the interface.

#### 2. `show ip isis` and `show ipv6 isis`

**Description:**
See the “Config Commands: Router - IS-IS” chapter in the Network Configuration Guide.

#### 3. `show ip nat alg pptp`

**Description:**
Displays Application Level Gateway (ALG) information for IP source NAT.

**Syntax:**
```shell
show ip nat alg pptp {statistics | status}
```

**Example:**
- Display the status of the PPTP NAT ALG feature:
  ```shell
  ACOS# show ip nat alg pptp status
  NAT ALG for PPTP is enabled on port 1723.
  ```
- Display PPTP NAT ALG statistics:
  ```shell
  ACOS(config-if:ethernet:2)# show ip nat alg pptp statistics
  Statistics for PPTP NAT ALG:
  Calls In Progress: 10
  Call Creation Failure: 0
  Truncated PNS Message: 0
  Truncated PAC Message: 0
  Mismatched PNS Call ID: 1
  Mismatched PAC Call ID: 0
  Retransmitted PAC Message: 3
  Truncated GRE Packets: 0
  Unknown GRE Packets: 0
  No Matching GRE Session: 4
  ```

#### 4. `show ip nat interfaces` and `show ipv6 nat interfaces`

**Description:**
Displays IP or IPv6 source NAT information for data interfaces.

**Syntax:**
```shell
show {ip | ipv6} nat interfaces
```

**Example:**
```shell
ACOS# show ip nat interfaces
Total IP NAT Interfaces configured: 2
Interface   NAT Direction
-----------------------------
ve10        outside
ve11        inside
```

#### 5. `show ip nat pool` and `show ipv6 nat pool`

**Description:**
Displays information for IP or IPv6 source NAT pools.

**Syntax:**
```shell
show {ip | ipv6} nat pool [pool-name] [statistics]
```
- **[pool-name]:** Optional. Displays information only for the specified pool.
- **[statistics]:** Optional. Displays pool statistics.

**Example:**
- Display pool information:
  ```shell
  ACOS# show ip nat pool
  Total IP NAT Pools: 2
  Pool Name  Start Address  End Address  Mask  Gateway  Vrid
  dmz1       10.0.0.200    10.0.0.200   /24   0.0.0.0  default
  dmz2       10.10.10.200  10.10.10.200  /24   0.0.0.0  default
  ```
- Display pool statistics:
  ```shell
  ACOS# show ip nat pool statistics
  Pool  Address  Port Usage  Total Used  Total Freed  Failed
  dmz1  10.0.0.200  0  0  0  0
  dmz2  10.10.10.200  0  0  0  0
  ```

#### 6. `show ip nat pool-group` and `show ipv6 nat pool-group`

**Description:**
Displays configuration information for IP or IPv6 source NAT pool groups.

**Syntax:**
```shell
show {ip | ipv6} nat pool-group [group-name]
```

#### 7. `show ip nat range-list`

**Description:**
Displays information for IP source NAT range lists.

**Syntax:**
```shell
show ip nat range-list
```

**Example:**
```shell
ACOS(config)# show ip nat range-list
Total Static NAT range lists: 1
Name  Local Address/Mask  Global Address/Mask  Count  HA
rl1   10.10.10.88/24  192.168.10.88/24  10  0
```

#### 8. `show ip nat static-binding`

**Description:**
Displays information for static IP source NAT bindings.

**Syntax:**
```shell
show ip nat static-binding [statistics] [ipaddr]
```
- **[statistics]:** Optional. Displays statistics.
- **[ipaddr]:** Optional. Displays information for the specified IP address.

**Example:**
- Display the static source NAT binding for local address 10.10.10.20:
  ```shell
  ACOS# show ip nat static-binding 10.10.10.20
  Local Address 10.10.10.20 statically bound to Global Address 10.10.10.1
  ```
- Display static-binding statistics:
  ```shell
  ACOS# show ip nat static-binding statistics
  Source Address  Port Usage  Total Used  Total Freed
  10.10.10.20  0  0  0
  ```

#### 9. `show ip nat statistics`

**Description:**
Displays IP source NAT statistics.

**Syntax:**
```shell
show ip nat statistics
```

**Example:**
```shell
ACOS(config)# show ip nat statistics
Outside interfaces: ethernet8, ethernet11, ve20, ve110, ve120
Inside interfaces: ethernet8, ethernet11, ve20, ve110, ve120
Hits: 1707  Misses: 0
Outbound TCP sessions created: 1363
Outbound UDP sessions created: 344
Outbound ICMP sessions created: 0
Inbound TCP sessions created: 0
Inbound UDP sessions created: 0
Dynamic mappings:
-- Inside Source
access-list 8 pool v4
start 10.10.120.200 end 10.10.120.202
total addresses 3, allocated 2315, misses 0
access-list v6 pool l3nat6
start 6020::203 end 6020::203
total addresses 1, allocated 0, misses 0
```

#### 10. `show ip nat template logging`

**Description:**
Displays configuration information for IP source NAT logging templates.

**Syntax:**
```shell
show ip nat template logging [template-name]
```

#### 11. `show ip nat timeouts`

**Description:**
Displays the IP source NAT protocol port timeouts.

**Syntax:**
```shell
show ip nat timeouts
```

**Example:**
```shell
ACOS(config)# show ip nat timeouts
NAT Timeout values in seconds:
TCP  UDP  ICMP
------------------------
300  300  fast
Service 53/udp has fast-aging configured
```

#### 12. `show ip nat translations`

**Description:**
Displays IP source NAT translations.

**Syntax:**
```shell
show ip nat translations
```

**Example:**
```shell
ACOS# show ip nat translations
Prot  Inside global  Inside local  Outside local  Outside global  Age  Hash  Type
Tcp  10.10.120.200:33345  10.10.30.19:35955  10.10.120.124:1107  10.10.120.124:1107  0  1  NF NAT
Tcp  10.10.120.200:28260  10.10.30.16:64602  10.10.120.111:443  10.10.120.111:443  0  1  NS NAT
...
```

#### 13. `show ip-list`

**Description:**
Displays IP-list information.

**Syntax:**
```shell
show ip-list [list-name]
```
- **[list-name]:** Optional. Displays the configuration of the specified list.

**Example:**
- Show all IP lists:
  ```shell
  ACOS-Active(config)# show ip-list
  Name  Type  Entries
  --------------------------------------------------
  sample_ip_list_ng  IPv4  3
  test-list  IPv4  0
  Total: 2
  ```
- Show the configuration of an individual IP list:
  ```shell
  ACOS# show ip-list sample_ip_list_ng
  ip-list sample_ip_list_ng
  10.10.10.1
  20.20.3.1
  123.45.6.7
  ```

#### 14. `show ipv6 ndisc`

**Description:**
Displays information for IPv6 router discovery.

**Syntax:**
```shell
show ipv6 ndisc router-advertisement {ethernet portnum | ve ve-num | statistics}
```

**Example:**
- Display configuration information for IPv6 router discovery on VE 10:
  ```shell
  ACOS# show ipv6 ndisc router-advertisement ve 10
  Interface VE 10
  Send Advertisements: Enabled
  Max Advertisement Interval: 200
  Min Advertisement Interval: 150
  Advertise Link MTU: Disabled
  Reachable Time: 0
  Retransmit Timer: 0
  Current Hop Limit: 255
  Default Lifetime: 200
  Max Router Solicitations Per Second: 100000
  HA Group ID: None
  Number of Advertised Prefixes: 2
  Prefix 1:
  Prefix: 2001:a::/96
  On-Link: True
  Valid Lifetime: 4400
  Prefix 2:
  Prefix: 2001:32::/64
  On-Link: True
  Valid Lifetime: 2592000
  ```
- Display router discovery statistics:
  ```shell
  ACOS(config)# show ipv6 ndisc router-advertisement statistics
  IPv6 Router Advertisement/Solicitation Statistics:
  Good Router Solicitations (R.S.) Received: 1320
  Periodic Router Advertisements (R.A.) Sent: 880
  R.S. Rate Limited: 2
  R.S. Bad Hop Limit: 1
  R.S. Truncated: 0
  R.S. Bad ICMPv6 Checksum: 0
  R.S. Unknown ICMPv6 Code: 0
  R.S. Bad ICMPv6 Option: 0
  R.S. Src Link-Layer Option and Unspecified Address: 0
  No Free Buffers to send R.A.: 0
  ```

#### 15. `show ipv6 neighbor`

**Description:**
Displays information about neighboring IPv6 devices.

**Syntax:**
```shell
show ipv6 neighbor [ipv6-addr]
```

**Example:**
```shell
ACOS(config)# show ipv6 neighbor
Total IPv6 neighbor entries: 2
IPv6 Address  MAC Address  Type  Age  State  Interface  Vlan
```

This document provides a comprehensive reference for the commands used to manage and monitor IP and IPv6 configurations, NAT settings, and neighbor discovery on A10 Thunder Series and AX Series devices.