10.5.2.1/32 5
10.5.2.2/32 6
128.0.0.0/1 11
page 259 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
show class-list
Description Display information for class lists.
Syntax show class-list [name [ipaddr]]
Replace name with the class list name or ipaddr with an IP address in the class list. If neither
option is specified, the list of configured class lists is displayed instead.
Mode All
Usage For Aho-Corasick (AC) class lists, enter the write memory command immediately before
entering show class-list.
Example The following command displays the class-list files on the ACOS device device:
ACOS#show class-list
Name IP Subnet Location
test 4 3 file
user-limit 14 4 config
Total: 2
The following table describes the fields in the command output.
Field Description
Name Name of the class list.
IP Number of host IP addresses in the class list.
Subnet Number of subnets in the class list.
Location Indicates whether the class list is in the startup-config or in a stand-
alone file:
• config – Class list is located in the startup-config.
• file – Class list is located in a standalone file.
Total Total number of class lists on the ACOS device device.
The following command shows details for a class list:
ACOS#show class-list test
Name: test
Total single IP: 4
Total IP subnet: 3
Content:
1.1.1.1 /32 glid 1
2.2.2.2 /32 glid 2
10.1.2.1 /32 lid 1
10.1.2.2 /32 lid 2
20.1.1.0 /24 lid 1
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 260
A10 Thunder Series and AX Series—Command Line Interface Reference
20.1.2.0 /24 lid 2
0.0.0.0 /0 lid 31
The following commands show the closest matching entries for specific IP addresses in class
list “test”:
AOCS#show class-list test 1.1.1.1
1.1.1.1 /32 glid 1
ACOS#show class-list test 1.1.1.2
0.0.0.0 /0 lid 31
The class list contains an entry for 1.1.1.1, so that entry is shown. However, since the class list
does not contain an entry for 1.1.1.2 but does contain a wildcard entry (0.0.0.0), the wildcard
entry is shown.
show clns
Description Show Connectionless Network Service (CLNS) information.
Syntax show clns [tag] [is-neighbors | neighbors]
[
ethernet num |
lif num |
loopback num |
management |
trunk num |
tunnel num |
ve num
]
[detail]]
Parameter Description
is-neighbors Displays IS neighbor adjacencies.
neighbors Displays CLNS neighbor adjacencies.
ethernet num Display adjacency information for the specified ethernet interface.
lif num Display adjacency information for the specified logical interface.
loopback num Display adjacency information for the specified loopback interface.
management Display adjacency information for the management interface.
trunk num Display adjacency information for the specified trunk.
tunnel num Display adjacency information for the specified tunnel.
ve num Display adjacency information for the specified virtual interface.
detail Displays detailed information.
Mode All
Example The show clns neighbors command displays IS-IS helper information when ACOS is in
helper mode for a particular IS-IS neighbor. Here is an example:
page 261 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
ACOS#show clns neighbors
Area ax1:
System Id Interface SNPA State Holdtime Type Protocol
0000.0000.0004 ethernet 10 78fe.3d32.880a * Up 99 L2 M-ISIS
The asterisk (*) character in the output indicates that IS-IS is in helper mode for the neighbor.
show clock
Description Display the time, timezone, and date.
Syntax show clock [detail]
Parameter Description
detail Shows the clock source, which can be one of the following:
• Time source is NTP
• Time source is hardware calendar
Mode All
Example The following command shows clock information for an ACOS device:
ACOS#show clock detail
20:27:16 Europe/Dublin Sat Apr 28 2007
Time source is NTP
Example If a dot appears in front of the time, the ACOS device has been configured to use NTP but
NTP is not synchronized. The clock was in sync, but has since lost contact with all configured
NTP servers.
ACOS#show clock
.20:27:16 Europe/Dublin Sat Apr 28 2007
Example If an asterisk appears in front of the time, the clock is not in sync or has never been set.
ACOS#show clock
*20:27:16 Europe/Dublin Sat Apr 28 2007
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 262
A10 Thunder Series and AX Series—Command Line Interface Reference
show config
Description This command displays the entire running configuration
Syntax show config
Default N/A
Mode Global
Usage Use this command to display the entire running configuration for the ACOS device, or for the
particular partition which you are viewing.
Related Commands show running-config
show config-block
Description This command displays the current configurations being made in either block-merge or
block-replace mode.
Syntax show config-block
Default N/A
Mode Block-merge or Block-replace configuration mode
Usage Use this command to display the uncommitted configurations you have made in either
block-merge or block-replace mode. These commands are not a part of the running configu-
ration, but they will be implemented upon ending block-merge or block-replace mode.
show context
Description View the configuration for the sub-module in which the command is run.
For example, if you are configuring a virtual port under a virtual server, the show context
command displays only the portion of the configuration within the context of the virtual
port configuration; see the examples below.
Unlike other show commands, the show context command is only available in Global
configuration mode, or any additional sub-mode. For example, if you are configuring a port
under an SLB server, this command shows only the configuration related to the port.
Syntax show context
Mode Global configuration mode or further sub-modes
Example The following example shows the portion of the configuration related to BGP AS 1:
ACOS(config)#router bgp 1
ACOS(config-bgp:1)#show context
page 263 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
!Section configuration: 216 bytes
!
router bgp 1
network 2.2.2.2/32
neighbor a peer-group
neighbor 3.3.3.3 remote-as 1
address-family ipv6
bgp dampening 3 3 3 3
neighbor a activate
neighbor a capability orf prefix-list send
Example The following example first shows the portion of the running-config related to server s1,
then only the portion related to port 80:
ACOS(config-bgp:1-ipv6)#slb server s1
ACOS(config-real server)#show context
!Section configuration: 104 bytes
!
slb server s1 1.1.1.1
port 80 tcp
weight 2
conn-limit 2
conn-resume 1
port 81 tcp
ACOS(config-real server)#port 80 tcp
ACOS(config-real server-node port)#show context
!Section configuration: 64 bytes
!
port 80 tcp
weight 2
conn-limit 2
conn-resume 1
show core
Description Display core dump statistics.
Syntax show core [process]
The process parameter shows core dump statistics for processes on the ACOS device.
Without this option, system core dump statistics are shown instead.
Mode Privileged EXEC level and configuration levels
Example The following command shows system core dump statistics:
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 264
A10 Thunder Series and AX Series—Command Line Interface Reference
ACOS#show core
The LB process has reloaded 1 time.
The LB process has crashed 0 time.
The LB process has been up for 2755 seconds.
show cpu
Description Display CPU statistics.
Syntax show cpu
[history [seconds | minutes | hours | control-cpu | data-cpu]]
[interval seconds]
[overall]
Parameter Description
history Show control CPU and data CPU usage information.
seconds Show CPU usage information in last 60 seconds.
minutes Show CPU usage information in last hour.
hours Show CPU usage information in last 72 hours.
control-cpu Show Control CPU usage information.
data-cpu Show Data CPU usage information.
interval Automatically refreshes the output at the specified interval. If you omit
seconds this option, the output is shown one time. If you use this option, the
output is repeatedly refreshed at the specified interval until you press
ctrl+c.
Mode Privileged EXEC level and configuration levels
If you enter the show cpu command from within an L3V partition, the command shows
utilization for only that partition.
Example The following command shows CPU statistics in 10-second intervals:
ACOS# show cpu interval 10
Cpu Usage: (press ^C to quit)
1Sec 5Sec 10Sec 30Sec 60Sec
--------------------------------------------------------
Time: 23:42:10 GMT Tue Dec 8 2015
Control1 5% 4% 6% 5% 4%
Data1 0% 0% 0% 0% 0%
Data2 0% 0% 0% 0% 0%
Data3 0% 0% 0% 0% 0%
Data4 0% 0% 0% 0% 0%
Data5 0% 0% 0% 0% 0%
I/O1 100% 100% 100% 100% 100%
page 265 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
I/O2 100% 100% 100% 100% 100%
Time: 23:42:20 GMT Tue Dec 8 2015
Control1 4% 3% 3% 4% 4%
Data1 0% 0% 0% 0% 0%
Data2 0% 0% 0% 0% 0%
Data3 0% 0% 0% 0% 0%
Data4 0% 0% 0% 0% 0%
Data5 0% 0% 0% 0% 0%
I/O1 100% 100% 100% 100% 100%
I/O2 100% 100% 100% 100% 100%
...
ACOS#
The following table describes the fields in the command output.
Field Description
Time System time when the statistics were gathered.
Controln Control CPU.
Datan Data CPU. The number of data CPUs depends on the ACOS model.
I/On IO CPU usage.
I/O fields are displayed on non-FTA platforms only.
1Sec-60sec Time intervals at which statistics are collected.
Example The following command output displays CPU utilization rates plotted over the last 60 sec-
onds. The x-axis represents the time elapsed and the y-axis represents the CPU utilization
rate. Asterisks appear along the bottom of the output to illustrate the CPU utilization rates
over time. The figure below only shows the usage for the Control CPU. The usage for the
Control CPU and Data CPU are displayed in separate figures. The CLI command prints 1 aster-
isk for every 10 percent utilization. This means no asterisk will be printed if the CPU usage is
from 0-4; one asterisk will be printed if the CPU usage is 5-14; two asterisks will be printed if
the CPU usage is 15-24; and so on.
ACOS(config)#show cpu history seconds
Time: 12:27:35 IST Tue Sep 30 2014
533743333333244342332253334382533636436465444746756446654678
100
90
80
70
60
50
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 266
A10 Thunder Series and AX Series—Command Line Interface Reference
40
30
20
10* * * * * * * * ** * **** *** ***
0....0....1....1....2....2....3....3....4....4....5....5....
5 0 5 0 5 0 5 0 5 0 5
Control CPU1: CPU% per second (last 60 seconds)
100
90
80
70
60
50
40
30
20
10
0....0....1....1....2....2....3....3....4....4....5....5....
5 0 5 0 5 0 5 0 5 0 5
Data CPU1: CPU% per second (last 60 seconds)
show debug
Description This command applies to debug output. It is recommended to use the AXdebug subsystem
commands instead of the debug commands. See the following:
• “AX Debug Commands” on page365
• “show axdebug file” on page250
• “show axdebug filter” on page251
• “show axdebug status” on page251
show disk
Description Display status information for the ACOS device hard disks.
Syntax show disk
Mode Privileged EXEC level and configuration levels
Example The following command shows hard disk information for an A10 Thunder Series 4430 device:
page 267 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
NOTE: The output on your device may differ slightly from the one shown below.
ACOS#show disk
Total(MB) Used Free Usage
-----------------------------------------
95393 11301 84091 11.8%
Device Primary Disk Secondary Disk
----------------------------------------------
md0 Active
md1 Active
The following table describes the fields in the command output.
Field Description
Total(MB) Total amount of data the hard disk can hold.
NOTE: The hard disk statistics apply to a single disk. This is true even
if your ACOS device contains two disks. In systems with two disks, the
second disk is a hot standby for the primary disk and is not counted
separately in the statistics.
Used Number of MB used.
Free Number of MB free.
Usage Percentage of the disk that is in use.
Device Virtual partition on the disk:
• md0 – The boot partition
• md1 – The A10 data partition
Primary Disk Status of the left hard disk in the redundant pair:
• Active – The disk is operating normally.
• Inactive – The disk has failed and must be replaced. Contact tech-
nical support.
• Synchronizing – The disk has just been installed and is synchroniz-
ing itself with the other disk.
Secondary Disk Status of the right hard disk in the redundant pair.
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 268
A10 Thunder Series and AX Series—Command Line Interface Reference
show dns cache
Description Display DNS caching information.
Syntax show dns cache {client | entry | statistics}
Parameter Description
client DNS client statistics.
entry DNS cache entries.
statistics DNS caching statistics.
Mode All
Example The following command shows DNS caching statistics:
ACOS#show dns cache statistics
Total allocated: 0
Total freed: 0
Total query: 0
Total server response: 0
Total cache hit: 0
Query not passed: 0
Response not passed: 0
Query exceed cache size: 0
Response exceed cache size: 0
Response answer not passed: 0
Query encoded: 0
Response encoded: 0
Query with multiple questions: 0
Response with multiple questions: 0
Response with multiple answers: 0