Syntax no command
Mode All
Example The following command disables the terminal command history feature:
ACOS#no terminal history
ACOS#
ping
Description Test network connectivity. For syntax information, see “ping” on page29.
reboot
Description Reboot the ACOS device.
page 49 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
Syntax reboot [
all |
text |
in hh:mm [text] |
at hh:mm [month day | day month] [text] |
cancel
]
Parameter Description
all Reboot all devices when VCS is enabled, or only this device itself if VCS
is not enabled.
text Reason for the reboot, 1-127 characters long.
in hh:mm Schedule a reboot to take effect in the specified hours and minutes.
The reboot must take place within approximately 24 hours.
at hh:mm Schedule a reboot to take place at the specified time (using a 24-hour
clock). If you specify the month and day, the reboot is scheduled to
take place at the specified time and date. If you do not specify the
month and day, the reboot takes place at the specified time on the
current day (if the specified time is later than the current time), or on
the next day (if the specified time is earlier than the current time).
Specifying 00:00 schedules the reboot for midnight.
month Name of the month, any number of characters in a unique string.
day Number of the day, 1-31.
cancel Cancel a scheduled reboot.
Mode Privileged EXEC mode
Usage The reboot command halts the system. If the system is set to restart on error, it reboots
itself. Use the reboot command after configuration information is entered into a file and
saved to the startup configuration.
You cannot reboot from a virtual terminal if the system is not set up for automatic booting.
This prevents the system from dropping to the ROM monitor and thereby taking the system
out of the remote user’s control.
If you modify your configuration file, the system will prompt you to save the configuration.
The at keyword can be used only if the system clock has been set on the ACOS device
(either through NTP, the hardware calendar, or manually). The time is relative to the
configured time zone on the ACOS device. To schedule reboots across several ACOS devices
to occur simultaneously, the time on each ACOS device must be synchronized with NTP. To
display information about a scheduled reboot, use the show reboot command.
Example The following example immediately reboots the ACOS device:
ACOS(config)#reboot
System configuration has been modified. Save? [yes/no]:yes
Rebooting System Now !!!
Proceed with reboot? [yes/no]:yes
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 50
A10 Thunder Series and AX Series—Command Line Interface Reference
Example The following example reboots the ACOS device in 10 minutes:
ACOS(config)# reboot in 00:10
ACOS(config)# Reboot scheduled for 11:57:08 PDT Fri Apr 21 2014 (in
10 minutes)
Proceed with reboot? [yes/no]yes
ACOS(config)#
Example The following example reboots the ACOS device at 1:00 p.m. today:
13:00
ACOS(config)# reboot at 13:00
ACOS(config)# Reboot scheduled for 13:00:00 PDT Fri Apr 21 2014 (in
1 hour and 2 minutes)
Proceed with reboot? [yes/no]yes
ACOS(config)#
Example The following example reboots the ACOS device on Apr 20 at 4:20 p.m.:
ACOS(config)# reboot at 16:20 apr 20
ACOS(config)# Reboot scheduled for 16:20:00 PDT Sun Apr 20 2014 (in
38 hours and 9 minutes)
Proceed with reboot? [yes/no]yes
ACOS(config)#
Example The following example cancels a pending reboot:
ACOS(config)# reboot cancel
%Reboot cancelled.
***
*** --- REBOOT ABORTED ---
***
page 51 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
reload
Description Restart ACOS system processes and reload the startup-config, without rebooting.
Syntax reload [all | device device-id]
Parameter Description
all When VCS is enabled, this parameter causes all devices in the virtual
chassis to be reloaded.
When VCS is disabled, this parameter causes only the device on which
this command is run to be reloaded.
device-id When VCS is enabled, this parameter causes only the specified device
to be reloaded.
When VCS is disabled, this parameter will return an error message.
Mode Privileged EXEC mode
Usage The reload command restarts ACOS system processes and reloads the startup-config, with-
out reloading the system image. To also reload the system image, use the reboot command
instead. (See “reboot” on page49.)
The ACOS device closes all sessions as part of the reload.
If the reload command is used without any optional parameters (see example below) then
only the device on which the command is run will be reloaded. This is the case for both VCS-
enabled and VCS-disabled devices.
Example Below is an example of the reload command:
ACOS(config)#reload
Reload ACOS ....Done.
ACOS(config)#
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 52
A10 Thunder Series and AX Series—Command Line Interface Reference
repeat
Description Periodically re-enter a show command.
Syntax repeat seconds show command-options
Parameter Description
seconds Interval at which to re-enter the command. You can specify 1-
300 seconds.
command-options Options of the show command. See “Show Commands” on
page237 and “SLB Show Commands” in the Command Line
Interface Reference for ADC.
Mode Privileged EXEC mode
Usage The repeat command is especially useful when monitoring or troubleshooting the system.
The elapsed time indicates how much time has passed since you entered the repeat
command. To stop the command, press Ctrl+C.
show
Description Display system or configuration information. See “Show Commands” on page237 and “SLB
Show Commands” in the Command Line Interface Reference for ADC.
shutdown
Description Schedule a system shutdown at a specified time or after a specified interval, or cancel a
scheduled system shutdown.
Syntax shutdown {at hh:mm | in hh:mm | cancel [text]}
Parameter Description
at Schedule a reboot to take place at the specified time (using a 24-hour clock). If you specify the month
and day, the reboot is scheduled to take place at the specified time and date. If you do not specify the
month and day, the reboot takes place at the specified time on the current day (if the specified time is
later than the current time), or on the next day (if the specified time is earlier than the current time).
Specifying 00:00 schedules the reboot for midnight.
in Shutdown after a specified time interval (hh:mm). For example, 00:10 causes the device to shut down
10 minutes from now.
cancel Cancel pending shutdown
text Reason for shutdown
Mode Privileged EXEC mode
Example The following command schedules a system shutdown to occur at 11:59 p.m.:
page 53 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
ACOS#shutdown at 23:59
System configuration has been modified. Save? [yes/no]:yes
Building configuration...
[OK]
Shutdown scheduled for 23:59:00 UTC Fri Sep 30 2005 (in 5 hours and 39 minutes) by admin on
192.168.1.102
Proceed with shutdown? [confirm]
ACOS#
Example The following command cancels a scheduled system shutdown:
ACOS#shutdown cancel
***
*** --- SHUTDOWN ABORTED ---
***
ssh
Description Establish a Secure Shell (SSH) connection from the ACOS device to another device. (See “ssh”
on page31.)
telnet
Description Establish a Telnet connection from the ACOS device to another device. (See “telnet” on
page31.)
terminal
Description Set terminal display parameters for the current session.
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 54
A10 Thunder Series and AX Series—Command Line Interface Reference
Syntax terminal
{
auto-size |
command-timestamp [unix]|
editing |
gslb-prompt options |
history [size number] |
length number |
monitor |
width lines
}
Parameter Description
auto-size Enables the terminal length and width to automatically change to match the terminal win-
dow size.
This is enabled by default.
command-timestamp Include timestamp information in the show command output.
The unix option displays the timestamp in Unix format (sec.us) since Unix Epoch. For
example:
See the example below for more information.
editing Enables command-line editing.
This is enabled by default.
gslb-prompt Enables the CLI prompt to display the role of the ACOS device within a GSLB group.
options
• disable - disables this feature so the CLI prompt does not display role information
• group-role - displays “Member” or “Master” in the CLI prompt. For example:
ACOS:Master(config)#
• symbol - displays “gslb” in the CLI prompt after the name of the ACOS device. For exam-
ple:
ACOS-gslb:Master(config)#
history [size] Enables and controls the command history function. The size option specifies the number of
command lines that will be held in the history buffer. You can specify 0-1000.
This is enabled by default, the default size is 256.
length num Sets the number of lines on a screen. You can specify 0-512. Specifying 0 disables pausing.
The default length is 24.
monitor Copies debug output to the current terminal.
This is disabled by default.
width num Sets the width of the display terminal. You can specify 0-512. The setting 0 means “infinite”.
The default width is 80.
page 55 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
Default See descriptions.
Mode Privileged EXEC mode
Usage This command affects only the current CLI session. The command is not added to the run-
ning-config and does not persist across reloads or reboots. To make persistent changes, use
the command at the global configuration level. (See “terminal” on page207.)
Example The following command changes the terminal length to 40:
ACOS#terminal length 40
Example The following example shows the command-timestamp option. Note the “Command start
time” and “Command end time” lines added as the first and last lines of the output:
ACOS#terminal command-timestamp
ACOS#show config-block
Command start time : 1422647248.076561
!Block configuration: 24 bytes
!64-bit Advanced Core OS (ACOS) version 4.0.1, build 98 (Jan-29-
2015,15:55)
!
interface ethernet 1
!
!
end
!Configuration specified in merge mode
Command end time : 1422647248.077418
ACOS#
traceroute
Description Trace a route. See “traceroute” on page32.
vcs
Description Enter operational commands for configuring ACOS Virtual Chassis System (aVCS).
For more information, refer to the CLI commands in Configuring ACOS Virtual Chassis
Systems.
write force
Description Forces the ACOS device to save the configuration regardless of whether the system is ready.
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 56
A10 Thunder Series and AX Series—Command Line Interface Reference
CAUTION: Using this command can result in an incomplete or empty configuration! It is rec-
ommended that you use this command only with the advice of Technical Support.
Syntax write force [primary | secondary | name]
Parameter Description
primary Write the configuration to the configuration profile stored in the
default primary configuration area.
secondary Write the configuration to the configuration profile stored in the
default secondary configuration area.
name Write the configuration to a specified profile name.
Mode Privileged EXEC and Global configuration
Example Force the ACOS device to save the current configuration to a custom profile called “custom-
prof”:
ACOS#write memory
System is not ready. Cannot save the configuration.
ACOS#write force custom-prof
Building configuration...
Write configuration to profile "custom-prof"
Do you want to link "custom-prof" to startup-config profile? (y/n):n
[OK]
ACOS#
write memory
Description Write the running-config to a configuration profile.
Syntax write memory
[primary | secondary | profile-name]
[all-partitions | partition {shared | part-name}]
page 57 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
Parameter Description
primary Replaces the configuration profile stored in the primary image
area with the running-config.
secondary Replaces the configuration profile stored in the secondary image
area with the running-config.
profile-name Replaces the commands in the specified configuration profile with
the running-config.
all-partitions Saves changes for all resources in all partitions.
shared Saves changes only for the resources in the shared partition.
part-name Saves changes only for the resources in the specified L3V partition.
Default If you enter write memory without additional options, the command replaces the configu-
ration profile that is currently linked to by “startup-config” with the commands in the run-
ning-config. If startup-config is set to its default (linked to the configuration profile stored in
the image area that was used for the last reboot), then write memory replaces the configu-
ration profile in the image area with the running-config.
Unless you use the force option, the command checks for system readiness and saves the
configuration only if the system is ready.
Mode Privileged EXEC and Global configuration
Example The following command saves the running-config to the configuration profile stored in the
primary image area of the hard disk:
ACOS#write memory primary
Building configuration...
Write configuration to primary default startup-config
Do you also want to write configuration to secondary default startup-config as well?
(y/n):y
[OK]
Example The following command saves the running-config to a configuration profile named "slbcon-
fig2":
ACOS#write memory slbconfig2
Example The following command attempts to save the running-config but the system is not ready:
ACOS#write memory
ACOS is not ready. Cannot save the configuration.
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 58
A10 Thunder Series and AX Series—Command Line Interface Reference
write terminal
Description Display the current running-config on your terminal.
Syntax write terminal
Mode Privileged EXEC and Global configuration
Example Example output from this command (output is truncated for brevity):
ACOS#write terminal
!Current configuration: 2877 bytes
!Configuration last updated at 03:08:11 IST Tue Jul 7 2015
!Configuration last saved at 04:18:08 IST Tue Jul 7 2015
!version 3.2.0-TPS, build 177 (Jun-22-2015,04:56)
!
hostname ACOS
!
clock timezone Europe/Dublin
!
!
...
page 59 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 60
Config Commands: Global
This chapter describes the commands for configuring global ACOS parameters.
To access this configuration level, use the configure command at the Privileged EXEC level.
To display global settings, use show commands. (See “Show Commands” on page237.)
Common commands that are available at all configuration levels (for example, active-partition, backup, clear,
debug, diff, export, health-test, help, import, repeat, show, write) are described in detail elsewhere in this guide.
The following commands are available:
• aam
• access-list (standard)
• access-list (extended)
• accounting
• admin
• admin-lockout
• admin-session clear
• aflex
• aflex-scripts start
• application-type
• arp
• arp-timeout
• audit
• authentication console type
• authentication enable
• authentication login privilege-mode
• authentication mode
• authentication multiple-auth-reject
• authentication type
• authorization
page 61 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference