### Syslog Servers Configuration

**Syslog Servers:**
- **Hosts:** 0

**Facility:**
- **local0**

**Logging Levels:**
- **Console:** Error
- **Syslog:** Disabled
- **Monitor:** Disabled
- **Buffer:** Debugging
- **Email:** Disabled
- **Trap:** Disabled

**Example Command:**
- The following command displays log entries (truncated for brevity):

```bash
ACOS# show log
```

**Log Buffer:**
- **Size:** 30,000 bytes

**Sample Log Entries:**
- **Jan 17 11:32:02:** Warning - A10LB HTTP request has p-conn
- **Jan 17 11:31:01:** Notice - The session [1] is closed
- **Jan 17 11:31:00:** Info - Load libraries in 0.044 secs
- **Jan 17 11:26:19:** Warning - A10LB HTTP request has p-conn
- **Jan 17 11:26:19:** Warning - A10LB HTTP response not beginning of header: m counterType="1" hourlyCount="2396" dailyCount="16295" weeklyCount="16295" monthly
- **Jan 17 11:16:18:** Warning - A10LB HTTP request has p-conn
- **Jan 17 11:16:01:** Notice - The session [1] is closed
- **Jan 17 11:16:00:** Info - Load libraries in 0.055 secs
- **Jan 17 11:15:22:** Warning - A10LB HTTP request has p-conn
- **Jan 17 11:15:03:** Notice - The session [1] is closed
- **Jan 17 11:14:33:** Warning - A10LB HTTP request has p-conn
- ...

### Show MAC Address Table

**Description:**
- Displays the MAC address table entries.

**Syntax:**
- `show mac-address-table [macaddr | port port-num | vlan vlan-id]`

**Parameters:**
- **macaddr:** Shows the MAC table entry for the specified MAC address (format: aaaa.bbbb.cccc).
- **port port-num:** Shows the MAC table entries for the specified Ethernet port.
- **vlan vlan-id:** Shows the MAC table entries for the specified VLAN.

**Mode:**
- All

**Example:**
- The following command displays the MAC table entries:

```bash
ACOS# show mac-address-table
```

**Output:**
- **Total active entries:** 10
- **Age time:** 300 seconds

| MAC-Address   | Port | Type  | Index | Vlan | Trap |
|---------------|------|-------|-------|------|------|
| 001e.bd62.d021 | 2    | Dynamic | 85    | 0    | None |
| 001e.bd62.d01e | 1    | Dynamic | 244   | 120  | None |
| 000c.2923.c500 | lif2 | Dynamic | 456   | 1    | None |
| 000d.480a.6665 | 1    | Dynamic | 594   | 120  | None |
| 001f.a002.fdc3 | 1    | Dynamic | 676   | 120  | None |
| 000c.2923.c500 | 2    | Dynamic | 713   | 60   | None |
| 001e.bd62.d01e | 1    | Dynamic | 734   | 0    | None |
| 000c.2960.8990 | 1    | Dynamic | 752   | 120  | None |
| 001f.a002.10a8 | 5    | Dynamic | 918   | 100  | None |
| 001e.bd62.d021 | 2    | Dynamic | 975   | 60   | None |

**Field Descriptions:**
- **Total active entries:** Total number of active MAC entries in the table.
- **Age time:** Number of seconds a dynamic (learned) MAC entry can remain unused before it is removed from the table.
- **MAC-Address:** MAC address of the entry.
- **Port:** Ethernet port through which the MAC address is reached.
- **Type:** Indicates whether the entry is dynamic or static.
- **Index:** The MAC entry’s position in the MAC table.
- **Vlan:** VLAN the MAC address is on.
- **Trap:** Shows any SNMP traps enabled on the port.

### Show Management

**Description:**
- Displays the types of management access allowed on each of the ACOS device’s Ethernet interfaces.

**Syntax:**
- `show management [ipv4 | ipv6]`

**Mode:**
- All

**Usage:**
- To configure the management access settings, see “enable-management” on page 112 and “disable-management” on page 109.
- If no option is specified, IPv4 access information is shown.

**Example:**
- The following command shows IPv4 management access information:

```bash
ACOS# show management
```

**Output:**
- **PING SSH Telnet HTTP HTTPS SNMP ACL**
- **mgmt:** on on off on on on -
- **eth1:** on off off off off off -
- **eth2:** on off off off off off -
- **eth3:** on off off off off off -
- **eth4:** on off off off off off -

**Note:**
- If management access is controlled by an ACL, the ACL ID would be listed instead of “on” or “off” status.

### Show Memory

**Description:**
- Displays memory usage information.

**Syntax:**
- `show memory [cache | system | active-vrid {vrid-num | default}]`

**Parameters:**
- **cache:** Shows cache statistics.
- **system:** Shows summary statistics for memory usage.
- **active-vrid:** Shows memory usage statistics for the specified VRID only (available in VRRP-A environments).

**Mode:**
- Privileged EXEC level and configuration levels

**Example:**
- The following command shows summary statistics for memory usage:

```bash
ACOS# show memory system
```

**Output:**
- **System Memory Usage:**
  - **Total (KB):** 2,070,368
  - **Free:** 751,580
  - **Shared:** 0
  - **Buffers:** 269,560
  - **Cached:** 96,756
  - **Usage:** 59.0%

- The following command shows memory usage for individual system modules:

```bash
ACOS# show memory
```

**Output:**
- **Memory:**
  - **Total (KB):** 31,941,112
  - **Used:** 8,310,060
  - **Free:** 23,631,052
  - **Usage:** 26.0%

- **System memory:**
  - **Object size (byte):** 4, 36, 100, 228, 484, 996, 2020, 4068, 8164
  - **Allocated (#):** 223, 2536, 71095, 152, 12, 183, 92, 339, 72
  - **Max (#):** 3639, 3639, 71262, 992, 503, 253, 127, 378, 93

- **aFleX memory:**
  - **Object size (byte):** 32, 64, 128, 256, 512, 1024, 2048, 4096
  - **Allocated (#):** 1412, 7008, 7621, 181, 509, 52, 0, 0
  - **Max (#):** 58224, 30816, 20960, 12768, 7168, 3824, 0, 0

- **TCP memory:**
  - **Object size (byte):** 1104, 184
  - **Allocated (#):** 1, 0
  - **Max (#):** 225, 0

- The following command shows memory cache information (truncated for brevity):

```bash
ACOS# show memory cache
```

**Output:**
- **System block 4:**
  - **Object size:** 4
  - **Total in pool:** 3639
  - **Allocated to control:** 223
  - **Misc1:** 92
  - **Misc2:** 1
  - **Allocated to 16 data threads:** 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0

- **System block 36:**
  - **Object size:** 36
  - **Total in pool:** 3639
  - **Allocated to control:** 2536
  - **Misc1:** 0
  - **Misc2:** 1
  - **Allocated to 16 data threads:** 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0

- **System block 100:**
  - **Object size:** 100
  - **Total in pool:** 71262
  - **Allocated to control:** 71095
  - **Misc1:** 0
  - **Misc2:** 37
  - **Allocated to 16 data threads:** 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0

### Show Mirror

**Description:**
- Displays port mirroring information.

**Syntax:**
- `show mirror`

**Mode:**
- All

**Example:**
- The following example shows the port mirroring configuration on an ACOS device:

```bash
ACOS# show mirror
```

**Output:**
- **Mirror Ports 1:**
  - **Input:** 4
  - **Output:** 4
  - **Ports monitored at ingress:** 1

- **Mirror Ports 2:**
  - **Input:** None
  - **Output:** 7

- **Mirror Ports 3:**
  - **Input:** 9
  - **Output:** 9

- **Mirror Ports 4:**
  - **Input:** 3
  - **Output:** None

**Field Descriptions:**
- **Mirror Port:** Mirror port index number.
- **Input:** Indicates that inbound mirrored traffic from the monitor port can be sent out of the specified Ethernet interface. "None" means no inbound mirrored traffic.
- **Output:** Indicates that outbound mirrored traffic from the monitor port can be sent out of the specified Ethernet interface. "None" means no outbound mirrored traffic.
- **Port monitored at ingress:** Port(s) whose inbound traffic is copied to the monitor port.
- **Port monitored at egress:** Port(s) whose outbound traffic is copied to the monitor port.

### Show Monitor

**Description:**
- Displays the event thresholds for system resources.

**Syntax:**
- `show monitor`

**Mode:**
- All

**Example:**
- The following command shows the current system monitoring threshold:

```bash
ACOS# show monitor
```

**Output:**
- **Current system monitoring threshold:**
  - **Hard disk usage:** 85%
  - **Memory usage:** 95%
  - **Control CPU usage:** 90%
  - **Data CPU usage:** 90%
  - **IO Buffer usage:** 734003
  - **Buffer Drop:** 1000
  - **Warning Temperature:** 68°C
  - **Conn type 0-4:** 32767
  - **SMP type 0-4:** 32767

### Show NetFlow

**Description:**
- Displays NetFlow information.

**Syntax:**
- `show netflow {common | monitor [monitor-name]}`

**Parameters:**
- **common:** Displays the currently configured maximum queue time for NetFlow export packets.
- **monitor [monitor-name]:** Displays information for NetFlow monitors.

**Mode:**
- All

**Example:**
- The following example shows the configuration of a NetFlow monitor:

```bash
ACOS(config)# show netflow monitor
```

**Output:**
- **Netflow Monitor netflow-1:**
  - **Protocol:** Netflow v9
  - **Status:** Enable
  - **Filter:** Global
  - **Destination:** Not Configured
  - **Source IP Use MGMT:** No
  - **Flow Timeout:** 10 Minutes
  - **Resend Template Per Records:** 1000
  - **Resend Template Timeout:** 1800 Seconds
  - **Sent:** 0 (Pkts) / 0 (Bytes)
  - **Records:** Not Configured

**Field Descriptions:**
- **Protocol:** Specifies the NetFlow Protocol version (NetFlow v9 or NetFlow v10/IPFIX).
- **Status:** Specifies whether the NetFlow monitor is enabled.
- **Filter:** Identifies the specific type and subset of resources being monitored (global, specific ports, or a NAT pool).
- **Destination:** Indicates the destination IP address and port, if configured.
- **Source IP Use MGMT:** Specifies whether the IP address of the management port of the ACOS device is used as the source IP of NetFlow packets.
- **Flow Timeout:** Timeout value interval at which flow records are periodically exported for long-lived sessions.
- **Resend Template Per Records:** The number of records before the ACOS device resends the NetFlow template.
- **Resend Template Timeout:** The amount of time before the ACOS device resends the template.
- **Sent:** Total number of NetFlow packets and bytes sent.
- **Records:** Specifies the NetFlow template types configured, which define the NetFlow records to export.

### Show NTP

**Description:**
- Displays the Network Time Protocol (NTP) servers and status.

**Syntax:**
- `show ntp {servers | status}`

**Parameters:**
- **servers:** Lists the configured NTP servers and their state (enabled/disabled).
- **status:** Lists the configured NTP servers and the status of the connection between ACOS and the server.

**Mode:**
- Privileged EXEC level and configuration levels

**Example:**
- The following commands show NTP information:

```bash
ACOS# show ntp servers
```

**Output:**
- **Ntp Server isPreferred Mode Authentication**
  - **10.255.254.50:** no enabled disabled
  - **10.255.249.43:** no enabled disabled

```bash
ACOS# show ntp status
```

**Output:**
- **NTP Server Status**
  - **10.255.254.50:** synchronized
  - **10.255.249.43:** polling

### Show Object-Group

**Description:**
- Displays object groups, a named set of IP addresses or protocol values used for extended IPv4 or IPv6 ACLs.

**Syntax:**
- `show object-group [network name | service name]`

**Parameters:**
- **network name:** Show a network object group which contains IP address match criteria.
- **service name:** Show a service object group which contains protocol match criteria.

**Mode:**
- All

### Show Overlay-Mgmt-Info

**Description:**
- See the Configuring Overlay Networks guide.

### Show Overlay-Tunnel

**Description:**
- See the Configuring Overlay Networks guide.

### Show Partition

**Description:**
- All show commands related to partitions are available in Configuring Application Delivery Partitions.

### Show Partition-Config

**Description:**
- All show commands related to partitions are available in Configuring Application Delivery Partitions.

### Show Partition-Group

**Description:**
- All show commands related to partitions are available in Configuring Application Delivery Partitions.

### Show PBSLB

**Description:**
- Displays configuration information and statistics for Policy-based SLB (PBSLB).

**Syntax:**
- `show pbslb [name]`
- `show pbslb client [ipaddr]`
- `show pbslb system`
- `show pbslb virtual-server virtual-server-name [port port-num service-type]`

**Parameters:**
- **name:** Shows information for virtual servers.
- **client [ipaddr]:** Shows information for black/white list clients.
- **system:** Shows system-wide statistics for PBSLB.
- **virtual-server [port port-num service-type]:** Shows statistics for IP limiting on the specified virtual server.

**Mode:**
- All

**Example:**
- The following command shows PBSLB class-list information for an ACOS device:

```bash
ACOS# show pbslb
```

**Output:**
- **Virtual server class list statistics:**
  - **F = Flag (C-Connection, R-Request), Over-RL = Over rate limit**
  - **Source Destination F Current Rate Over-limit Over-RL**
  - **10.1.2.1 10.1.11.1:80 C 15 1 0 0**
  - **Total: 1**

**Field Descriptions:**
- **Source:** Client IP address.
- **Destination:** VIP address.
- **Flag:** Indicates whether the row of information applies to connections or requests:
  - **C:** The statistics listed in this row are for connections.
  - **R:** The statistics listed in this row are for HTTP requests.
- **Current:** Current number of connections or requests.
- **Rate:** Current connection or request rate, which is the number of connections or requests per second.
- **Over Limit:** Number of times client connections or requests exceeded the configured limit.
- **Over Rate Limit:** Number of times client connections or requests exceeded the configured rate limit.

- The following command shows PBSLB black/white-list information for an ACOS device:

```bash
ACOS# show pbslb
```

**Output:**
- **Total number of PBSLB configured:** 1
- **Virtual server Port Blacklist/whitelist GID Connection # (Establish Reset Drop)**
  - **PBSLB_VS1 80 sample-bwlist 2 0 0 0**
  - **4 0 0 0**

**Field Descriptions:**
- **Total number of PBSLB configured:** Number of black/white lists imported onto the ACOS device.
- **Virtual server:** SLB virtual server to which the black/white list is bound.
- **Port:** Protocol port.
- **Blacklist/whitelist:** Name of the black/white list.
- **GID:** Group ID.