# ACOS Command Line Interface Reference

## Syntax: `no` Command
- **Mode:** All
- **Example:**
  ```shell
  ACOS# no terminal history
  ACOS#
  ```
- **Description:** Disables the terminal command history feature.

## `ping`
- **Description:** Tests network connectivity. For syntax information, see “ping” on page 29.

## `reboot`
- **Description:** Reboots the ACOS device.
- **Syntax:**
  ```shell
  reboot [all | text | in hh:mm [text] | at hh:mm [month day | day month] [text] | cancel]
  ```
- **Parameters:**
  - `all`: Reboots all devices if VCS is enabled, or only the current device if VCS is not enabled.
  - `text`: Specifies the reason for the reboot (1-127 characters).
  - `in hh:mm`: Schedules a reboot to occur in the specified hours and minutes. The reboot must take place within approximately 24 hours.
  - `at hh:mm`: Schedules a reboot to occur at the specified time (using a 24-hour clock). If the month and day are specified, the reboot will occur at the specified time and date. If not, the reboot will occur at the specified time on the current day (if later than the current time) or on the next day (if earlier than the current time). Specifying `00:00` schedules the reboot for midnight.
  - `cancel`: Cancels a scheduled reboot.
- **Mode:** Privileged EXEC mode
- **Usage:**
  - The `reboot` command halts the system. If the system is set to restart on error, it reboots itself. Use this command after configuration information is entered into a file and saved to the startup configuration.
  - You cannot reboot from a virtual terminal if the system is not set up for automatic booting. This prevents the system from dropping to the ROM monitor and thereby taking the system out of the remote user’s control.
  - If you modify your configuration file, the system will prompt you to save the configuration.
  - The `at` keyword can be used only if the system clock has been set on the ACOS device (either through NTP, the hardware calendar, or manually). The time is relative to the configured time zone on the ACOS device. To schedule reboots across several ACOS devices to occur simultaneously, the time on each ACOS device must be synchronized with NTP. To display information about a scheduled reboot, use the `show reboot` command.
- **Examples:**
  - Immediate reboot:
    ```shell
    ACOS(config)# reboot
    System configuration has been modified. Save? [yes/no]: yes
    Rebooting System Now !!!
    Proceed with reboot? [yes/no]: yes
    ```
  - Reboot in 10 minutes:
    ```shell
    ACOS(config)# reboot in 00:10
    Reboot scheduled for 11:57:08 PDT Fri Apr 21 2014 (in 10 minutes)
    Proceed with reboot? [yes/no]: yes
    ```
  - Reboot at 1:00 p.m. today:
    ```shell
    ACOS(config)# reboot at 13:00
    Reboot scheduled for 13:00:00 PDT Fri Apr 21 2014 (in 1 hour and 2 minutes)
    Proceed with reboot? [yes/no]: yes
    ```
  - Reboot on Apr 20 at 4:20 p.m.:
    ```shell
    ACOS(config)# reboot at 16:20 apr 20
    Reboot scheduled for 16:20:00 PDT Sun Apr 20 2014 (in 38 hours and 9 minutes)
    Proceed with reboot? [yes/no]: yes
    ```
  - Cancel a pending reboot:
    ```shell
    ACOS(config)# reboot cancel
    %Reboot cancelled.
    ***
    *** --- REBOOT ABORTED ---
    ***
    ```

## `reload`
- **Description:** Restarts ACOS system processes and reloads the startup-config without rebooting.
- **Syntax:**
  ```shell
  reload [all | device device-id]
  ```
- **Parameters:**
  - `all`: When VCS is enabled, this parameter causes all devices in the virtual chassis to be reloaded. When VCS is disabled, this parameter causes only the device on which the command is run to be reloaded.
  - `device-id`: When VCS is enabled, this parameter causes only the specified device to be reloaded. When VCS is disabled, this parameter will return an error message.
- **Mode:** Privileged EXEC mode
- **Usage:**
  - The `reload` command restarts ACOS system processes and reloads the startup-config without reloading the system image. To also reload the system image, use the `reboot` command instead. (See “reboot” on page 49.)
  - The ACOS device closes all sessions as part of the reload.
  - If the `reload` command is used without any optional parameters, only the device on which the command is run will be reloaded. This is the case for both VCS-enabled and VCS-disabled devices.
- **Example:**
  ```shell
  ACOS(config)# reload
  Reload ACOS ....Done.
  ```

## `repeat`
- **Description:** Periodically re-enters a show command.
- **Syntax:**
  ```shell
  repeat seconds show command-options
  ```
- **Parameters:**
  - `seconds`: Interval at which to re-enter the command (1-300 seconds).
  - `command-options`: Options of the show command. See “Show Commands” on page 237 and “SLB Show Commands” in the Command Line Interface Reference for ADC.
- **Mode:** Privileged EXEC mode
- **Usage:**
  - The `repeat` command is especially useful when monitoring or troubleshooting the system. The elapsed time indicates how much time has passed since you entered the `repeat` command. To stop the command, press `Ctrl+C`.

## `show`
- **Description:** Displays system or configuration information. See “Show Commands” on page 237 and “SLB Show Commands” in the Command Line Interface Reference for ADC.

## `shutdown`
- **Description:** Schedules a system shutdown at a specified time or after a specified interval, or cancels a scheduled system shutdown.
- **Syntax:**
  ```shell
  shutdown {at hh:mm | in hh:mm | cancel [text]}
  ```
- **Parameters:**
  - `at hh:mm`: Schedules a shutdown to occur at the specified time (using a 24-hour clock). If the month and day are specified, the shutdown will occur at the specified time and date. If not, the shutdown will occur at the specified time on the current day (if later than the current time) or on the next day (if earlier than the current time). Specifying `00:00` schedules the shutdown for midnight.
  - `in hh:mm`: Shuts down after a specified time interval (hh:mm). For example, `00:10` causes the device to shut down 10 minutes from now.
  - `cancel`: Cancels a pending shutdown.
  - `text`: Reason for the shutdown.
- **Mode:** Privileged EXEC mode
- **Examples:**
  - Schedule a system shutdown at 11:59 p.m.:
    ```shell
    ACOS# shutdown at 23:59
    System configuration has been modified. Save? [yes/no]: yes
    Building configuration...
    [OK]
    Shutdown scheduled for 23:59:00 UTC Fri Sep 30 2005 (in 5 hours and 39 minutes) by admin on 192.168.1.102
    Proceed with shutdown? [confirm]
    ```
  - Cancel a scheduled system shutdown:
    ```shell
    ACOS# shutdown cancel
    ***
    *** --- SHUTDOWN ABORTED ---
    ***
    ```

## `ssh`
- **Description:** Establishes a Secure Shell (SSH) connection from the ACOS device to another device. (See “ssh” on page 31.)

## `telnet`
- **Description:** Establishes a Telnet connection from the ACOS device to another device. (See “telnet” on page 31.)

## `terminal`
- **Description:** Sets terminal display parameters for the current session.
- **Syntax:**
  ```shell
  terminal
  {
    auto-size |
    command-timestamp [unix] |
    editing |
    gslb-prompt options |
    history [size number] |
    length number |
    monitor |
    width lines
  }
  ```
- **Parameters:**
  - `auto-size`: Enables the terminal length and width to automatically change to match the terminal window size. This is enabled by default.
  - `command-timestamp`: Includes timestamp information in the show command output. The `unix` option displays the timestamp in Unix format (sec.us) since the Unix Epoch.
  - `editing`: Enables command-line editing. This is enabled by default.
  - `gslb-prompt options`:
    - `disable`: Disables this feature so the CLI prompt does not display role information.
    - `group-role`: Displays “Member” or “Master” in the CLI prompt. For example: `ACOS:Master(config)#`.
    - `symbol`: Displays “gslb” in the CLI prompt after the name of the ACOS device. For example: `ACOS-gslb:Master(config)#`.
  - `history [size]`: Enables and controls the command history function. The `size` option specifies the number of command lines that will be held in the history buffer (0-1000). This is enabled by default, with a default size of 256.
  - `length num`: Sets the number of lines on a screen (0-512). Specifying `0` disables pausing. The default length is 24.
  - `monitor`: Copies debug output to the current terminal. This is disabled by default.
  - `width num`: Sets the width of the display terminal (0-512). Setting `0` means “infinite”. The default width is 80.
- **Default:** See descriptions.
- **Mode:** Privileged EXEC mode
- **Usage:**
  - This command affects only the current CLI session. The command is not added to the running-config and does not persist across reloads or reboots. To make persistent changes, use the command at the global configuration level. (See “terminal” on page 207.)
- **Examples:**
  - Change the terminal length to 40:
    ```shell
    ACOS# terminal length 40
    ```
  - Show the `command-timestamp` option:
    ```shell
    ACOS# terminal command-timestamp
    ACOS# show config-block
    Command start time : 1422647248.076561
    !Block configuration: 24 bytes
    !64-bit Advanced Core OS (ACOS) version 4.0.1, build 98 (Jan-29-2015,15:55)
    !
    interface ethernet 1
    !
    !
    end
    !Configuration specified in merge mode
    Command end time : 1422647248.077418
    ```

## `traceroute`
- **Description:** Traces a route. See “traceroute” on page 32.

## `vcs`
- **Description:** Enters operational commands for configuring ACOS Virtual Chassis System (aVCS). For more information, refer to the CLI commands in Configuring ACOS Virtual Chassis Systems.

## `write force`
- **Description:** Forces the ACOS device to save the configuration regardless of whether the system is ready.
- **CAUTION:** Using this command can result in an incomplete or empty configuration! It is recommended that you use this command only with the advice of Technical Support.
- **Syntax:**
  ```shell
  write force [primary | secondary | name]
  ```
- **Parameters:**
  - `primary`: Writes the configuration to the configuration profile stored in the default primary configuration area.
  - `secondary`: Writes the configuration to the configuration profile stored in the default secondary configuration area.
  - `name`: Writes the configuration to a specified profile name.
- **Mode:** Privileged EXEC and Global configuration
- **Example:**
  - Force the ACOS device to save the current configuration to a custom profile called “custom-prof”:
    ```shell
    ACOS# write memory
    System is not ready. Cannot save the configuration.
    ACOS# write force custom-prof
    Building configuration...
    Write configuration to profile "custom-prof"
    Do you want to link "custom-prof" to startup-config profile? (y/n): n
    [OK]
    ```

## `write memory`
- **Description:** Writes the running-config to a configuration profile.
- **Syntax:**
  ```shell
  write memory [primary | secondary | profile-name] [all-partitions | partition {shared | part-name}]
  ```
- **Parameters:**
  - `primary`: Replaces the configuration profile stored in the primary image area with the running-config.
  - `secondary`: Replaces the configuration profile stored in the secondary image area with the running-config.
  - `profile-name`: Replaces the commands in the specified configuration profile with the running-config.
  - `all-partitions`: Saves changes for all resources in all partitions.
  - `shared`: Saves changes only for the resources in the shared partition.
  - `part-name`: Saves changes only for the resources in the specified L3V partition.
- **Default:**
  - If you enter `write memory` without additional options, the command replaces the configuration profile that is currently linked to by `startup-config` with the commands in the running-config. If `startup-config` is set to its default (linked to the configuration profile stored in the image area that was used for the last reboot), then `write memory` replaces the configuration profile in the image area with the running-config.
  - Unless you use the `force` option, the command checks for system readiness and saves the configuration only if the system is ready.
- **Mode:** Privileged EXEC and Global configuration
- **Examples:**
  - Save the running-config to the configuration profile stored in the primary image area of the hard disk:
    ```shell
    ACOS# write memory primary
    Building configuration...
    Write configuration to primary default startup-config
    Do you also want to write configuration to secondary default startup-config as well? (y/n): y
    [OK]
    ```
  - Save the running-config to a configuration profile named "slbconfig2":
    ```shell
    ACOS# write memory slbconfig2
    ```
  - Attempt to save the running-config but the system is not ready:
    ```shell
    ACOS# write memory
    ACOS is not ready. Cannot save the configuration.
    ```

## `write terminal`
- **Description:** Displays the current running-config on your terminal.
- **Syntax:**
  ```shell
  write terminal
  ```
- **Mode:** Privileged EXEC and Global configuration
- **Example:**
  - Example output from this command (output is truncated for brevity):
    ```shell
    ACOS# write terminal
    !Current configuration: 2877 bytes
    !Configuration last updated at 03:08:11 IST Tue Jul 7 2015
    !Configuration last saved at 04:18:08 IST Tue Jul 7 2015
    !version 3.2.0-TPS, build 177 (Jun-22-2015,04:56)
    !
    hostname ACOS
    !
    clock timezone Europe/Dublin
    !
    ...
    ```

---

**Document No.: 410-P2-CLI-001 - 6/17/2016**

**A10 Thunder Series and AX Series—Command Line Interface Reference**

**Page 60**