Replace num with the trunk number
Mode All
Example The following command shows information for trunk group 1:
ACOS# show trunk 1
Trunk ID : 1 Member Count: 8
Trunk Status : Up
Members : 1 2 3 4 5 6 7 8
Cfg Status : Enb Enb Enb Enb Enb Enb Enb Enb
Oper Status : Up Up Up Up Up Up Up Up
Ports-Threshold : 6 Timer: 10 sec(s) Running: No
Working Lead : 1
The following table describes the fields in the command output.
Field Description
Trunk ID ID assigned to the trunk by the admin who configured it.
Member Count Number of ports in the trunk.
Trunk Status Indicates whether the trunk is up.
Members Port numbers in the trunk.
Cfg Status Configuration status of the port.
Oper Status Operational status of the port.
Ports-Threshold Indicates the minimum number of ports that must be up in order for
the trunk to remain up.
If the number of up ports falls below the configured threshold, ACOS
automatically disables the trunk’s member ports. The ports are dis-
abled in the running-config. The ACOS device also generates a log
message and an SNMP trap, if these services are enabled.
Timer Indicates how many seconds the ACOS device waits after a port goes
down before marking the trunk down, if the ports threshold is
exceeded.
Running Indicates whether the ports-threshold timer is currently running.
When the timer is running, a port has gone down but the state
change has not yet been applied to the trunk’s state.
Working Lead Port number used for responding to ARP requests.
NOTE: If the lead port is shown as 0 or “None”, the trunk interface is
down.
page 357 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
show vcs
Description aVCS-specific show commands are available in Configuring ACOS Virtual Chassis Systems.
show version
Description Display software, hardware, and firmware version information.
Syntax show version
Mode All
Example Below is sample output for this command; note that the output on your system will differ
depending on your specific platform.
ACOS# show version
AX Series Advanced Traffic Manager AXvThunder
Copyright 2007-2016 by A10 Networks, Inc. All A10 Networks products are
protected by one or more of the following US patents:
9124550, 9122853, 9118620, 9118618, 9106561, 9094364, 9060003, 9032502
8977749, 8943577, 8918857, 8914871, 8904512, 8897154, 8868765, 8849938
8826372, 8813180. 8782751, 8782221, 8595819, 8595791, 8595383, 8584199
8464333, 8423676, 8387128, 8332925, 8312507, 8291487, 8266235, 8151322
8079077, 7979585. 7804956, 7716378, 7665138, 7647635, 7627672, 7596695
7577833, 7552126, 7392241, 7236491, 7139267, 6748084, 6658114, 6535516
6363075, 6324286, RE44701, 8392563, 8103770, 7831712, 7606912, 7346695
7287084, 6970933, 6473802, 6374300
64-bit Advanced Core OS (ACOS) version 4.1.0, build 324 (Jan-08-2016,05:26)
Booted from Hard Disk primary image
Licenses: Bandwidth
Serial Number: N/A
aFleX version: 2.0.0
aXAPI version: 3.0
Hard Disk primary image (default) version 4.1.0, build 324
Hard Disk secondary image version 2.7.2-P4, build 76
Last configuration saved at Jan-8-2016, 18:34
Virtualization type: KVM
Hardware: Thunder HVA
Build Type: Internal
Hardware: 1 CPUs(Stepping 3), Single 8G Hard disk
Memory 2046 Mbyte, Free Memory 509 Mbyte
Hardware Manufacturing Code: N/A
Current time is Jan-9-2016, 01:32
The system has been up 0 day, 6 hours, 56 minutes
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 358
A10 Thunder Series and AX Series—Command Line Interface Reference
show vlan counters
Description View statistics/counters for configured VLANs or a specific VLAN.
Syntax show vlan counters [vlan-id]
Parameter Description
vlan-id View counters for the specified VLAN only (2-4094).
Mode All
Example Example output for this command, for a specific VLAN:
ACOS> show vlan counters 10
Broadcast counter
Multicast counter 0
IP Multicast counter 0
Unknown Unicast counter 0
Mac Movement counter 0
show vlans
Description Display the configured VLANs.
Syntax show vlans [vlan-id]
Parameter Description
vlan-id View information for the specified VLAN only (1-4094).
Mode All
Example The following command lists all the VLANs configured on an ACOS device:
ACOS# show vlans
Total VLANs: 4
VLAN 1, Name [DEFAULT VLAN]:
Untagged Ethernet Ports: 3 4 6 7 8 9 10 11
12 13 14 15 16 17 18 19
20
Tagged Ethernet Ports: None
Untagged Logical Ports: None
Tagged Logical Ports: None
VLAN 60, Name [None]:
page 359 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
Untagged Ethernet Ports: None
Tagged Ethernet Ports: 2
Untagged Logical Ports: None
Tagged Logical Ports: None
Router Interface: ve 60
VLAN 100, Name [None]:
Untagged Ethernet Ports: None
Tagged Ethernet Ports: 5
Untagged Logical Ports: None
Tagged Logical Ports: None
Router Interface: ve 100
VLAN 120, Name [None]:
Untagged Ethernet Ports: None
Tagged Ethernet Ports: 1
Untagged Logical Ports: None
Tagged Logical Ports: None
Router Interface: ve 120
show vpn
Description Show VPN information.
Syntax show vpn [
all-partitions |
crl |
default |
ike-sa |
ike-stats |
ike-stats-global |
ipsec-sa |
log |
ocsp
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 360
A10 Thunder Series and AX Series—Command Line Interface Reference
partition {shared | partition-name}
]
Parameter Description
all-partitions Show VPN configuration summary for all partitions.
crl Show cached VPN Certificate Revocation Lists (CRL) certificates.
default Show default VPN configuration.
ike-sa Show VPN IKE Security Association (SA).
ike-stats Show VPN IKE statistics.
ike-stats-global Show VPN IKE global statistics.
ipsec-sa Show VPN IPsec Security Association (SA).
log Show VPJN log and debug information.
ocsp Show cached VPN Online Certificate Status Protocol (OCSP) cer-
tificates.
partition Show VPN configuration for the specified partition only.
Mode All
Example Below is an example output for this command.
ACOS# show vpn
IKE Gateway total: 0
IPsec total: 0
IKE SA total: 0
IPsec SA total: 0
IPsec mode: software
IPsec passthrough traffic
CPU 0 processed 0 packets
show vrrp-a
Description All show commands related to VRRP-A are available in Configuring VRRP-A High Availability.
show waf
Description Display information for the Web Application Firewall (WAF). See the Web Application Firewall
Guide.
page 361 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
show web-category
Description Show information the about current operation of the Web Category feature.
Syntax show web-category
{
bypassed-urls [num | all] |
database |
intercepted-urls [num | all] |
license |
url-category name [local-db-only] |
version
}
Parameter Description
bypassed- Lists the URLs bypassed by the Web Category feature.
urls
num – Specifies the number of URLs to list, 1-8000. The most recently
[num | all]
bypassed URLs, up to the number you specify, are listed.
all – Displays the entire list of URLs bypassed by the feature.
The entries are listed beginning with the most recently bypassed URL
on top. If a URL is bypassed multiple times, the URL is listed separately
for each time it bypassed.
By default, the 50 most recent entries are shown.
database Shows information about the currently loaded BrightCloud database.
intercepted- Lists the URLs intercepted by the Web Category feature.
urls
num – Specifies the number of URLs to list, 1-8000. The most recently
[num | all]
bypassed URLs, up to the number you specify, are listed.
all – Displays the entire list of URLs bypassed by the feature.
The entries are listed beginning with the most recently intercepted
URL on top. If a URL is intercepted multiple times, the URL is listed sep-
arately for each time it intercepted.
By default, the 50 most recent entries are shown.
license Shows detailed information about the license.
url-category Shows categories returned by BrightCloud library for the specified
url-name URL.
[local-db-
local-db-only – Checks only the local database and service cache.
only]
Does not make a cloud query to fetch the category list for this URL.
version Shows the current version of the Web Category engine.
Mode All
Example The following command shows the URLs bypassed by the Web Category feature:
ACOS#show web-category bypassed-urls
paper.example.com
paper.example.com
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 362
A10 Thunder Series and AX Series—Command Line Interface Reference
paper.example.com
paper.example.com
step.example.com
metrics1.example.com
step.example.com
paper.example.com
online.example.com
...
Example The following command shows information about the currently loaded BrightCloud data-
base:
ACOS#show web-category database
Database name : full_bcdb_4.457.bin
Database size : 352 MB
Database version : 457
Last Update Time : Fri Jan 23 00:00:40 2015
Next Update Time : Sat Jan 24 00:00:43 2015
Connection Status : GOOD
Last Successful Connection : Fri Jan 23 15:54:43 2015
Example The following command shows the URLs intercepted by the Web Category feature:
ACOS#show web-category intercepted-urls
fhr.data.example.com
fhr.data.example.com
fhr.data.example.com
aus3.example.org
blocklist.addons.example.org
aus4.example.org
Default versioncheck-bg.addons.example.org
versioncheck-bg.addons.example.org
services.addons.example.org
aus3.example.org
fhr.data.example.com
...
page 363 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
Example The following commands show the web categories to which some individual URLs belong.
In this example, the categories for the URLs in the ACOS device’s local database match the
most recent categorizations from the BrightCloud server.
ACOS#show web-category url-category www.google.com
Search Engines
ACOS#show web-category url-category www.google.com local-db-only
Search Engines
ACOS#show web-category url-category www.youtube.com
Streaming Media
ACOS#show web-category url-category www.youtube.com local-db-only
Streaming Media
Example The following command shows the current version of the Web Category engine:
ACOS#show web-category version
version: 4.0
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 364
AX Debug Commands
The AX debug subsystem enables you to trace packets on the ACOS device. To access the AX debug subsystem, enter the
following command at the Privileged EXEC level of the CLI:
ACOS# axdebug
The CLI prompt changes as follows:
ACOS(axdebug)#
This chapter describes the debug-related commands in the AX debug subsystem.
To perform ACOS debugging using this subsystem:
1. Use the filter command to configure packet filters to match on the types of packets to capture.
2. (Optional) Use the count command to change the maximum number of packets to capture.
3. (Optional) Use the timeout command to change the maximum number of minutes during which to capture packets.
4. (Optional) Use the incoming | outgoing command to limit the interfaces on which to capture traffic.
5. Use the capture command to start capturing packets. The ACOS device begins capturing packets that match the filter,
and saves the packets to a file or displays them, depending on the capture options you specify.
6. To display capture files, use the show axdebug file command.
7. To export capture files, use the export command at the Privileged EXEC or global configuration level of the CLI.
The AXdebug utility creates a debug file in packet capture (PCAP) format. The PCAP format can be read by third-party diag-
nostic applications such as Wireshark, Ethereal (the older name for Wireshark) and tcpdump. To simplify export of the PCAP
file, the ACOS device compresses it into a zip file in tar format. To use a PCAP file, you must untar it first.
The following commands are available:
• apply-config
• capture
• count
• delete
• filter
• incoming | outgoing
• length
page 365 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
• maxfile
• outgoing
• save-config
• timeout
apply-config
Description Apply an AXdebug configuration file.
AXdebug configuration files can be created with the save-config command.
Syntax apply-config file
Replace file with the name of an existing AXdebug configuration file (1-63 characters).
Mode AX debug
Example The following example applies the debug configuration saved in the example-ax-debug file:
ACOS# axdebug
ACOS(axdebug)# apply-config testfile
Applying debug commands
Done
example-ax-debug has been applied.
ACOS(axdebug)#
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 366
A10 Thunder Series and AX Series—Command Line Interface Reference
capture
Description Start capturing packets.
Syntax [no] capture parameter
Parameter Description
brief [save ...] Captures basic information about packets. (For save options, see save filename
below.)
detail [save ...] Captures packet content in addition to basic information. (For save options, see
save filename below.)
non-display [save ...] Does not display the captured packets on the terminal screen. Use the save options
to configure a file in which to save the captured packets.
save filename Saves captured packets in a file:
[max-packets]
• filename – Specifies the name of the packet capture file.
[incoming [portnum ...]]
[outgoing [portnum ...]] • max-packets – Specifies the maximum number of packets to capture in the file,
0-65535. To save an unlimited number of packets in the file, specify0.
• incoming [portnum ...] – Captures inbound packets. You can specify one or
more physical Ethernet interface numbers. Separate the interface numbers with
spaces. If you do not specify interface numbers, inbound traffic on all physical
Ethernet interfaces is captured.
• outgoing [portnum ...] – Captures outbound packets on the specified phys-
ical Ethernet interfaces or on all physical Ethernet interfaces. If you do not specify
interface numbers, outbound traffic on all physical Ethernet interfaces is captured.
Default By default, packets in both directions on all Ethernet data interfaces are captured.
NOTE: The traffic also must match the AX debug filters.
Mode AX debug
Usage To minimize the impact of packet capture on system performance, it is recommended that
you configure an AX debug filter before beginning the packet capture.
To display a list of AX debug capture files or to display the contents of a capture file, see
“show axdebug file” on page250.
Example The following command captures brief packet information for display on the terminal
screen. The output is not saved to a file.
ACOS# axdebug
ACOS(axdebug)# capture brief
Wait for debug output, enter  to exit