### Command Reference: A10 Thunder Series and AX Series

#### `show axdebug config-file`
- **Description**: Displays a list of the AX debug configuration files.
- **Syntax**: `show axdebug config-file`
- **Mode**: All
- **Example**:
  ```plaintext
  ACOS(axdebug)# show axdebug config-file
  ------------------------------------+--------------+----------------------------
  Filename | Size(Byte) | Date
  ------------------------------------+--------------+----------------------------
  file1 | 58801 | Tue Sep 23 22:49:07 2008
  file123 | 192 | Fri Sep 26 17:06:51 2008
  ------------------------------------+--------------+----------------------------
  Total: 2
  Maximum file number is: 100
  ```

#### `show axdebug file`
- **Description**: Displays AX debug capture files or their contents.
- **Syntax**: `show axdebug file [filename]`
- **Mode**: All
- **Examples**:
  - To list all AX debug capture files:
    ```plaintext
    ACOS(axdebug)# show axdebug file
    ------------------------------------+--------------+----------------------------
    Filename | Size(Byte) | Date
    ------------------------------------+--------------+----------------------------
    file1 | 58801 | Tue Sep 23 22:49:07 2008
    file123 | 192 | Fri Sep 26 17:06:51 2008
    ------------------------------------+--------------+----------------------------
    Total: 2
    Maximum file number is: 100
    ```
  - To display the contents of a specific file (e.g., `file123`):
    ```plaintext
    ACOS(axdebug)# show axdebug file file123
    Parse file for cpu #1:
    Parse file for cpu #2:
    15:16:05.788530 IP 10.10.11.30.http > 30.30.31.30.13649: S 2111796945:2111796945(0) ack 3775149588 win 5792
    15:16:05.788530 IP 10.10.11.30.http > 30.30.31.30.13649: . ack 150 win 54
    15:16:05.788530 IP 10.10.11.30.http > 30.30.31.30.13649: P 1:192(191) ack 150 win 54
    15:16:05.788530 IP 10.10.11.30.http > 30.30.31.30.13649: F 192:192(0) ack 151 win 54
    ```

#### `show axdebug filter`
- **Description**: Displays the configured AXdebug output filters.
- **Syntax**: `show axdebug filter [filter-num]`
- **Mode**: All

#### `show axdebug status`
- **Description**: Displays per-CPU packet capture counts for AXdebug.
- **Syntax**: `show axdebug status [cpu-num [...]]`
- **Mode**: All
- **Example**:
  ```plaintext
  ACOS(config)# show axdebug status
  axdebug is enabled
  6660 seconds left
  debug incoming interface 1
  debug outgoing interface 2 3 5 8 9 10 11 12
  maximum 111 packets
  Captured packet length 1111
  cpu#1 captured 4 packets.
  cpu#2 captured 1 packets.
  cpu#3 captured 8 packets.
  cpu#4 captured 1 packets.
  cpu#5 captured 0 packets.
  cpu#6 captured 6 packets.
  ```

#### `show backup`
- **Description**: Displays information about scheduled backups.
- **Syntax**: `show backup`
- **Mode**: All

#### `show bfd`
- **Description**: Displays information for Bidirectional Forwarding Detection (BFD).
- **Syntax**: `show bfd {neighbors [detail] | statistics}`
- **Parameters**:
  - `neighbors`: Displays summarized information for BFD neighbors.
  - `detail`: Displays detailed information for BFD neighbors.
  - `statistics`: Displays overall statistics for BFD packets.
- **Mode**: All
- **Examples**:
  - To view overall statistics for BFD packets:
    ```plaintext
    ACOS(config)# show bfd statistics
    IP Checksum error 0
    UDP Checksum error 0
    No session found with your_discriminator 0
    Multihop config mismatch 0
    BFD Version mismatch 0
    BFD Packet length field is too small 0
    BFD Packet data is short 0
    BFD Packet DetectMult is invalid 0
    BFD Packet Multipoint is invalid 0
    BFD Packet my_discriminator is invalid 0
    BFD Packet TTL/Hop Limit is invalid 0
    BFD Packet auth length is invalid 0
    BFD Packet auth mismatch 0
    BFD Packet auth type mismatch 0
    BFD Packet auth key ID mismatch 0
    BFD Packet auth key mismatch 0
    BFD Packet auth seq# invalid 0
    BFD Packet auth failed 0
    BFD local state is AdminDown 0
    BFD Destination unreachable 0
    BFD Other error 0
    ```
  - To display the BFD neighbor status:
    ```plaintext
    ACOS# show bfd neighbors
    Our Address Neighbor Address State Holddown txint mult diag
    219.0.0.1 219.0.0.2 Up 150 50 3 3/0
    219.0.1.1 219.0.1.2 Up 150 50 3 3/0
    219.0.2.1 219.0.2.2 Up 150 50 3 0/0
    219.0.3.1 219.0.3.2 Up 150 50 3 0/0
    219.0.4.1 219.0.4.2 Up 150 50 3 3/0
    219.0.5.1 219.0.5.2 Up 150 50 3 3/0
    219.0.6.1 219.0.6.2 Up 150 50 3 0/0
    219.0.7.1 219.0.7.2 Up 150 50 3 3/0
    ```
  - To display detailed BFD neighbor status:
    ```plaintext
    ACOS# show bfd neighbors detail
    Our Address 219.0.0.1
    Neighbor Address 219.0.0.2
    Clients OSPFv2, IS-IS
    Singlehop, Echo disabled, Demand disabled, UDP source port 53214
    Asynchronous mode, Authentication None
    CPU ID 2, Interface index 93
    Local State Up, Remote State Up, 2h:29m:45s up
    Local discriminator 0x00000fdf, Remote discriminator 0x0000006f
    Config DesiredMinTxInterval 50 milliseconds, RequiredMinRxInterval 50 milliseconds
    Local DesiredMinTxInterval 50 milliseconds, RequiredMinRxInterval 50 milliseconds
    Remote DesiredMinTxInterval 50 milliseconds, RequiredMinRxInterval 50 milliseconds
    Local Multiplier 3, Remote Multiplier 3
    Hold Down Time 150 milliseconds, Transmit Interval 50 milliseconds
    Local Diagnostic: Neighbor Signalled Session Down(3)
    Remote Diagnostic: No Diagnostic(0)
    Last sent echo sequence number 0x00000000
    Control Packet sent 215226, received 215195
    Echo Packet sent 0, received 0
    ```

#### `show bootimage`
- **Description**: Displays the software images stored on the ACOS device.
- **Syntax**: `show bootimage`
- **Mode**: All
- **Example**:
  ```plaintext
  ACOS# show bootimage
  (* = Default)
  Version
  -----------------------------------------------
  Hard Disk primary 4.0.0.485
  Hard Disk secondary 2.7.2-P2-SP6.1 (*)
  Compact Flash primary 2.7.2.191 (*)
  Compact Flash secondary 2.7.2.191
  ```

#### `show bpdu-fwd-group`
- **Description**: Displays the configured Bridge Protocol Data Units (BPDU) forwarding groups.
- **Syntax**: `show bpdu-fwd-group [number]`
- **Mode**: All
- **Example**:
  ```plaintext
  ACOS# show bpdu-fwd-group
  BPDU forward Group 1 members: ethernet 1 to 3
  BPDU forward Group 2 members: ethernet 9 to 12
  ```

#### `show bridge-vlan-group`
- **Description**: Displays information for a bridge VLAN group.
- **Syntax**: `show bridge-vlan-group [group-id]`
- **Mode**: All

#### `show bw-list`
- **Description**: Shows black/white list information.
- **Syntax**: `show bw-list [name [detail | ipaddr]]`
- **Parameters**:
  - `name`: Name of a black/white list.
  - `detail`: Displays the IP addresses contained in a black/white list.
  - `ipaddr`: IP address within the black/white list.
- **Mode**: Config
- **Examples**:
  - To list all black/white lists:
    ```plaintext
    ACOS# show bw-list
    Name Url Size(Byte) Date
    ----------------------------------------------------------------------------
    bw1 tftp://192.168.1.143/bwl.txt 106 Jan/22 12:48:01
    bw2 tftp://192.168.1.143/bw2.txt 211 Jan/23 10:02:44
    bw3 tftp://192.168.1.143/bw3.txt 192 Feb/11 08:02:01
    bw4 Local 82 Dec/12 21:01:05
    Total: 4
    ```
  - To display the IP addresses in a specific black/white list (e.g., `test`):
    ```plaintext
    ACOS# show bw-list test detail
    Name: test
    URL: tftp://192.168.20.143/bwl_test.txt
    Size: 226 bytes
    Date: May/11 12:04:00
    Update period: 120 seconds
    Update times: 2
    Content
    ----------------------------------------------------------------------------
    1.1.1.0 #13
    1.1.1.1 #13
    1.1.1.2 #13
    1.1.1.3 #13
    1.1.1.4 #13
    9.9.99.9 9
    1.2.3.4/32 31
    4.3.2.1/24 4
    10.1.2.1/32 1
    10.1.2.2/32 2
    10.1.2.3/32 3
    10.1.2.4/32 4
    10.3.2.1/32 3
    10.3.2.2/32 4
    ```

This document provides a comprehensive reference for various `show` commands in the A10 Thunder Series and AX Series, detailing their descriptions, syntax, modes, and examples.