# SNMP Statistics
- **Encoding Error**: 0
- **Unknown Security Models**: 0
- **Invalid ID**: 0
- **Input Packets**: 0
- **Number of Requested Variables**: 0
- **Get-Request PDUs**: 0
- **Get-Next PDUs**: 0
- **Packets Dropped**: 0
- **Too Big Errors**: 0
- **No Such Name Errors**: 0
- **Bad Values Errors**: 0
- **General Errors**: 0
- **Output Packets**: 0
- **Get-Response PDUs**: 0
- **SNMP Output Traps**: 0

## `show startup-config`
### Description
Displays a configuration profile or a list of all locally saved configuration profiles.

### Syntax
- `show startup-config all`
- `show startup-config [profile profile-name [all-partitions | partition {shared | partition-name}]]`

### Parameters
- **`profile profile-name`**: Displays the commands in the specified configuration profile.
- **`all`**: Lists all locally stored configuration profiles.
- **`all-partitions`**: Shows resources in all partitions, with shared partition resources listed first, followed by private partitions.
- **`partition {shared | partition-name}`**: Shows resources in the specified partition.

### Usage
- The profile name must be specified before any partition names.
- The `all-partitions` and `partition partition-name` options are applicable to ACOS devices configured with L3V partitions. If both options are omitted, only the shared partition resources are shown.
- The `all-partitions` option is available only to admins with Root, Read-write, or Read-only privileges.
- Without the `all` or `profile-name` option, this command displays the current `startup-config` profile.

### Example
```plaintext
ACOS# show startup-config partition companyB
Show startup-config profile in partition "companyB"
Building configuration...
!Current configuration: 2442 bytes
!Configuration last updated at 11:23:01 IST Tue Sep 30 2014
!Configuration last saved at 11:31:59 IST Tue Sep 30 2014
!
active-partition companyB
!
exit
!
!
ip access-list test
remark 123
exit
!
!
ipv6 access-list test
remark 123
exit
!
...
```

## `show statistics`
### Description
Displays packet statistics for Ethernet interfaces.

### Syntax
- `show statistics [interface int-type port-num]`

### Mode
- All

### Example
```plaintext
ACOS# show statistics
Port Good Rcv Good Sent Bcast Rcv Bcast Sent Errors
---------------------------------------------------------------------------
1 3026787 3013699 91573 154220 0
2 0 0 0 0 0
3 0 0 0 0 0
...
```

## `show store`
### Description
Displays the configured file transfer profiles in the credential store.

### Syntax
- `show store [backup | export | import] name`

### Mode
- All

### Example
```plaintext
ACOS(config)# show store export
Export Store Information
StoreName url SuccessRate FailedRate
=============================================================================================
green-export-store tftp://:****@172.17.3.156/green.txt 0 0
```

## `show switch`
### Description
Displays internal system information from the ASIC registers for troubleshooting.

### Note
- This command is supported on some AX Series devices, and not all parameters are supported on all devices. Use the `?` character to check support.

### Syntax
- `show switch {debug | mac-table | vlan-table | xfp-temp}`

### Parameters
- **`debug`**: View debug information.
- **`mac-table`**: View MAC addresses configured on the ASIC.
- **`vlan-table`**: View VLANs configured on the ASIC.
- **`xfp-temp`**: View XFP temperatures.

### Mode
- All

## `show system cpu-list`
### Description
Displays the CPU list.

### Syntax
- `show system cpu-list`

### Mode
- All

## `show system cpu-load-sharing`
### Description
Displays CPU load sharing information.

### Syntax
- `show system cpu-load-sharing [statistics [detail]]`

### Parameters
- **`statistics`**: Shows CPU load sharing statistics.
- **`detail`**: Shows per-CPU counters.

### Mode
- All

### Example
```plaintext
ACOS(config)# show system cpu-load-sharing statistics
CPU Load-Sharing Stats
---------------------
Load Sharing Triggered 1
Load Sharing Untriggered 1

ACOS(config)# show system cpu-load-sharing
CPUs in Load-Sharing Mode: 1 2 3
```

## `show system platform`
### Description
Displays platform-related information and statistics.

### Syntax
- `show system platform {buffer-stats | cpu-packet-statistics | busy-counter | interface-stats | statistics}`

### Parameters
- **`buffer-stats`**: Shows buffer statistics.
- **`cpu-packet-statistics`**: Shows per-CPU packet statistics.
- **`busy-counter`**: Shows system busy statistics.
- **`interface-stats`**: Shows interface statistics.
- **`statistics`**: Shows internal statistics.

### Mode
- All

### Example
```plaintext
ACOS# show system platform buffer-stats
# buffers in Q0 cache: 2049 App: 0 TCPQ: 0 misc: 0
# buffers in Q1 cache: 4096 App: 0 TCPQ: 0 misc: 0
...
Approximate # buffers free 100351
Approximate # buffers avail from HW 99309
```

## `show system port-list`
### Description
Displays the port list.

### Syntax
- `show system port-list`

### Mode
- All

## `show system resource-usage`
### Description
Displays the minimum and maximum numbers of system resources that can be configured or used, the default maximum, and the number currently in use.

### Syntax
- `show system resource-usage [template [default | template-name]]`

### Mode
- All

### Usage
- To change system resource usage settings, see `system resource-usage` on page 200.
- A reload or reboot is required after making changes to system resource-usage settings.

### Example
```plaintext
ACOS# show system resource-usage
Resource Current Default Minimum Maximum
--------------------------------------------------------------------------
l4-session-count 16777216 16777216 4194304 33554432
class-list-ipv6-addr-count 1024000 1024000 1024000 2048000
...
```

## `show tacacs-server`
### Description
Displays TACACS statistics.

### Syntax
- `show tacacs-server [hostname | ipaddr]`

### Parameters
- **`hostname`**: Display information for the server with the specified host name.
- **`ipaddr`**: Display information for the server with the specified IP address.

### Mode
- All

### Example
```plaintext
ACOS# show tacacs-server 5.5.5.5
TACACS+ server : 5.5.5.5:49
Socket opens: 0
Socket closes: 0
Socket aborts: 0
Socket errors: 0
Socket timeouts: 0
Failed connect attempts: 0
Total packets recv: 0
Total packets send: 0
```

## `show techsupport`
### Description
Displays or exports system information for troubleshooting.

### Syntax
- `show techsupport [export [use-mgmt-port] url] [page]`

### Options
- **`export`**: Export the output to a remote server.
- **`use-mgmt-port`**: Use the management port for the export.
- **`url`**: The file transfer protocol, username (if required), and directory path.
- **`page`**: Show the information page by page.

### Mode
- Privileged EXEC level and configuration levels

### Example
```plaintext
ACOS# show techsupport page
============= Clock Info  =============
.14:51:42 IST Tue Sep 30 2014
============= Version Info  =============
AX Series Advanced Traffic Manager AXSoftAX
Copyright 2007-2014 by A10 Networks, Inc. All A10 Networks products are
protected by one or more of the following US patents:
...
```

## `show terminal`
### Description
Shows the terminal settings.

### Syntax
- `show terminal`

### Mode
- All

### Example
```plaintext
ACOS# show terminal
Idle-timeout is 00:59:00
Length: 32 lines, Width: 90 columns
Editing is enabled
History is enabled, history size is 256
Auto size is enabled
Terminal monitor is off
Terminal prompt format: hostname
Command timestamp format: none
```

## `show tftp`
### Description
Displays the currently configured TFTP block size.

### Syntax
- `show tftp`

### Mode
- All

### Example
```plaintext
ACOS(config)# show tftp
TFTP client block size is set to 512
```

## `show trunk`
### Description
Shows information about a trunk group.

### Syntax
- `show trunk num`