This section contains the following:
• Viewing the CLI Quick Reference Using the help Command
• Viewing Context-Sensitive Help in the CLI
• Using the no Command
• Configuring and Viewing Command History
• Editing Features and Shortcuts
• Searching and Filtering CLI Output
• Working with Regular Expressions
• Special Character Support in Strings
Viewing the CLI Quick Reference Using the help Command
Entering the help command (available at any command level) returns the CLI Quick Reference, as follows:
ACOS> help
CLI Quick Reference
===============
1. Online Help
page 5 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
CLI Quick Reference
Enter “?” at a command prompt to list the commands available at that CLI level.
Enter "?" at any point within a command to list the available options.
Two types of help are provided:
1) When you are ready to enter a command option, type "?" to display each
possible option and its description. For example: show ?
2) If you enter part of an option followed by "?", each command or option that
matches the input is listed. For example: show us?
2. Word Completion
The CLI supports command completion, so you do not need to enter the entire
name of a command or option. As long as you enter enough characters of the
command or option name to avoid ambiguity with other commands or options, the
CLI can complete the command or option.
After entering enough characters to avoid ambiguity, press "tab" to
auto-complete the command or option.
ACOS>
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 6
A10 Thunder Series and AX Series—Command Line Interface Reference
CLI Quick Reference
Viewing Context-Sensitive Help in the CLI
Enter a question mark (?) at the system prompt to display a list of available commands for each command mode. The con-
text-sensitive help feature provides a list of the arguments and keywords available for any command.
To view help specific to a command name, a command mode, a keyword, or an argument, enter any of the commands sum-
marized in Table2:
TABLE 2 CLI Help Commands
Prompt Command Purpose
ACOS> Help Displays the CLI Quick Reference
abbreviated-command-help? Lists all commands beginning with abbreviation before
the (?). If the abbreviation is not found, ACOS returns:
or
% Unrecognized command.Invalid input
ACOS# detected at '^' marker.
abbreviated-command-complete Completes a partial command name if unambiguous.
or ? Lists all valid commands available at the current level
command ? Lists the available syntax options (arguments and key-
(config)# words) for the entered command.
command keyword ? Lists the next available syntax option for the command.
A space (or lack of a space) before the question mark (?) is significant when using context-sensitive help. To determine which
commands begin with a specific character sequence, type in those characters followed directly by the question mark; e.g.
ACOS#te?. Do not include a space. This help form is called “word help”, because it completes the word for you.
To list arguments or keywords, enter a question mark (?) in place of the argument or the keyword. Include a space before the
(?); e.g. ACOS# terminal ?. This form of help is called “command syntax help”, because it shows you which keywords or
arguments are available based on the command, keywords, and arguments that you already entered.
Users can abbreviate commands and keywords to the minimum number of characters that constitute a unique abbreviation.
For example, you can abbreviate the config terminal command to conf t. If the abbreviated form of the command is
unique, then ACOS accepts the abbreviated form and executes the command.
Context Sensitive Help Examples
The following example illustrates how the context-sensitive help feature enables you to create an access list from configura-
tion mode.
Enter the letters co at the system prompt followed by a question mark (?). Do not leave a space between the last letter and
the question mark. The system provides the commands that begin with co.
ACOS# co?
configure Entering config mode
ACOS# co
Enter the configure command followed by a space and a question mark to list the keywords for the command and a brief
explanation:
ACOS# configure ?
terminal Config from the terminal
page 7 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
CLI Quick Reference
ACOS# configure
The  symbol (“cr” stands for carriage return) appears in the list to indicate that one of your options is to press the Return
or Enter key to execute the command, without adding any additional keywords.
In this example, the output indicates that your only option for the configure command is configure terminal (config-
ure manually from the terminal connection).
Using the no Command
Most configuration commands have a no form. Typically, you use the no form to disable a feature or function. The command
without the no keyword is used to re-enable a disabled feature or to enable a feature that is disabled by default; for example,
if the terminal auto-size has been enabled previously. To disable terminal auto-size, use the no terminal auto-size form
of the terminal auto-size command. To re-enable it, use the terminal auto-size form. This document describes
the function of the no form of the command whenever a no form is available.
Configuring and Viewing Command History
The CLI provides a history or record of commands that you have entered. This feature is particularly useful for recalling long
or complex commands or entries, including access lists. To use the command history feature, perform any of the tasks
described in the following sections:
• Setting the command history buffer size
• Recalling commands
• Disabling the command history feature
Setting the Command History Buffer Size
ACOS records 256 command lines in its history buffer, by default. To change the number of command lines that the system
will record during the current terminal session, use the terminal history command.
From Privileged-EXEC mode, use the terminal history command to set the buffer size for the current session. For exam-
ple, to set the buffer to 500, then verify the change with the show terminal command:
ACOS# terminal history size 500
ACOS# show terminal | sec history
History is enabled, history size is 500
ACOS#
Use the no terminal history size command to reset the buffer size for this session to the default value. For example:
ACOS# no terminal history size
ACOS# show terminal | sec history
History is enabled, history size is 256
ACOS#
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 8
A10 Thunder Series and AX Series—Command Line Interface Reference
CLI Quick Reference
If you use the terminal history command from Global configuration mode, you are making a more permanent change
on the system; the buffer size will be the same for all configuration sessions, not just the current session.
Recalling Commands
To recall commands from the history buffer, use one of the commands or key combinations described in Table3:
TABLE 3 Recalling CLI Commands
Command or Key Combination Description
Ctrl+P or Up Arrow key.* Recalls commands in the history buffer, beginning with the most recent command.
Repeat the key sequence to recall successively older commands.
Ctrl+N or Down Arrow key. *. Returns to more recent commands in the history buffer after recalling commands
with Ctrl+P or the Up arrow key. Repeat the key sequence to recall successively more
recent commands.
ACOS> show history While in EXEC mode, lists the most recent commands entered.
*. The arrow keys function only on ANSI-compatible terminals.
Editing Features and Shortcuts
A variety of shortcuts and editing features are enabled for the CLI. The following subsections describe these features:
• Positioning the cursor on the command line
• Completing a partial command name
• Recalling deleted entries
• Editing command lines that wrap
• Deleting entries
• Continuing output at the --MORE-- prompt
• Re-displaying the current command line
• Editing Pre-configured SLB Items
Positioning the Cursor on the Command Line
The table below lists key combinations used to position the cursor on the command line for making corrections or changes.
The Control key (ctrl) must be pressed simultaneously with the associated letter key. The Escape key (esc) must be pressed
first, followed by its associated letter key. The letters are not case sensitive. Many letters used for CLI navigation and editing
page 9 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
CLI Quick Reference
were chosen to simplify remembering their functions. In Table4, characters bolded in the Function Summary column indi-
cate the relation between the letter used and the function.
TABLE 4 Position the Cursor in the CLI
Keystrokes Function Summary Function Details
Left Arrow or Back character Moves the cursor left one character. When entering a command that
ctrl+B extends beyond a single line, press the Left Arrow or Ctrl+B keys repeatedly
to move back toward the system prompt to verify the beginning of the com-
mand entry, or you can also press Ctrl+A.
Right Arrow or Forward character Moves the cursor right one character.
ctrl+F
ctrl+A Beginning of line Moves the cursor to the very beginning of the command line.
ctrl+E End of line Moves the cursor to the very end of the line.
Completing a Partial Command Name
If you do not remember a full command name, or just to reduce the amount of typing you have to do, enter the first few let-
ters of a command, then press tab. The CLI parser then completes the command if the string entered is unique to the com-
mand mode. If the keyboard has no tab key, you can also press ctrl+I.
The CLI will recognize a command once you enter enough text to make the command unique. For example, if you enter
conf while in the privileged EXEC mode, the CLI will associate your entry with the config command, because only the config
command begins with conf.
In the next example, the CLI recognizes the unique string conf for privileged EXEC mode of config after pressing the tab key:
ACOS# conf
ACOS# configure
When using the command completion feature, the CLI displays the full command name. Commands are not executed until
the Enter key is pressed. This way you can modify the command if the derived command is not what you expected from the
abbreviation. Entering a string of characters that indicate more than one possible command (for example, te) results in the
following response from the CLI:
ACOS# te
% Ambiguous command
ACOS#
If the CLI can not complete the command, enter a question mark (?) to obtain a list of commands that begin with the char-
acter set entered. Do not leave a space between the last letter you enter and the question mark (?).
In the example above, te is ambiguous. It is the beginning of both the telnet and terminal commands, as shown in the fol-
lowing example:
ACOS# te?
telnet Open a telnet connection
terminal Set Terminal Parameters, only for current terminal
ACOS# te
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 10
A10 Thunder Series and AX Series—Command Line Interface Reference
CLI Quick Reference
The letters entered before the question mark (te) are reprinted to the screen to allow continuation of command entry from
where you left off.
Deleting Command Entries
If you make a mistake or change your mind, use the keys or key combinations in Table5 to delete command entries:
TABLE 5 Deleting CLI Entries
Keystrokes Purpose
backspace The character immediately left of the cursor is deleted.
delete or ctrl+D The character that the cursor is currently on is deleted.
ctrl+K All characters from the cursor to the end of the command line are deleted.
ctrl+U or ctrl+X All characters from the cursor to the beginning of the command line are deleted.
ctrl+W The word to the left of the cursor is deleted.
Editing Command Lines that Wrap
The CLI provides a wrap-around feature for commands extending beyond a single line on the display.
When the cursor reaches the right margin, the command line shifts ten spaces to the left. You cannot see the first ten charac-
ters of the line, but you can scroll back and check the syntax at the beginning of the command. To scroll back, press ctrl+B
or the left arrow key repeatedly until you scroll back to the command entry, or press ctrl+A to return directly to the begin-
ning of the line.
The ACOS software assumes you have a terminal screen that is 80 columns wide. If you have a different screen-width, use the
terminal width EXEC command to set the width of the terminal.
Use line wrapping in conjunction with the command history feature to recall and modify previous complex command
entries. See the Recalling Commands section in this chapter for information about recalling previous command entries.
Continuing Output at the Prompt
--MORE--
When working with the CLI, output often extends beyond the visible screen length. For cases where output continues
beyond the bottom of the screen, such as with the output of many ?, show, or more commands, the output is paused and a
--MORE-- prompt is displayed at the bottom of the screen.
To proceed, press the Enter key to scroll down one line, or press the spacebar to display the next full screen of output.
Redisplaying the Current Command Line
If you are entering a command and the system suddenly sends a message to your screen, you can easily recall your current
command line entry. To redisplay the current command line (refresh the screen), use either ctrl+L or ctrl+R.
page 11 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
CLI Quick Reference
Editing Pre-Configured SLB Items
You can display a list of SLB items that have been configured on the ACOS device by entering the partial command, followed
by the ‘?’ character. Previous releases required you to know the exact name of the real server or other item you wanted to
modify, but this feature enables you to display the items that are already configured without having to remember the exact
name.
The following SLB items can be viewed in this manner:
• slb server
• slb service-group
• slb virtual-server
• member (at service-group configuration level)
• service-group (at virtual-port configuration level)
The following example displays the names of real servers that are already configured on the ACOS device. All options dis-
played in the output except “NAME” are real servers.
ACOS(config)# slb server ?
NAME Server Name
a1
a2
deploy1
rs1
rs1-a1
rs1-a2
rs1-a3
ACOS2(config)# slb server
You can further refine the list that appears by entering part of the name. For example:
ACOS(config)# slb server a?
NAME Server Name
a1
a2
ACOS2(config)# slb server a
In the same manner that commands can be auto-completed by partially entering the command name and pressing ,
the ACOS device supports the ability to auto-complete the names of configured items. For example:
ACOS(config)# slb server d
ACOS(config)# slb server deploy1
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 12
A10 Thunder Series and AX Series—Command Line Interface Reference
CLI Quick Reference
Searching and Filtering CLI Output
This section contains the following topics:
• Common Output Filters
• Advanced Output Filters
• Examples of Filtering Output
Common Output Filters
The CLI permits searching through large amounts of command output by filtering the output to exclude information that
you do not need. The show command supports the output filtering options described in Table6:
TABLE 6 show Command Output Filters
Filter Description
begin string Begins the output with the line containing the specified string.
include string Displays only the output lines that contain the specified string.
exclude string Displays only the output lines that do not contain the specified string
section string Displays only the lines for the specified section (for example, “slb server”, “virtual-server”, or “log-
ging”). To display all server-related configuration lines, you can enter “server”.
Advanced Output Filters
Some show commands (for example, show log) provide additional output filtering options described in Table7. These
options are a subset of the standard sort commands available on UNIX operating systems.
TABLE 7 show log Command Output Additional Filters
Filter Description
grep [invert-match] string Display only those lines matching the specified grep expression.
awk [fs separator] print expression Displays only the fields matching the specified awk expression.
NOTE: When specifying multiple expressions, use quotations marks if
you need to have spaces. For example, the following expressions are
both valid; the first one prints two fields with no space, the second
encloses the space within quotation marks:
show log | awk fs : print $1,$2
show log | awk fs : print “$1, $2”
cut [delimiter char] fields field Do not show the output matching the specified cut expression.
sort [numeric-sort] [reverse] Sort the lines in the output based on the specified sort expression.
[unique]
uniq [skip-chars num] [skip-fields Show only unique lines in the output as defined by the specified
num] [count] [repeated] options.
page 13 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
CLI Quick Reference
Examples of Filtering Output
Use the pipe “ | ” character as a delimiter between the show command and the display filter.
• Example 1—Using Regular Expressions to Match a String
• Example 2—Viewing a Specific Section of the Configuration
• Example 3—Viewing Unique Output Strings
Example 1—Using Regular Expressions to Match a String
You can use regular expressions in the filter string, as shown in the following example:
ACOS(config)# show arp | include 192.168.1.3*
192.168.1.3 001d.4608.1e40 Dynamic ethernet4
192.168.1.33 0019.d165.c2ab Dynamic ethernet4
The output filter displays only the ARP entries that contain IP addresses that match “192.168.1.3” and any value following “3”.
The asterisk ( * ) matches on any pattern following the “3”. (See “Working with Regular Expressions” on page15.)
Example 2—Viewing a Specific Section of the Configuration
The following example displays the startup-config lines for “logging”:
ACOS(config)# show startup-config | section logging
logging console error
logging buffered debugging
logging monitor debugging
logging buffered 30000
logging facility local0
Example 3—Viewing Unique Output Strings
The following example shows how to use the advanced options to string multiple filters together so that only unique error
log messages are displayed:
AX5100(config)# show log | grep Error | sort | uniq
Apr 03 2015 01:55:42 Error [SYSTEM]:The user, admin, from the remote host,
172.17.1.169:52130, failed in the CLI authentication.
Apr 06 2015 21:48:45 Error [SYSTEM]:The user, admin, from the remote host,
172.17.1.169:51582, failed in the CLI authentication.
Apr 08 2016 08:52:36 Error [SYSTEM]:The user, admin, from the remote host,
172.17.0.224:62585, failed in the CLI authentication.
Apr 08 2016 19:58:13 Error [CLI]:Failed to register routing module commands
Apr 08 2016 19:58:13 Error [CLI]:Unrecognized command: "ospf" in module if
...
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 14
A10 Thunder Series and AX Series—Command Line Interface Reference
CLI Quick Reference
Working with Regular Expressions
Regular expressions are patterns (e.g. a phrase, number, or more complex pattern) used by the CLI string search feature to
match against show or more command output. Regular expressions are case sensitive and allow for complex matching
requirements. A simple regular expression can be an entry like Serial, misses, or 138. Complex regular expressions can be an
entry like 00210... , ( is ), or [Oo]utput.
A regular expression can be a single-character pattern or a multiple-character pattern. This means that a regular expression
can be a single character that matches the same single character in the command output or multiple characters that match
the same multiple characters in the command output. The pattern in the command output is referred to as a string. This
section describes creating single-character patterns.
Single-Character Patterns
The simplest regular expression is a single character that matches the same single character in the command output. You
can use any letter (A–Z, a–z) or digit (0–9) as a single-character pattern. You can also use other keyboard characters (such as !
or ~) as single-character patterns, but certain keyboard characters have special meaning when used in regular expressions.
Table8 lists the keyboard characters that have special meaning.
TABLE 8 Single-Character Regular Expression Patterns
Character Meaning
. Matches any single character, including white space
* Matchers 0 or more sequences of the pattern
+ Matches 1 or more sequences of the pattern
? Matches 0 or 1 occurrences of the pattern
^ Matches the beginning of the string
$ Matches the end of the string
_ (underscore) Matches a comma (,), left brace ({), right brace (}), left parenthesis ( ( ), right parenthesis ( ) ), the
beginning of the string, the end of the string, or a space.