nation.
show ip interfaces | show ipv6 interfaces
Description Display IP interfaces.
Syntax show {ip | ipv6} interfaces
[ethernet num] |
[ve num] |
[loopback num] |
[management] |
[trunk [num]] |
[lif [num]]
Mode All
Example The following command shows the IPv4 interfaces configured on Ethernet interface 1:
ACOS#show ip interfaces ethernet 1
IP addresses on ethernet 1:
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 298
A10 Thunder Series and AX Series—Command Line Interface Reference
ip 10.10.10.241 netmask 255.255.255.0 (Primary)
ip 10.10.10.242 netmask 255.255.255.0
ip 10.10.10.243 netmask 255.255.255.0
ip 10.10.10.244 netmask 255.255.255.0
ip 10.10.11.244 netmask 255.255.255.0
Example The following command shows the IPv4 interfaces configured on VEs:
ACOS#show ip interfaces ve
Port IP Netmask PrimaryIP
--------------------------------------------------
--------------------------------------------------
ve4 60.60.60.241 255.255.255.0 Yes
50.60.60.241 255.255.252.0 No
--------------------------------------------------
ve6 99.99.99.241 255.255.255.0 Yes
The PrimaryIP column indicates whether the address is the primary IP address for the
interface. (For more information, see the ip address command in the “Config Commands:
Interface” chapter of the Network Configuration Guide.
show ip isis | show ipv6 isis
Description See the “Config Commands: Router - IS-IS” chapter in the Network Configuration Guide.
show ip nat alg pptp
Description Display Application Level Gateway (ALG) information for IP source NAT.
Syntax show ip nat alg pptp {statistics | status}
Example The following command displays the status of the PPTP NAT ALG feature:
ACOS#show ip nat alg pptp status
NAT ALG for PPTP is enabled on port 1723.
Example The following command displays PPTP NAT ALG statistics.
ACOS(config-if:ethernet:2)#show ip nat alg pptp statistics
Statistics for PPTP NAT ALG:
-----------------------------
Calls In Progress: 10
Call Creation Failure: 0
Truncated PNS Message: 0
Truncated PAC Message: 0
Mismatched PNS Call ID: 1
Mismatched PAC Call ID: 0
page 299 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
Retransmitted PAC Message: 3
Truncated GRE Packets: 0
Unknown GRE Packets: 0
No Matching GRE Session: 4
The following table describes the fields in the command output.
Field Description
Calls In Progress Current call attempts, counted by inspecting the TCP control session. This counter will
decrease once the first GRE packet arrives.
Call Creation Failure Number of times a call could not be set up because the ACOS device ran out of mem-
ory or other system resources.
Truncated PNS Message Number of runt TCP PPTP messages received from clients.
Truncated PAC Message Number of runt TCP PPTP messages received from servers.
Mismatched PNS Call ID Number of calls that were disconnected because the GRE session had the wrong Call
ID.
Mismatched PAC Call ID Number of calls that were disconnected because they had the wrong Call ID.
Retransmitted PAC Message Number of TCP packets retransmitted from PAC servers.
Truncated GRE Packets Number of runt GRE packets received by the ACOS device.
Unknown GRE Packets Number of GRE packets that were not used for PPTP and were dropped.
No Matching GRE Session Number of GRE PPTP packets sent with no current call.
show ip nat interfaces | show ipv6 nat interfaces
Description Display IP or IPv6 source NAT information for data interfaces.
Syntax show {ip | ipv6} nat interfaces
Example The following command shows the IP NAT interface settings:
ACOS#show ip nat interfaces
Total IP NAT Interfaces configured: 2
Interface NAT Direction
-----------------------------
ve10 outside
ve11 inside
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 300
A10 Thunder Series and AX Series—Command Line Interface Reference
show ip nat pool | show ipv6 nat pool
Description Display information for IP or IPv6 source NAT pools.
Syntax show {ip | ipv6} nat pool [pool-name] [statistics]
Parameter Description
pool-name Displays information only for the specified pool.
statistics Displays pool statistics.
Example The following command displays pool information:
ACOS#show ip nat pool
Total IP NAT Pools: 2
Pool Name Start Address End Address Mask Gateway Vrid
-----------------------------------------------------------------------------------------
dmz1 10.0.0.200 10.0.0.200 /24 0.0.0.0 default
dmz2 10.10.10.200 10.10.10.200 /24 0.0.0.0 default
The following table describes the fields in the command output.
Field Description
Pool Name Name of the pool.
Start Address Beginning IP address in the pool address range.
End Address Ending IP address in the pool address range.
Mask Network mask.
Gateway Default gateway for traffic mapped to an address in the pool.
Vrid VRRP-A VRID to which the pool is assigned, if applicable.
Entering a pool name displays the same fields but for only the specified pool:
ACOS#show ip nat pool dmz1
Pool Name Start Address End Address Mask Gateway Vrid
------------------------------------------------------------------------------------------
------
dmz1 10.0.0.200 10.0.0.200 /24 0.0.0.0 default
Example The following command displays pool statistics:
ACOS#show ip nat pool statistics
Pool Address Port Usage Total Used Total Freed Failed
-------------------------------------------------------------------------------
dmz1 10.0.0.200 0 0 0 0
Pool Address Port Usage Total Used Total Freed Failed
page 301 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
-------------------------------------------------------------------------------
dmz2 10.10.10.200 0 0 0 0
The following table describes the fields in the command output.
Field Description
Pool Name of the pool.
Address IP address in the pool.
Port Usage Number of Layer 4 protocol port mappings currently in use on the port.
Note: A local address can have multiple NAT mappings. Each NAT mapping for a local
address consists of an IP:port tuple.
Total Used Total number of port mappings (IP:port tuples) used from the pool.
Total Freed Total number of port mappings that were used and then returned to the pool.
Failed Number of mappings that failed.
show ip nat pool-group | show ipv6 nat pool-group
Description Display configuration information for IP or IPv6 source NAT pool groups.
Syntax show {ip | ipv6} nat pool-group [group-name]
show ip nat range-list
Description Displays information for IP source NAT range lists.
Syntax show ip nat range-list
Example The following command shows NAT range-list information:
ACOS(config)#show ip nat range-list
Total Static NAT range lists: 1
Name Local Address/Mask Global Address/Mask Count HA
--------------------------------------------------------------------------------
rl1 10.10.10.88/24 192.168.10.88/24 10 0
The following table describes the fields in the command’s output.
Field Description
Name Name of the range list.
Local Address/Mask Beginning local address of the range to be translated into global (NAT)
addresses.
Global Address/Mask Beginning global address of the range.
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 302
A10 Thunder Series and AX Series—Command Line Interface Reference
Field Description
Count Number of address translations in the range.
HA VRRP-A VRID to which the range list belongs, if applicable.
show ip nat static-binding
Description Display information for static IP source NAT bindings.
Syntax show ip nat static-binding [statistics] [ipaddr]
Parameter Description
statistics Displays statistics.
ipaddr Displays information for the specified IP address.
Example The following command displays the static source NAT binding for local address 10.10.10.20:
ACOS#show ip nat static-binding 10.10.10.20
Local Address 10.10.10.20 statically bound to Global Address 10.10.10.1
Example The following command displays static-binding statistics:
ACOS#show ip nat static-binding statistics
Source Address Port Usage Total Used Total Freed
---------------------------------------------------------------------------
10.10.10.20 0 0 0
The following table describes the fields in the command output.
Field Description
Source Address Source IP address that is statically mapped to a global IP address (source NAT address).
Port Usage Number of Layer 4 protocol port mappings currently in use by the local address.
Note: A local address can have multiple NAT mappings. Each NAT mapping for a local
address consists of an IP:port tuple.
Total Used Total number of port mappings (IP:port tuples) used by the inside address.
Total Freed Total number of port mappings returned to the static pool.
page 303 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
show ip nat statistics
Description Displays IP source NAT statistics.
Syntax show ip nat statistics
Example Displays IP NAT statistics:
ACOS(config)#show ip nat statistics
Outside interfaces: ethernet8, ethernet11, ve20, ve110, ve120
Inside interfaces: ethernet8, ethernet11, ve20, ve110, ve120
Hits: 1707 Misses: 0
Outbound TCP sessions created: 1363
Outbound UDP sessions created: 344
Outbound ICMP sessions created: 0
Inbound TCP sessions created: 0
Inbound UDP sessions created: 0
Dynamic mappings:
-- Inside Source
access-list 8 pool v4
start 10.10.120.200 end 10.10.120.202
total addresses 3, allocated 2315, misses 0
access-list v6 pool l3nat6
start 6020::203 end 6020::203
total addresses 1, allocated 0, misses 0
The output lists the inside NAT and outside NAT interfaces and provides address translation
statistics.
show ip nat template logging
Description Display configuration information for IP source NAT logging templates.
Syntax show ip nat template logging [template-name]
show ip nat timeouts
Description Display the IP source NAT protocol port timeouts.
Syntax show ip nat timeouts
Example The following command displays the timeout settings IP source NAT sessions.
ACOS(config)#show ip nat timeouts
NAT Timeout values in seconds:
TCP UDP ICMP
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 304
A10 Thunder Series and AX Series—Command Line Interface Reference
------------------------
300 300 fast
Service 53/udphas fast-aging configured
show ip nat translations
Description Display IP source NAT translations.
Syntax show ip nat translations
Mode All
Example The following command shows source NAT translations:
ACOS#show ip nat translations
Prot Inside global Inside local Outside local Outside global
Age Hash Type
------------------------------------------------------------------------------------------
---------------------
Tcp 10.10.120.200:33345 10.10.30.19:35955 10.10.120.124:1107
10.10.120.124:1107 0 1 NF NAT
Tcp 10.10.120.200:28260 10.10.30.16:64602 10.10.120.111:443
10.10.120.111:443 0 1 NS NAT
Tcp 10.10.120.200:29988 10.10.30.20:2466 10.10.120.111:80
10.10.120.111:80 0 1 NS NAT
Tcp 10.10.120.200:29952 10.10.30.16:64638 10.10.120.124:21
10.10.120.124:21 0 1 NS NAT
Tcp 10.10.120.200:9257 10.10.30.15:48569 10.10.120.124:1093
10.10.120.124:1093 0 1 NF NAT
Tcp 10.10.120.200:28170 10.10.30.18:38106 10.10.120.124:21
10.10.120.124:21 0 1 NS NAT
Tcp 10.10.120.200:29845 10.10.30.15:48619 10.10.120.111:443
10.10.120.111:443 0 2 NS NAT
Tcp 10.10.120.200:28716 10.10.30.15:48624 10.10.120.124:1111
10.10.120.124:1111 0 2 NF NAT
Tcp 10.10.120.200:29377 10.10.30.19:35947 10.10.120.111:80
10.10.120.111:80 0 2 NS NAT
Tcp 10.10.120.200:29179 10.10.30.15:48565 10.10.120.111:443
10.10.120.111:443 0 2 NS NAT
Tcp 10.10.120.200:21887 10.10.30.15:48635 10.10.120.124:1118
10.10.120.124:1118 0 2 NF NAT
Tcp 10.10.120.200:21800 10.10.30.18:38108 10.10.120.124:1097
10.10.120.124:1097 0 2 NF NAT
Tcp 10.10.120.200:29971 10.10.30.20:2467 10.10.120.111:443
10.10.120.111:443 0 2 NS NAT
page 305 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
The following table describes the fields in the command’s output.
Field Description
Prot Layer 4 protocol.
Inside global Global (NAT) address mapped by ACOS to the inside source address (the
inside local address).
Inside local Inside source address before translation.
Outside local Outside destination address of the traffic.
Outside global Outside destination address of the traffic. >
Age For dynamic mappings, indicates how many seconds the entry is allowed to
continue remaining idle before being removed. >
Hash >
Type Entry type:
• NF NAT – >
• NS NAT – >
show ip-list
Description Display IP-list information.
Syntax show ip-list [list-name]
Parameter Description
list-name Displays the configuration of the specified list. If you omit this option, the config-
ured IP lists are listed instead.
Mode All
Example The following example shows the IP lists configured on an ACOS device:
ACOS-Active(config)#show ip-list
Name Type Entries
--------------------------------------------------
sample_ip_list_ng IPv4 3
test-list IPv4 0
Total: 2
The following command shows the configuration of an individual IP list:
ACOS#show ip-list sample_ip_list_ng
ip-list sample_ip_list_ng
10.10.10.1
Document No.: 410-P2-CLI-001 - 6/17/2016 | page 306
A10 Thunder Series and AX Series—Command Line Interface Reference
20.20.3.1
123.45.6.7
show ipv6 ndisc
Description Display information for IPv6 router discovery.
Syntax show ipv6 ndisc router-advertisement
{ethernet portnum | ve ve-num | statistics}
Mode All
Example The following command displays configuration information for IPv6 router discovery on an
Ethernet interface. In this example, the interface is VE 10.
ACOS#show ipv6 ndisc router-advertisement ve 10
Interface VE 10
Send Advertisements: Enabled
Max Advertisement Interval: 200
Min Advertisement Interval: 150
Advertise Link MTU: Disabled
Reachable Time: 0
Retransmit Timer: 0
Current Hop Limit: 255
Default Lifetime: 200
Max Router Solicitations Per Second: 100000
HA Group ID: None
Number of Advertised Prefixes: 2
Prefix 1:
Prefix: 2001:a::/96
On-Link: True
Valid Lifetime: 4400
Prefix 2:
Prefix: 2001:32::/64
On-Link: True
Valid Lifetime: 2592000
The following command displays router discovery statistics:
ACOS(config)#show ipv6 ndisc router-advertisement statistics
IPv6 Router Advertisement/Solicitation Statistics:
--------------------------------------------------
Good Router Solicitations (R.S.) Received: 1320
Periodic Router Advertisements (R.A.) Sent: 880
R.S. Rate Limited: 2
R.S. Bad Hop Limit: 1
page 307 | Document No.: 410-P2-CLI-001 - 6/17/2016
A10 Thunder Series and AX Series—Command Line Interface Reference
R.S. Truncated: 0
R.S. Bad ICMPv6 Checksum: 0
R.S. Unknown ICMPv6 Code: 0
R.S. Bad ICMPv6 Option: 0
R.S. Src Link-Layer Option and Unspecified Address: 0
No Free Buffers to send R.A.: 0
The error counters apply to router solicitations (R.S.) that are dropped by the ACOS device.
The Src Link-Layer Option and Unspecified Address counter indicates the number of times
the ACOS device received a router solicitation with source address “::” (unspecified IPv6
address) and with the source link-layer (MAC address) option set.
NOTE: In the current release, the ACOS device does not drop IPCMv6 packets that have
bad (invalid) checksums.
show ipv6 neighbor
Description Display information about neighboring IPv6 devices.
Syntax show ipv6 neighbor [ipv6-addr]
Mode All
Example The following command shows IPv6 neighbors:
ACOS(config)#show ipv6 neighbor
Total IPv6 neighbor entries: 2
IPv6 Address MAC Address Type Age State Interface Vlan