Currently making a Cypher request over the REST API returns results as nested
arrays that contain maps instead of just an array of maps. This makes it
harder to decode. I currently read the entire response and then do string
replaces to fix it up before decoding it. If the format was more standard
(especially if I could get the desired results shown below) I could easily do
a streaming decode which would be a lot more efficient.
MATCH (u:User)  
RETURN {name: u.name, email: u.email} AS r
Actual Results
    {
      "columns": ["r"],
      "data":[
        [{"name":"foo", "email": "PI:EMAIL"}],
        [{"name":"bat", "email": "PI:EMAIL"}]  // note the extra brackets
      ]
    }
Expected Results
    {
      "columns": ["r"],
      "data":[
        {"name":"foo", "email": "PI:EMAIL"},
        {"name":"bat", "email": "PI:EMAIL"}
      ]
    }
Desired results:
    [
      {"name":"foo", "email": "PI:EMAIL"},
      {"name":"bat", "email": "PI:EMAIL"}
     ]
Is there any way to get to the expected or desired results with Cypher 2.0?