Subject: Issue with NOT IN Expression in Cypher Query

Dear Neo4j Team,

I am encountering an issue while using the `NOT IN` expression in my Cypher queries. Below, I have detailed my use case and the specific problem I am facing.

### Use Case 1:
**Query:**
```cypher
START cypher = node(4)
MATCH (cypher)-[:KNOWS]-(friends)
RETURN friends
```
**Expected Result:**
- Node 2
- Node 5

**Actual Result:**
- Node 2
- Node 5

This query works as expected.

### Use Case 2:
**Query:**
```cypher
START cypher = node(4)
MATCH (cypher)-[:KNOWS]-(friends)
WHERE NOT (ID(friends) IN [5])
RETURN friends
```
**Expected Result:**
- Node 2

**Actual Result:**
- Error: `java.lang.RuntimeException: java.lang.RuntimeException`

### Steps to Reproduce:
You can reproduce the issue by running the above queries on the following Neo4j instance: [http://tinyurl.com/bn35krt](http://tinyurl.com/bn35krt).

Thank you for your assistance in resolving this issue.

Best regards,
Gia