       +0x030 NtSystemRoot     : [260] Wchar
       +0x238 MaxStackTraceDepth : Uint4B
       +0x23c CryptoExponent   : Uint4B
       +0x240 TimeZoneId       : Uint4B
       +0x244 LargePageMinimum : Uint4B
       +0x248 AitSamplingValue : Uint4B
       +0x24c AppCompatFlag    : Uint4B
       +0x250 RNGSeedVersion   : Uint8B
       +0x258 GlobalValidationRunlevel : Uint4B
       +0x25c TimeZoneBiasStamp : Int4B
       +0x260 NtBuildNumber    : Uint4B
       +0x264 NtProductType    : _NT_PRODUCT_TYPE
       +0x268 ProductTypeIsValid : UChar
       +0x269 Reserved0        : [1] UChar
       +0x26a NativeProcessorArchitecture : Uint2B
       +0x26c NtMajorVersion   : Uint4B
       +0x270 NtMinorVersion   : Uint4B
       +0x274 ProcessorFeatures : [64] UChar
       +0x2b4 Reserved1        : Uint4B
       +0x2b8 Reserved3        : Uint4B
       +0x2bc TimeSlip         : Uint4B
       +0x2c0 AlternativeArchitecture : _ALTERNATIVE_ARCHITECTURE_TYPE
       +0x2c4 BootId           : Uint4B
       +0x2c8 SystemExpirationDate : _LARGE_INTEGER
       +0x2d0 SuiteMask        : Uint4B
       +0x2d4 KdDebuggerEnabled : UChar
       +0x2d5 MitigationPolicies : UChar
       +0x2d5 NXSupportPolicy  : Pos 0, 2 Bits
       +0x2d5 SEHValidationPolicy : Pos 2, 2 Bits
       +0x2d5 CurDirDevicesSkippedForDlls : Pos 4, 2 Bits
       +0x2d5 Reserved         : Pos 6, 2 Bits
       +0x2d6 Reserved6        : [2] UChar
       +0x2d8 ActiveConsoleId  : Uint4B
       +0x2dc DismountCount    : Uint4B
       +0x2e0 ComPlusPackage   : Uint4B
       +0x2e4 LastSystemRITEventTickCount : Uint4B
       +0x2e8 NumberOfPhysicalPages : Uint4B
       +0x2ec SafeBootMode     : UChar
       +0x2ed VirtualizationFlags : UChar
       +0x2ee Reserved12       : [2] UChar
       +0x2f0 SharedDataFlags  : Uint4B
       +0x2f0 DbgErrorPortPresent : Pos 0, 1 Bit
       +0x2f0 DbgElevationEnabled : Pos 1, 1 Bit
       +0x2f0 DbgVirtEnabled   : Pos 2, 1 Bit
       +0x2f0 DbgInstallerDetectEnabled : Pos 3, 1 Bit
       +0x2f0 DbgLkgEnabled    : Pos 4, 1 Bit
       +0x2f0 DbgDynProcessorEnabled : Pos 5, 1 Bit
       +0x2f0 DbgConsoleBrokerEnabled : Pos 6, 1 Bit
       +0x2f0 DbgSecureBootEnabled : Pos 7, 1 Bit
       +0x2f0 DbgMultiSessionSku : Pos 8, 1 Bit
       +0x2f0 DbgMultiUsersInSessionSku : Pos 9, 1 Bit
       +0x2f0 DbgStateSeparationEnabled : Pos 10, 1 Bit
       +0x2f0 SpareBits        : Pos 11, 21 Bits
       +0x2f4 DataFlagsPad     : [1] Uint4B
       +0x2f8 TestRetInstruction : Uint8B
       +0x300 QpcFrequency     : Int8B
       +0x308 SystemCall       : Uint4B
       +0x30c SystemCallPad0   : Uint4B
       +0x310 SystemCallPad    : [2] Uint8B
       +0x320 TickCount        : _KSYSTEM_TIME
       +0x320 TickCountQuad    : Uint8B
       +0x320 ReservedTickCountOverlay : [3] Uint4B
       +0x32c TickCountPad     : [1] Uint4B
       +0x330 Cookie           : Uint4B
       +0x334 CookiePad        : [1] Uint4B
       +0x338 ConsoleSessionForegroundProcessId : Int8B
       +0x340 TimeUpdateLock   : Uint8B
       +0x348 BaselineSystemTimeQpc : Uint8B
       +0x350 BaselineInterruptTimeQpc : Uint8B
       +0x358 QpcSystemTimeIncrement : Uint8B
       +0x360 QpcInterruptTimeIncrement : Uint8B
       +0x368 QpcSystemTimeIncrementShift : UChar
       +0x369 QpcInterruptTimeIncrementShift : UChar
       +0x36a UnparkedProcessorCount : Uint2B
       +0x36c EnclaveFeatureMask : [4] Uint4B
       +0x37c TelemetryCoverageRound : Uint4B
       +0x380 UserModeGlobalLogger : [16] Uint2B
       +0x3a0 ImageFileExecutionOptions : Uint4B
       +0x3a4 LangGenerationCount : Uint4B
       +0x3a8 Reserved4        : Uint8B
       +0x3b0 InterruptTimeBias : Uint8B
       +0x3b8 QpcBias          : Uint8B
       +0x3c0 ActiveProcessorCount : Uint4B
       +0x3c4 ActiveGroupCount : UChar
       +0x3c5 Reserved9        : UChar
       +0x3c6 QpcData          : Uint2B
       +0x3c6 QpcBypassEnabled : UChar
       +0x3c7 QpcShift         : UChar
       +0x3c8 TimeZoneBiasEffectiveStart : _LARGE_INTEGER
       +0x3d0 TimeZoneBiasEffectiveEnd : _LARGE_INTEGER
       +0x3d8 XState           : _XSTATE_CONFIGURATION
比较有意思的一些字段如TimeZoneId、KdDebuggerEnabled、DbgSecureBootEnabled、SystemCall、ImageFileExecutionOptions等等
###  3.2、内核态逆向分析NtSetInformationThread()的内部动作
说明下，我这里分析的是基于Win10
16299版本的ntoskrnl.exe这份文件；这个函数比较大，从IDA给出来的数据看，有一千多行，分几次截图，给出关键的代码数据进行分析；
函数的原型如上所示，函数实现关键部分如下图所示：
上边的代码简单解释下，代码中根据ThreadInformationClass对其做了简单的归类，根据我们传入的ThreadHideFromDebugger对应的数据是0x11，会执行go
LABEL_5;到了这个标签这，会顺序执行，最终来到第245行，按着这个if比较往下走，最终会来到下图所示的部分：
由上图所示，先一个if判断，判断传入的参数ThreadInformationLength是否为0，如果不是则直接返回错误，且错误码为0xC0000004，在全面的demo中，知道该参数传入的确实为0；紧接着下边调用ObpReferenceObjectByHandleWithTag()根据现场的句柄找到线程对象；通过第三个参数返回，即Thread；紧接着调用了InterlockedOr()，这个API是实现原子或操作的；但IDA给出的伪代码不太好，字段解析的有问题，我们看下反汇编代码，如下：
下边我们需要看下ETHREAD的0x6D0偏移处的字段是什么，直接用Windbg双机调试看下是最快的如下：
原来是设置的这个地方的HideFromDebugger位置，将其位置1；OK；NtSetInformationThread()的分析还差最后一步；即返回，如下图：
就直接返回了，简单明了；
###  3.3、OS在异常分发时，又是如何利用此数据的
想要知道如何使用的，最简单的办法就是在刚在这个位置，针对特定的线程下内存访问断点，直接命中就能通过栈回溯来找到；这个就留给大家自己去完成了；我们下边直接分析；张银奎老师那本《软件调试》书上有专门针对异常分析的具体讲解，核心的API有这么一个DbgkForwardException()；下面我们来逆向分析下这个API；
但是IDA反汇编的不好，为什么这么说呢？内核里几乎很少会用到TEB的东西，因为TEB里有的数据ETHREAD中都有，此外，这里访问TEB时也没加_try
_except，所以这里反汇编出来的伪代码很不好，我们直接看反汇编代码更为清晰，汇编代码如下：
有一些辅助知识，需要说明下，在x64架构的内核里，gs寄存器保存的是KPCR的基地址，KPCR是内核里，操作系统为每个CPU核维护的一份数据结构；该结构如下：
KPRCB作为KPCR的拓展字段，里边记录的数据更多，很多字段也都是非常常用的；其中有三个非常重要的字段：  
+0x008 CurrentThread : Ptr64 _KTHREAD：指向当前CPU正在执行的代码所属的线程的线程对象，即当前被调度到的线程对象；
+0x010 NextThread : Ptr64 _KTHREAD： 指向下一次调度时，需要调度的线程对象；
+0x018 IdleThread : Ptr64
_KTHREAD：指向当没有线程可调度时，可被调度的线程对象，这个线程一般做一些清理动作，比如清理内存，整理内存的那几个链表等等；优先级非常低；
看看上边的这个偏移，大概你也应该猜测到了吧，
    mov     rax, gs:188h
    mov     ecx, [rax+6D0h]
    test    cl, 4
    jnz     short loc_14044BDE0
这个指令就是获取的CurrentThread，然后取的偏移0x6D0处的数据；而这个0x6D0在上边也已经就分析过了，恰为_KTHREAD.HideFromDebugger；喔喔，异常分发函数DbgkForwardException()在分发异常时，查看了这个数据；如果这里置位了的话，那么逻辑就如下图所示了：
直接返回了，也就意味了不发送给调试器了，这就是线程调试逃逸的全部原理了；
## 4、总结
在本文中，自己编码实现了线程调试逃逸，学会运用这里技术手段；详细讲解了实现的技术细节，特别的讲解了为什么需要加一层try
except；而后我们由通过逆向手段来详细分析了OS是如何实现这一技术的，并且详细分析了在CPU触发报告异常到OS接管异常进行异常分发时是如何利用此数据达到对调试器隐藏线程异常的；特别的还拓展介绍了gs寄存器在x64架构下，内核是如何使用的；涉及到了KPCR，KPRCB等等关键数据结构；至此，整个技术点全部剖析完毕。